import React, { useState, useEffect } from "react";
import styles from "./Content.module.scss";
import Modal from "../Modal/Modal";
// import DescImage from "../DescImage/DescImage";

const Content = () => {
  const [modalActive, setModalActive] = useState(false);
  const [selected, setSelected] = useState(null);
  const [width, setWidth] = useState(0);
  const [position, setPosition] = useState({ left: 0 });
  const [sizeModal, setSizeModal] = useState(0);
  // const [content, setContent] = useState("");

  const handleItemClick = (item, width, left, sizeModal, content) => {
    setPosition(left);
    setSelected(item);
    setWidth(width);
    setModalActive(true);
    setSizeModal(sizeModal);
    // setContent(content);
  };

  return (
    <div className={styles.content}>
      <div className={styles.imperators}>
        <div className={styles.imp1}>
          <div className={styles.description}>
            <img
              id="Petr1"
              onClick={() =>
                handleItemClick(
                  [
                    {
                      name: "Петр I",
                      image: "/src/assets/img/museum2.png",
                    },
                  ],
                  380,
                  -100
                )
              }
              className={styles.descImage}
              src="/src/assets/img/museum2.png"
              alt="desc"
            />

            {selected && (
              <Modal
                active={modalActive}
                setActive={setModalActive}
                position={position}
              >
                {selected.length < 2 && (
                  <div className={styles.modal} style={{ width: sizeModal }}>
                    {selected.map((imageData) => (
                      <img
                        className={`${styles.imgModal} ${
                          imageData ? styles.imgModalActive : ""
                        }`}
                        src={imageData.image}
                        alt="x"
                        style={{
                          width: width,
                        }}
                      />
                    ))}
                  </div>
                )}
                {selected.length > 1 && (
                  <div
                    className={styles.modal}
                    style={{
                      width: sizeModal,
                      flexDirection: "column",
                      height: "1100px",
                      overflowY: "auto",
                    }}
                  >
                    <div className={styles.imageArray}>
                      {selected.map((imageData) => (
                        <img
                          className={`${styles.imgModal} ${
                            imageData ? styles.imgModalActive : ""
                          }`}
                          src={imageData.image}
                          alt="x"
                          style={{
                            width: width,
                          }}
                        />
                      ))}
                    </div>
                    <div className={styles.descriptionImage}>
                      <p
                        style={{
                          height: "770px",
                          textAlign: "center",
                          overflowY: "auto",
                        }}
                      >
                        <p style={{ fontSize: "20px", fontWeight: "bold" }}>
                          Изъяснение местности Санкт-Петербурга в 1840 году.
                        </p>
                        <br />
                        <b>ЧАСТИ ГОРОДА.</b> I. Первая Адмиралтейская. II.
                        Вторая Адмиралтейская. III. Третья Адмиралтейская. IV.
                        Четвертая Адмиралтейская. V. Нарвская. VI Московская
                        VII. Каретная. VIII. Рожественская. IX. Литейная. X.
                        Васильевская. XI. Петербургская. XII. Выборгская. XIII.
                        Охтенская.
                        <br />
                        <b>ОСТРОВА.</b> A. Елагинъ. B. Крестовскій. C. Каменный.
                        D. Петровскій. E. Голодай. F. Жадимировскаго. G.
                        Кашеварова. H. Гонаропуло. I. Галерный. J. Гутуевскій.
                        K. Резвый. L. Вольный. M. Канонерскій.
                        <br />
                        <b>ВОДЫ РѣКИ И КАНАЛЫ.</b> A. Р. Большая Нева. B. »
                        Малая Нева. C. » Большая Невка. D. » Малая Невка. а.
                        Мойка. b. Екатериненскій каналъ. c. Фонтанка. d.
                        Новообводный каналъ. e. Лиговскій каналъ. f. Карповка.
                        у. Р. Большая Охта. h. Глухое Озеро. I. Гавань ковжа. J.
                        Р. Пряжка. k. Крюковскій каналъ. l. Большой Бассейнъ m.
                        Малый Бассейнъ. n. Р. Черная.
                        <br />
                        <b>МОСТЫ.</b> A. Воскресенскій. B. Троицкій. C.
                        Исакіевскій. D. Тючьковъ. E. Самсонскій. F. 2-й
                        Каменно-Островскій. G. 3-й Елагинъ. H. 1-й Елагинъ. I.
                        Крестовскій. J. Ново-Крестовскій или Елагинскій. K. 1-й
                        Каменно-Островскій. L. Мостъ съ Петровскаго Острова на
                        Крестовкій. M. Прачешный N. Пантелеймонскій (цѣпной). O.
                        Симіоновскій P. Аничковъ. Q. Чернышевъ. R. Семеновскій.
                        S. Обуховъ. T. Измайловскій. U. Новой цѣпной
                        (Египетскій). V. Калинкинъ. W. Казанскій. X. Цѣпной
                        пѣшій. Y. Каменный. Z. Банковскій. А'. Кокушкинъ. В'.
                        Вознесенскій. С'. Львиный (цѣпной пѣшій). D'. Харламовъ.
                        Е'. Пѣкалевъ. F'. Аларчинъ. G'. Малый Калинкинскій. H'.
                        Лѣтній. I'. Михайловскій. J'. Театральный. K'.
                        Конюшенный. L'. Пѣвческій. М'. Полицейскій. N'. Красный.
                        O'. Синій. P'. Пѣшій цѣпной. Q'. Поцѣлуевъ. R'.
                        Храповицкій. S'. Сухарный. Т'. Заводскій. U'. Московкій.
                        V'. Нарвскій. W'. Аптекарскій. X'. Карповскій.
                        <br />
                        <b>1-Я АДМИРАЛТЕЙСКАЯ ЧАСТЬ. ПЛОЩАДИ.</b> 1.
                        Царицынская. 2. Дворцовая. 3. Адмиралтейская. 4.
                        Петровская. 5. Конно-Гвардейская. УЛИЦЫ. 6. Дворцовая
                        Набережная. 7. Невскій Проспектъ. 8. Адмиралтейская или
                        Гороховская. 9. Вознесенскій Проспектъ. 10. Англійская
                        Набережная. 11. Галерная. 12. Милліонная. 13. Большая
                        Морская. 14. Малая Морская. 15. Почтамтская. ДВОРЦЫ. И
                        ПРИНАДЛЕЖНОСТИ КЪ ОНЫМЪ. 16. Зимній ЕГО ИМПЕРАТОРСКАГО
                        ВЕЛИЧЕСТВА. 17. Большой и малый Эрмитажъ. 18. Театръ
                        Эрмитажа 19. Шепелевскій дворецъ. 20. Мраморный дворецъ.
                        21. Дворецъ ПЕТРА 1-го, и лѣтній садъ. МОНУМЕНТЫ. 22.
                        Императору АЛЕКСАНДРУ I. 23. Императору ПЕТРУ I. 24.
                        Князю Италійскому Графу Суворову- Рымнинскому. ЦЕРКВИ И
                        ЦЕРКОВНЫЯ ЗДАНІЯ. 25. Соборъ св. Исаакія Далмацкаго. 26.
                        Англійская церковь. 27. Домъ Исаакіевскаго Собора.
                        КАЗЕННЫЯ И ОБЩЕСТВЕННЫЯ ЗДАНІЯ. 28. Главный Штабъ ЕГО
                        ИМПЕРАТОРСКАГО ВЕЛИЧЕСТВА. 29. Министерство Иностранныхъ
                        дѣлъ. 30. Министерство Финансовъ. 31. Домъ Министерства
                        Иностранныхъ Дѣлъ. 32. Военное Министерство. 33. Домъ
                        Военнаго Министра. 34. Департаментъ Удѣловъ. 35. Домъ
                        Министерства Двора. 36. Домъ Министра Финансовъ. 37.
                        Гвардейскій Генеральный Штабъ. 38. Экзерцисъ-Гаузъ. 39.
                        Губернскія присутственныя мѣста. 40. Главное
                        Адмиралтейство. 41. Новое Адмиралтейство. 42. Домъ
                        Военнаго Генералъ-Губернатора. 43. Домъ
                        Оберъ-Полиціймейстера. 44. Правительствующій Сенатъ 45.
                        Святѣйшій Правительствующій Сѵнодъ. 46. ИМПЕРАТОРСКАЯ
                        Военная Академія. 47. Домъ Морскаго Министра. 48.
                        Музеумъ ГраФа Румянцева. 49. Почтовый Департаментъ. 50.
                        Домъ Вольнаго Экономическаго Общества 51. Домъ
                        Сарептскаго Общества. 52. Круглый рынокъ. КАЗАРМЫ. 53.
                        Л. Г. Павловскаго полка. 54. Л. Г. Преображенскаго
                        полка. 55. Флотскія полковыя. 56. Флотскія Казармы. 57.
                        14-го Флотскаго Экипажа. 58. Л. Г. Коннаго полка. 59.
                        Манежъ Л. Г. Коннаго нолка. 60. Конюшни Л. Г. Коннаго
                        полка. 61. Казармы Исправительныхъ Арестантскихъ ротъ.
                        ГОШПИТАЛИ. 62. Почтамтская. МАГАЗЕЙНЫ. И ДРОВЯНЫЕ ДВОРЫ.
                        63. Хлебные запасные магазеины. 64. Провіантскіе. 65.
                        Мясосольные. 66 Казенный дровяный дворъ. <br />
                        <b>2-Я АДМИРАЛТЕЙСКАЯ ЧАСТЬ. ПЛОЩАДИ.</b> 1.
                        Театральная. УЛИЦЫ. 2. Большая Конюшенная. 3. Малая
                        Конюшенная. 4. Большая Мѣщанская. 5. Средняя Мѣщанская.
                        6. Малая Мѣщанская. 7. Невскій Проспектъ. 8.
                        Адмиралтейская или Гороховская. 9. Вознесенскій
                        Проспектъ. 10. Фонарная. 11 ЕкатерннгоФскій Проспектъ
                        12. Офицерская. 13. Никольскій Проспектъ. 14. Столярная.
                        ДВОРЦЫ И ПРИНАДЛЕЖНОСТИ КЪ ОНЫМЪ. 15. Дворецъ ЕЯ
                        ИМПЕРАТОРСКАГО ВЫСОЧЕСТВА ВЕЛИКОЙ КНЯЖНЫ МАРІИ
                        НИКОЛАЕВНЫ. 16. Придворно-Конюшенная Контора. 17.
                        Придворный Пѣвческій Корпусъ 18. Придворная Гошпиталь.
                        МОНУМЕНТЫ. 19. Фелдьмаршалу Князю Кутузову-Смоленскому.
                        20. Фелдьмаршалу Князю ББарклаю де Толли. ЦЕРКВИ И
                        ЦЕРКОВНЫЯ ЗДАНІЯ. 21. Соборъ Казанскія Божіей Матери.
                        22. Домъ принадлежащій Казанскому Собору. 23. Соборъ Св.
                        Николая Чудотворца. 24. Домъ Никольскаго Собора. 25.
                        Шведская Церковь Св. Екатерины. 26. Финская Св. Маріи.
                        27. Реформатская Св. Павла. 28. Голландская. 29.
                        Лютеранская Св. Петра и Павла. КАЗЕННЫЯ И ОБЩЕСТВЕННЫЯ
                        ЗДАНІЯ. 30. ИМПЕРАТОРСКІЙ Воспитательный Домъ. 31.
                        Ломбардъ. 32. Опекунскій Совѣтъ. 33. 2-я С.
                        Петербургская Гимназія. 34. Домъ Министерства
                        Государственныхі Имуществъ. 35. Заемный Банкъ. 36.
                        Пожарное Депо. 37. Баталіонъ Военныхъ Кантонистовъ. 38.
                        Коммисаріатъ. 39. Домъ Государственнаго Контроля. 40.
                        Большой Театръ. 41. Домъ Морской Инженерной Команды. 42.
                        Домъ Министерства Финансовъ. 43. Домъ
                        Россійско-Американской Компаніи 44. Домъ Экспедиціи
                        Княжества Финляндскаго. 45. С. Петербургская Управа
                        Благочинія. 46. Смирительный и рабочій Домы. <br />
                        <b>3-Я АДМИРАЛТЕЙСКАЯ ЧАСТЬ ПЛОЩАДИ.</b> 1. Сѣнная. 2.
                        Обуховская. 3. Александрынскій скверъ. 4. Михайловскій
                        скверъ. УЛИЦЫ. 5. Михайловская. 6. Италіянская. 7.
                        Невскій Проспектъ. 8. Адмиралтейская или Гороховская. 9.
                        Вознесенскій Проспектъ. 10. Большая Садовая. 11.
                        ЕкатерингоФскій Проспектъ. 12. Каравайная. 13. Малая
                        Садовая. 14. Большая Подъяческая. 15. Средняя
                        Подъяческая. 16. Малая Подъяческая. ДВОРЦЫ. И
                        ПРИНАДЛЕЖНОСТИ КЪ ОНЫМЪ 17. Собственный ЕГО
                        ИМПЕРАТОРСКАГО ВЕЛИЧЕСТВА дворецъ. 18. ЕГО
                        ИМПЕРАТОРСКАГО ВЫСОЧЕСТВА ВЕЛИКАГО Князя МИХАИЛА
                        ПАВЛОВИЧА. МОНУМЕНТЫ. 19. ИМПЕРАТОРУ ПЕТРУ I. ЦЕРКВИ И
                        ЦЕРКОВНЫЯ ЗДАНІЯ. 20. Успѣнія Пресвятыя Богородицы. 21.
                        Вознесенія Господня. 22. Домъ Оберъ-Священника. 23.
                        Армянская церковь Св. Екатерины. 24. Католическая Св.
                        Екатерины. КАЗЕННЫЯ И ОБЩЕСТВЕННЫЯ ЗДАНІЯ. 25.
                        Инженерный Замокъ. 26. Фехтовальная школа. 27. Манежъ.
                        28. Экзерцисъ-Гаузъ. 29. Ордонансъ-Гаузъ. 30. Типографія
                        собственной Канцеляріи ЕГО ИМПЕРАТОРСКАГО ВЕЛИЧЕСТВА.
                        31. Департаментъ Государственнаго Казначейства. 32. Домъ
                        Министра Юстиціи. 33. Пажескій Корпусъ. 34.
                        Александрынскій Театръ. 35. Михайловскій Театръ. 36.
                        Циркъ. 37. Дирекція ИМПЕРАТОРСКИХЪ Теат¬ровъ. 38.
                        Театральное Училище. 39. Министерство Народнаго
                        Просвѣщенія. 40. Министерство Внутреннихъ Дѣлъ. 41.
                        Медицинскій Департаментъ Военнаго Министерства. 42.
                        Главная Аптека. 43. Кабинетъ ЕГО ВЕЛИЧЕСТВА. 44.
                        Коммисія погашенія Государственныхъ долговъ. 45.
                        Ассигнаціонный Банкъ. 46. Временное Отдѣленіе С.
                        Петербургской Управы Благочинія. 47. Институтъ Путей
                        Сообщенія. 48. Домъ Путей Сообщенія. 49. ИМПЕРАТОРСКАЯ
                        Публичная Библіотека. 50. Дворянское Собраніе. 51. Домъ
                        Военно-Щетной Экспедиціи. 52. Градская дума. 53.
                        Гостиный дворъ. 54. Апраксинъ дворъ. 55. Щукинъ дворъ.
                        56. Желѣзные ряды. 57. Никольскій рынокъ. ДРОВЯНЫЕ
                        ДВОРЫ. 58. Дровяной дворъ Михайловскаго дворца. 59.
                        Лѣсные и дровяные дворы. <br />
                        <b>4-Я АДМИРАЛТЕЙСКАЯ ЧАСТЬ. ПЛОЩАДИ.</b> 1. Калинкина.
                        2. Покровская. 3. Козье болото. УЛИЦЫ. 4. Англійскій
                        проспектъ. 5. Торговая. 6. Покровская. 7. Матисова. 8.
                        Грязная. 9. Прядильная. 10. Большая Садовая. 11.
                        ЕкатерингоФскій Проспектъ. 12. Офицерская. ЦЕРКВИ И
                        ЦЕРКОВНЫЯ ЗДАНІЯ. 16. Покрова Пресвятыя Богородицы. 14.
                        Домъ принадлежащій церкви Покрова Пресвятыя Богородицы.
                        15. Католическая церковь Св. Станислава. КАЗЕННЫЯ И
                        ОБЩЕСТВЕННЫЯ ЗДАНІЯ. 16. Главное управленіе Путей
                        Сообщенія 17. Фабрика Офицерскихъ вещей. 18. Домъ
                        Гражданскаго Губернатора. 19. Домъ принадлежащій
                        Морскому Корпусу 20. Домъ принадлежащій Аудиторіатскому
                        Департаменту. 21. Домы принадлежащіе Провіанскому
                        Департаменту. 22. Домъ принадлежащій Коммисаріатскому
                        Департаменту. 23. Домъ призрѣнія убогихъ. 24. Домъ
                        принадлежащій Обществу призрѣнія убогихъ. 25. Комитетъ
                        призрѣнія бѣдныхъ. 26. Училище Человѣколюбиваго
                        Общества. 27. Градская тюрьма. 28. Исправительное
                        Заведеніе. 29. Литовскій рынокъ. КАЗАРМЫ. 30. Морскія
                        казармы Гвардѣйскаго Экипажа. ГОШПИТАЛИ И БОГАДѢЛЬНИ.
                        31. Удѣльная Больница. МАГАЗЕЙНЫ И ДРОВЯНЫЕ ДВОРЫ. 32.
                        Дровяной запасный магазейнъ. 33. Сальный буянъ. 34.
                        Калинковскіе провіантскіе магазейны. 35. Казенный
                        дровяной дворъ. <br />
                        <b>
                          НАРВСКАЯ ЧАСТЬ. ПЛОЩАДИ. 1. Измайловская. УЛИЦЫ.
                        </b>{" "}
                        2. Петергофскій Проспектъ. 3. Ново-Измайловскій
                        Проспектъ. 4. Троицкій Проспектъ. 5. Царско-Сельскій
                        Проспектъ. 6. 1-я рота. 7. 2-я » 8. 3-я » 9.
                        Вознесенскій Проспектъ. 10. 4-я рота. 11.
                        ЕкатерингоФскій Проспектъ. 12. 5-я рота. 13. 6-я » 14.
                        7-я » 15. 8-я » 16. 9-я » 17. 10-я » 18. 11-я » 19. 12-я
                        » ДВОРЦЫ. 20. ЕкатерингоФскій. ЦЕРКВИ. 21. Св. Троицы.
                        22. Св. Великомученицы Екатерины. 23. Св. Митрофанія.
                        КАЗЕННЫЯ И ОБЩЕСТВЕННЫЯ ЗДАНІЯ. 24. Павловскій Кадетскій
                        Корпусъ. 25. Школа Гражданскихъ Инженеровъ. 26. Школа
                        Гвардейскихъ Подпрапорщиковъ. 21. Ассигнаціонный банкъ.
                        28. Павловскій Институтъ. 29. Домъ для пріема
                        родильницъ. 30. Пороховой погребъ. 31. Домъ продажнаго
                        пригоннаго скота. КАЗАРМЫ. 32. Л. Г. Измайловскаго
                        полка. 33. Морскія. ГОШПИТАЛИ И БОГАДѢЛЬНИ 34. Л. Г.
                        Измайловскаго полка. 35. Градская Калинковская больница.
                        36. Богадельня Воспитательнаго Дома. 37. Домъ
                        принадлежащій Калинковской боль-ницъ. МАГАЗЕЙНЫ И
                        ДРОВЯНЫЕ ДВОРЫ. 38. Измайловскіе провіантскіе магазейны.
                        39. Сельдяный Буянъ. 40. Дровяный дворъ морскихъ
                        казармъ. ЗАСТАВЫ. 41 Нарвская. КЛАДБИЩЕ. 42 Холерное.
                        <br />
                        <b>МОСКОВСКАЯ ЧАСТЬ. ПЛОЩАДИ.</b> 1. Семеновская. УЛИЦЫ.
                        2. Загородный Проспектъ 3. Литейный Проспектъ. 4.
                        Лиговскій Проспектъ. 5. Царско-Сельскій Проспектъ. 6.
                        Средній Проспектъ. 7. Невскій Проспектъ. 8.
                        Адмиралтейская или Гороховская. 9. Малый Проспектъ. 10.
                        Троицкая. 11. Стремянная. 12. Большая Офицерская. 13.
                        Разъѣзжая. 14. Кабинетская. 15. Грязная. 16. Боровая.
                        17. Гошпитальная. 18. 1-я линія. 19. 2-я » 20. 3-я » 21.
                        4-я » 22. 5-я » ПРИНАДЛЕЖНОСТИ КЪ ДВОРЦОВЫМЪ ЗДАНІЯМЪ.
                        23. Запасный дворъ собственнаго Е. И. В. Дворца. ЦЕРКВИ
                        И ЦЕРКОВНЫЯ ЗДАНІЯ. 24. Владимирскія Божія Матери. 25.
                        Единовѣрческая Св. Николая. 26. Старая деревянная
                        церковь Введенія во храмъ Пресвятыя Богородицы. 27.
                        Новая каменная церковь Введенія во храмъ Пресвятыя
                        Богородицы. 28. Троицкое подворье. 29. Подворье
                        Святѣйшаго Сѵнода 30. Часовня Ярославскаго подворья. 31.
                        Часовня Коневскаго монастыря. 32. Коммисія Духовныхъ
                        училищь. 33. Домъ принадлежащій Владимирской цер¬кви.
                        КАЗЕННЫЯ И ОБЩЕСТВЕННЫЯ ЗДАНІЯ. 34. Технологическій
                        Институтъ. 35. 1-я С. Петербургская Гимназія. 36.
                        Коммерческое училище. 37. Владимирское приходское
                        училище. 38. Палата Государственныхъ Имуществъ. 39. Домъ
                        принадлежащій Департаменту По¬датей и сборовъ. 40. Домъ
                        Донскаго Войска. 41. Домъ Цѣховаго Общества. 42.
                        Мѣщанское Собраніе. 43. Частный рынокъ. 44. Заведеніе
                        Павловской Желѣзной дороги. КАЗАРМЫ. 45. Л. Г.
                        Московскаго полка. 46. » » Семеновскаго полка. 47. » »
                        Егерьскаго полка. 48. Фуражный дворъ Л. Г. Семеновскаго
                        полка. 49. Сараи Л. Г. Фурштатскаго баталіона. 50.
                        Конюшни Л. Г. Фурштатскаго баталіона. ГОШПИТАЛИ. 51. Л.
                        Г. Семеновскаго полка. 52. Обуховская больница. ДРОВЯНЫЕ
                        ДВОРЫ. 53. Л. Г. Семеновскаго полка. ЗАСТАВЫ. 51.
                        Московская.
                        <br />
                        <b>КАРЕТНАЯ ЧАСТЬ. ПЛОЩАДИ.</b> 1. Александровскій
                        плацъ-парадъ. УЛИЦЫ. 2. Гончарная. 3. Воздвиженская. 4.
                        Лиговскій Проспектъ. 5. Царско-сельскій Проспектъ 6.
                        Моховая Каретная. 7. Невскій Проспектъ. 8. Песочная.
                        ЦЕРКВИ И ЦЕРКОВНЫЯ ЗДАНІЯ. 9 Соборъ Св. Троицы. 10. Домъ
                        Митрополита. 11. Духовная Академія. 12. Духовная
                        Семинарія. 13. Духовная Консисторія. 14. Церковь Іоанна
                        Крестителя 15. Церковь Возкресенія Христова. 16. Церковь
                        Спаса Нерукотвореннаго образа. 17. Церковь БлаговЪщенія
                        Пресвятыя Богородицы. 18. Домы принадлежащіе
                        Александро-Невской Лавръ. КАЗЕННЫЯ И ОБЩЕСТВЕННЫЯ
                        ЗДАНІЯ. 19. Казенный Стеклянный заводъ. 20. Вѣдомства
                        Императорскаго Человъколюб. Общ. домъпризрънія
                        малолътныхъ дътей. 21. Михайловская школа женскаго
                        патріотическаго Общества. 22. Приходское училище. 23.
                        Желъзные ряды. 24. Газометръ. КАЗАРМЫ. 25.
                        Лейбъ-Казаковъ. 26. Конюшни Лейбъ-Казаковъ. БОГАДЕЛЬНИ.
                        27. Волковская Богадѣльня для престарѣлыхъ гражданъ.
                        МАГАЗЕЙНЫ. 28. Рожковскіе сѣнные. ЗАСТАВЫ. 29.
                        Шлиссельбургская. КЛАДБИЩИ. 30. Волковское. 31.
                        Старообрядческое. 32. Нѣмецкое. 33. Александро-Невской
                        Лавры.
                        <br />
                        <b>РОЖДЕСТВЕНСКАЯ ЧАСТЬ. ПЛОЩАДИ.</b> 1. Преображенская.
                        2. Торговая. 3. Конная. УЛИЦЫ. 4. Невская набережная. 5.
                        Воскресенскій Проспектъ. 6. Офицерская. 7. Невскій
                        Проспектъ. 8. Мало-Охтенскій Проспектъ. 9. Дехтярная.
                        10. Средняя или Слоновая. 11. Садовая. 12. Кирошная. 13.
                        Таврическая. 14. Манежная. " 15. Большая болотная. 16.
                        Преображенская Гошпитальная. 17. Конно-Гвардейская.
                        ДВОРЦЫ. И ПРИНАДЛЕЖНОСТИ КЪ ОНЫМЪ. 18. Таврическій. 19.
                        Конюшенный Фуражный дворъ. ЦЕРКВИ И ЦЕРКОВНЫЯ ЗДАНІЯ.
                        20. Соборъ учебныхъ заведеній (Смольный монастырь.) 21.
                        Церковь Рождества Христова. 22. Домъ духовенства
                        Смольнаго монастыря. 23. Домъ церкви Рождества. 24. Домы
                        принадлежащіе Александро-Невской Лавры. КАЗЕННЫЯ И
                        ОБЩЕСТВЕННЫЯ ЗДАНІЯ. 25. Институтъ для воспитанія
                        благородныхъ дѣвицъ. 26. Институтъ для воспитанія
                        мѣщанскихъ дѣвицъ. 27. Маріинское Сиротское отдѣленіе.
                        28. Благородный вдовій домъ. 29. Маріинскій институтъ.
                        30. Фейерверкерская школа Гвардейскаго корпуса. 31.
                        Канцелярія С. Петербургскаго Внутренняго Гарнизоннаго
                        Баталіона. 32. Рожественское приходское училище. 33.
                        Александровской рынокъ. 34. Кожевенный рядъ. 35. Мытный
                        дворъ. КАЗАРМЫ. 36. Бывшаго учебнаго Карабинернаго
                        полка. 37. Ветеринарной Артиллерійской школы. 38.
                        Фуражный дворъ Л. Г. Преображенскаго полка. ГОШПИТАЛИ И
                        БОГАДѢЛЬНИ. 39. С. Петербургская Военная Гошпиталь. 40.
                        С. Петербургская Градсская Богадѣльня. <br />
                        <b>ЛИТЕЙНАЯ ЧАСТЬ. ПЛОЩАДИ.</b> 1. Артиллерійская.
                        УЛИЦЫ. 2. Воскресенская. 3. Литейный Проспектъ. 4.
                        Захарьевская. 5. Воскресенскій Проспектъ. 6.
                        Сергіевская. 7. Невскій Проспектъ. 8. Фурштатская. 9.
                        Пантелеймонская. 10. Моховая. 11. Знаменская. 12.
                        Кирошная. 13. Таврическая. 14. Гошпитальная. 15.
                        Семеновская. 16. Преображенская Гошпитальная. 17.
                        Бассейная. 18. Италіянская. 19. Средній Проспектъ.
                        ПРИНАДЛЕЖНОСТИ КЪ ДВОРЦОВЫМЪ ЗДАНІЯМЪ. 20.
                        ГоФЪ-Интендантская контора. 21. ГоФъ-Интендантскіе
                        магазейны. 22. Заведеніе придворнаго Экипажа. 23.
                        Шпалерная мануфактура. 24. Боурской домъ. 25. Придворная
                        прачешная. 26. Домъ придворныхъ служителей. ЦЕРКВИ И
                        ЦЕРКОВНЫЯ ЗДАНІЯ 27. Соборъ Спаса Преображенія Господня.
                        28. Церковь Св. Пантелеймона. 29. Церковь Св. Снміона и
                        Анны. 30. Церк. Знаменія Пресвятыя Богородицы. 31.
                        Церковь Всѣхъ Скорбящихъ Богородицы. 32. Церковь Козьмы
                        и Демьяна. 33. Церк.Св.СергіяРадонежскагочудотворца. 34.
                        Лютеранская Церковь Св. Анны. 35. Домъ Преображенскаго
                        Собора. КАЗЕННЫЯ И ОБЩЕСТВЕННЫЯ ЗДАНІЯ. 36. Арсенальный
                        дѣловой дворъ. 37. Литейный .дворъ. 38. Старый Арсеналъ.
                        39. Новый Арсеналъ. 40. Артиллерійская Техническая
                        школа. 41. Артиллерійскій Департаментъ. 42. Домъ
                        Артиллерійскаго Вѣдомства. 43. Капитулъ Россійскихъ
                        Орденовъ. 44. Главный Штабъ Военныхъ Поселеній. 45.
                        Архивъ Департамента Военныхъ Поселеній. 46. Домъ
                        Вѣдомства ИМПЕРАТОРСКАГО Человѣколюбиваго Общества. 47.
                        Штабъ Корпуса Жандармовъ. 48. Домъ Главноуправляющаго
                        надъ Почто¬вымъ Департаментомъ. 49. Коммиссія
                        Составленія Законовъ. 50. Училище Правовѣденія. 51.
                        Екатерининскій Институтъ. 52. 3-я С. Петербургская
                        Гимназія. 53. Домъ Артиллерійскаго Департамента. 54.
                        Пустой рынокъ. КАЗАРМЫ. 55. Л. Г. Преображенскаго Полка.
                        56. » » Сапернаго Баталіона. 57. » » Кавалергадскаго
                        Полка. 58. С. Петербургскаго Жандармскаго Диви¬зіона.
                        59. Л. Г. 1-й Артиллерійской Бригады. 60. Домъ 1-й
                        Артиллерійской Бригады. 61. Артиллерійскія конюшни. 62.
                        Строеніе бывшаго Артиллерійскаго Гошпиталя (занимаемое
                        мастеровыми Арсенальнаго Вѣдомства.) ГОШПИТАЛИ И
                        БОГАДЕЛЬНИ. 63. Гошпиталь Л. Г. Преображенскаго Полка.
                        64. Маріинская больница для бѣдныхъ. 65. Глазная
                        лѣчебница. МАГАЗЕЙНЫ. 66. Воскресенскіе провіантскіе
                        магазейны. 67. Соляной Городокъ. 67. Придворный запасный
                        дровяной дворъ.
                        <br />
                        <b>ВАСИЛЬЕВСКАЯ ЧАСТЬ. ПЛОЩАДИ.</b> 1. Румянцева. 2.
                        Смоленское поле. УЛИЦЫ. 3. Большой Проспектъ. 4. Средній
                        Проспектъ. 5. Малый Проспектъ. 6. Кадетская и 1-я линія.
                        7. 2-я и 3-я линія. 8. 4-я и 5-я » 9. 6-я и 7-я » 10.
                        8-я и 9-я » 11. 10-я и 11-я » 12. 12-я и 13-я ЛИНІЯ. 13.
                        14-я и 15-я » 14. 16-я и 17-я » 15. 18-я и 19-я » 16.
                        20-я и 21-я » 17. 22-я и 23-я » 18. 24-Я ЛИНІЯ. 19. 25-я
                        » 20. Косая. 21. Кожевенная. МОНУМЕНТЫ. 22. Румянцева
                        побѣдамъ. ЦЕРКВИ И ЦЕРКОВНЫЯ ЗДАНІЯ. 23. Соборъ Св.
                        Андрея Первозваннаго. 24. Церковь Трехъ Святителей. 25.
                        ЦерковьСв. Великомученицы Екатерины. 26. Церк.
                        Благовѣщенія Пресв. Богородицы. 27. Церковь Смоленскія
                        Богородицы. 28. ЦерковьСв. Архистратига Михаила. 29.
                        Церк. Св. Троицы (въ Галерной Гавани). 30. Псковское
                        Подворье. 31. Ярославское Подворье. 32. Домъ церкви
                        Благовѣщенія. 33. Домъ Александро-Невской Лавры. 34.
                        Лютеранская церковь Св. Екатерины. 35. Армянская Церк.
                        Воскресенія Христова. КАЗЕННЫЯ И ОБЩЕСТВЕННЫЯ ЗДАНІЯ.
                        36. Биржа. 37. С. Петербургская Таможня. 38. С.
                        Петербургскій Университетъ. 39. Педагогическій
                        Институтъ. 40. Кунстъ-Камера. 41. Академія Наукъ. 42.
                        1-й Кадетскій Корпусъ. 43. Академія Художествъ. 44.
                        Ларинская Гимназія. 45. Приходское Андреевское училище.
                        46. Институтъ Дѣвицъ Патріотическаго Общества. 47. Домъ
                        Трудолюбія. 48. Морской Кадетскій Корпусъ. 49. Главная
                        Морская Аптека. 50. Горный Корпусъ. 51. Россійская
                        Академія. 52. Домъ воспитанія бѣдныхъ дѣвицъ. 53.
                        Благовѣщенское приходское училище. 54. Старый гостиный
                        дворъ. 55. Новый гостиный дворъ. 56. Андреевской рынокъ.
                        57. Домъ 1-го Кадетскаго Корпуса. 58. Домъ Академіи
                        Наукъ. 59. Домъ Казенной Палаты. 60. Домъ Призрѣнія
                        Бѣдныхъ. 61. Домъ Морскаго Кадетскаго Корпуса. 62. Домъ
                        Департамента Внѣшней Торговли. 63. Портовая Контора. 64.
                        Брантспойтовая въ Галерной гавани. 65. ІелеграФъ. 66.
                        Кроншпицъ. КАЗАРМЫ. 67. Л. Г. Финляндскаго Полка. 68.
                        Морскихъ служителей. ГОШПИТАЛЯ И БОГАДѢЛЬНИ. 69.
                        Гошпиталь Л. Г. Финляндскаго Полка. 70. Морской
                        лазаретъ. 71. Больница Св. Маріи Магдалины. 71.
                        Богадѣльня. МАГАЗЕЙНЫ. 73. Винный Городокъ. 74.
                        Масленый.Буянъ. ЗАСТАВЫ. 75. Костыльская. КЛАДВИЩИ. 76.
                        Смоленское. 77. Холерное. 78. Нѣмецкое. 79. Армянское.
                        <br />
                        <b>ПЕТЕРБУРГСКАЯ ЧАСТЬ. ПЛОЩАДИ.</b> 1. Эспланада.
                        УЛИЦЫ. 2. Каменно-Островскій Проспектъ. 3. Большой
                        Проспектъ. 4. Аптекарскій Проспектъ. 5. Малый Проспектъ.
                        6. Большая Дворянская. 7. Большая Монетная. 8.
                        Набережная Невки. 9. Большая Пушкарская. 10. Гулярная.
                        11. Большая Никольская. 12. Средняя Колтовская. 13.
                        Спасская. 14. Андрея Петрова. 15. Широкая. 16. Большая
                        Зеленина ДВОРЦЫ. 17. Домикъ ПЕТРА I. 18. Елагинскій. 19.
                        Петровскій. 20. Каменно-Островскій. ЦЕРКВИ И ЦЕРКОВНЫЯ
                        ЗДАНІЯ 21. Соборъ Св. Петра и Павла. 22. Соборъ Св.
                        Троицы. 23. Церковь Воздвиженія креста Господня. 24.
                        Церковь Покрова Пресвят. Богородицы. 25. Церковь
                        Введенія во храмъ Пресвят. Богородицы. 26. Соборъ
                        Равноапостольнаго Князя Владимира. 27. Церковь Спаса
                        Преображенія Господня. 28. Церковь Св. Іоанна
                        Крестителя. 29. Домъ Петропавловскаго Собора. 30. Домъ
                        Троицкаго Собора. 31. Домъ Воздвиженской Церкви. 32.
                        Строеніе Католической Церки. КАЗЕННЫЯ И ОБЩЕСТВЕННЫЯ
                        ЗДАНІЯ 33. Главное Казначейство. 34. Монетный Дворъ. 35.
                        Домъ Коменданта крѣпости. 36. Инженерный домъ. 37-
                        Артиллерійскій цейхгаузъ. 38. 2-й Кадетскій Корпусъ. 39.
                        Экзерцисъ-Гаузъ. 40. Дворянскій Полкъ. 41. Приходское
                        Веденское училище. 42. Домъ Артиллерійскаго Гарнизона.
                        43. Александрынскій Сиротскій домъ. 44. Домъ
                        Императорскаго ботаническаго Сада. 45. Оранжереи и
                        Ботаническій садъ. 46. Главный Магазейнъ Аптекарскихъ
                        матеріаловъ. 47. Строеніе для служителей 2-го Кадетскаго
                        корпуса. 48. Лѣтній театръ. 49. Сытный Рынокъ. 50. Домъ
                        Монетнаго Двора. 51. Домъ Инженернаго вѣдомства.
                        КАЗАРМЫ. 52. Петровскія. 53. Морскихъ Инвалидовъ.
                        ГОШПИТАЛИ. 54. Дворянскаго Полка. 55. Петропавловская
                        Больница. МАГАЗЕЙНЫ и ДРОВЯНЫЯ ДВОРЫ. 56. Мытненскіе
                        провіантскіе. 57. Запасные провіантскіе. 58. Пеньковый
                        Буянъ. 59. Гагаринской пеньковый Буянъ. 60. Дровяной
                        дворъ 2-го Кадетскаго корпу са. КЛАДБИЩИ. 61. Временное.
                        <br />
                        <b>ВЫБОРГСКАЯ ЧАСТЬ. УЛИЦЫ.</b> 1. Большой Самсоньевскій
                        Проспектъ. 2. Воскресенская. 3. Морская. 4. Бочарная.
                        ЦЕРКВИ И ЦЕРКОВНЫЯ ЗДАНІЯ. 5. Церковь Св. Самсонія
                        Страннопріимца. 6. Церковь Происхожденія чесныхъ древъ
                        Всемилостиваго Спаса. 7. Церковь Св. Владимира. 8. Домъ
                        церкви Самсонія. КАЗЕННЫЯ И ОБЩЕСТВЕННЫЯ ЗДАНІЯ. 9.
                        Артиллерійское Училище. 10. Медико-Хирургическая
                        Академія. 11. Ветеренарное Училище. 12. Самсоньевское
                        приходское Училище. 13. Артиллерійская Лабороторія. 14.
                        Заведеніе Искуственныхъ Минераль¬ныхъ водъ. 15. Лѣсной
                        Институтъ. КАЗАРМЫ. 16. Л. Г. Литовскаго Полка.
                        ГОШПИТАЛИ. 17. Военно-Сухопутная. 18. Морская. МАГАЗЕЙНЫ
                        И ДРОВЯНЫЕ ДВОРЫ. 19. Гошпитальный провіантскій
                        магазейнъ. 20. « « дровяной дворъ. 21. Дровяной дворъ Л.
                        Г. Литовскаго Полка. 22. Артиллерійскія ЛѢСНЫЯ
                        Магазейны. 23. Винный Городокъ. ЗАСТАВЫ. 24. Выборгская.
                        КЛАДБИЩЕ. 25. Самсоньевское. ‘ <br />
                        <b>ОХТЕНСКАЯ ЧАСТЬ. УЛИЦЫ.</b>
                        1. Большой Охтенскій Проспектъ. 2. Малый Охтенскій
                        Проспектъ. ЦЕРКВИ. 3. Церковь Св. Троицы. 4. Церковь Св.
                        Георгія. 5. Церковь Св. Маріи Магдалины. КАЗЕННЫЯ
                        ЗДАНІЯ. 6. Корабельная верфь. КЛАДВИЩИ. 7. Большое
                        Охтенское. 8 Малое Охтенское. 9. Старообрядческое.
                      </p>
                    </div>
                  </div>
                )}
              </Modal>
            )}
          </div>
          <div className={styles.historyPetr}>
            <img
              onClick={() =>
                handleItemClick(
                  [
                    {
                      name: "",
                      image: "/src/assets/img/УказПетра1.png",
                    },
                  ],
                  450,
                  -100
                )
              }
              className={styles.imgDecree}
              height={150}
              width={180}
              src="/src/assets/img/УказПетра1.png"
              alt="decree"
            />
            <img
              onClick={() =>
                handleItemClick(
                  [
                    {
                      name: "",
                      image: "/src/assets/img/Брюс.png",
                    },
                  ],
                  300,
                  -100
                )
              }
              height={150}
              width={126}
              className={styles.imgBruce}
              src="/src/assets/img/Брюс.png"
              alt="Bruce"
            />
            <img
              onClick={() =>
                handleItemClick(
                  [
                    {
                      name: "",
                      image: "/src/assets/img/Пушечно-линейныйДвор.png",
                    },
                  ],
                  800,
                  -100
                )
              }
              className={styles.imgGun}
              src="/src/assets/img/Пушечно-линейныйДвор.png"
              alt="Пушечно-линейный двор"
            />
            <img
              onClick={() =>
                handleItemClick(
                  [
                    {
                      name: "",
                      image: "/src/assets/img/СухареваБашня.png",
                    },
                  ],
                  800,
                  -100
                )
              }
              className={styles.imgTown}
              height={400}
              width={395}
              src="/src/assets/img/СухареваБашня.png"
              alt="Сухарева Башня на карте"
            />
            <img
              onClick={() =>
                handleItemClick(
                  [
                    {
                      name: "",
                      image: "/src/assets/img/УказОбУчреждении.png",
                    },
                  ],
                  400,
                  -250
                )
              }
              className={styles.imgIng}
              src="/src/assets/img/УказОбУчреждении.png"
              alt="Указ об учреждении инженерной роты"
            />
            <img
              onClick={() =>
                handleItemClick(
                  [
                    {
                      name: "",
                      image: "/src/assets/img/Миних.png",
                    },
                  ],
                  400,
                  -150
                )
              }
              className={styles.imgMinih}
              src="/src/assets/img/Миних.png"
              alt="Миних"
            />
            <img
              onClick={() =>
                handleItemClick(
                  [
                    {
                      name: "",
                      image: "/src/assets/img/свейский.png",
                    },
                  ],
                  400,
                  -150
                )
              }
              className={styles.imgSveyskiy}
              src="/src/assets/img/свейский.png"
              alt="Свейский"
            />
          </div>
        </div>
        <div className={styles.imp2}>
          <div className={styles.description}>
            <img
              onClick={() =>
                handleItemClick(
                  [
                    {
                      name: "",
                      image: "/src/assets/img/Сенатский Указ.png",
                    },
                  ],
                  700,
                  50
                )
              }
              className={styles.descImage}
              src="/src/assets/img/Сенатский Указ.png"
              alt="Description about Ekaterina I"
            />
          </div>
          <div className={styles.historyEkaterinaI}>
            <img
              onClick={() => {
                handleItemClick(
                  [
                    {
                      id: 1,
                      image: "/src/assets/img/SPb_1756.jpg",
                    },

                    {
                      id: 2,
                      image: "/src/assets/img/SPb_1777.jpg",
                    },
                    {
                      id: 3,
                      image: "/src/assets/img/SPb_1840.jpg",
                    },

                    {
                      id: 4,
                      image: "/src/assets/img/spb_1868.jpg",
                    },
                    {
                      id: 5,
                      image: "/src/assets/img/Карта.png",
                    },
                  ],
                  900,
                  1000,
                  1500,
                  "ЧАСТИ ГОРОДА.I. Первая Адмиралтейская.II. Вторая Адмиралтейская.III. Третья Адмиралтейская.IV. Четвертая Адмиралтейская.V. Нарвская.VI МосковскаяVII. Каретная.VIII. Рожественская.IX. Литейная.X. Васильевская.XI. Петербургская.XII. Выборгская.XIII. Охтенская."
                );
              }}
              className={styles.imgMap}
              src="/src/assets/img/Карта.png"
              alt="Карта"
            />

            <img
              onClick={() =>
                handleItemClick(
                  [
                    {
                      name: "",
                      image: "/src/assets/img/Текст.png",
                    },
                  ],
                  500,
                  100
                )
              }
              className={styles.imgText}
              src="/src/assets/img/Текст.png"
              alt="Text about Ekaterina I"
            />
            <div className={styles.blockLomonosov}>
              <img
                onClick={() =>
                  handleItemClick(
                    [
                      {
                        name: "",
                        image: "/src/assets/img/Ломоносов.png",
                      },
                    ],
                    500,
                    400
                  )
                }
                className={styles.imgLomonosov}
                src="/src/assets/img/Ломоносов.png"
                alt="Lomonosov"
              />
              <img
                onClick={() =>
                  handleItemClick(
                    [
                      {
                        name: "",
                        image: "/src/assets/img/LomonosovText.png",
                      },
                    ],
                    500,
                    500
                  )
                }
                className={styles.imgTextLomonosov}
                src="/src/assets/img/LomonosovText.png"
                alt="Text"
              />
            </div>
            <img
              onClick={() =>
                handleItemClick(
                  [
                    {
                      name: "",
                      image: "/src/assets/img/описаниекарты.png",
                    },
                  ],
                  880,
                  650
                )
              }
              className={styles.imgDescMap}
              src="/src/assets/img/описаниекарты.png"
              alt="Desc for map"
            />
          </div>
        </div>
        <div className={styles.imp3}>
          <div className={styles.description}>
            <img
              onClick={() =>
                handleItemClick(
                  [
                    {
                      name: "",
                      image: "/src/assets/img/ШуваловОПис.png",
                    },
                  ],
                  500,
                  600
                )
              }
              className={styles.descImage}
              src="/src/assets/img/ШуваловОПис.png"
              alt="desc"
            />
          </div>
          <div className={styles.historyElizabeth}>
            <img
              onClick={() =>
                handleItemClick(
                  [
                    {
                      name: "",
                      image: "/src/assets/img/мордвинов.png",
                    },
                  ],
                  300,
                  950
                )
              }
              className={styles.imgMordvinov}
              src="/src/assets/img/мордвинов.png"
              alt="Mordvinov"
            />
            <img
              onClick={() =>
                handleItemClick(
                  [
                    {
                      name: "",
                      image: "/src/assets/img/Кутузов.png",
                    },
                  ],
                  450,
                  950
                )
              }
              className={styles.imgKutuzov}
              src="/src/assets/img/Кутузов.png"
              alt="Kutuzov"
            />

            <img
              onClick={() =>
                handleItemClick(
                  [
                    {
                      name: "",
                      image: "/src/assets/img/МихаилИлларионович.png",
                    },
                  ],
                  500,
                  1200
                )
              }
              className={styles.imgMichaelDesc}
              src="/src/assets/img/МихаилИлларионович.png"
              alt="Desc Michael"
            />
            <img
              onClick={() =>
                handleItemClick(
                  [
                    {
                      name: "",
                      image: "/src/assets/img/Шувалов.png",
                    },
                  ],
                  450,
                  1200
                )
              }
              className={styles.imgShuvalovDesc}
              src="/src/assets/img/Шувалов.png"
              alt="Desc Shuvalov"
            />
            <img
              onClick={() =>
                handleItemClick(
                  [
                    {
                      name: "",
                      image: "/src/assets/img/Вильбоа.png",
                    },
                  ],
                  400,
                  1450
                )
              }
              className={styles.imgVilboa}
              src="/src/assets/img/Вильбоа.png"
              alt="Vilboa"
            />
            <img
              onClick={() =>
                handleItemClick(
                  [
                    {
                      name: "",
                      image: "/src/assets/img/ФормаОдежды.png",
                    },
                  ],
                  450,
                  1500
                )
              }
              className={styles.imgSmoking}
              src="/src/assets/img/ФормаОдежды.png"
              alt="Smoking"
            />
          </div>
        </div>
        <div className={styles.imp4}>
          <div className={styles.description}>
            <img
              onClick={() =>
                handleItemClick(
                  [
                    {
                      name: "",
                      image: "/src/assets/img/Orlov.png",
                    },
                  ],
                  400,
                  1500
                )
              }
              className={styles.descImage1}
              src="/src/assets/img/Orlov.png"
              alt="Description Orlov"
            />
            <img
              onClick={() =>
                handleItemClick(
                  [
                    {
                      name: "",
                      image: "/src/assets/img/Potemkin.png",
                    },
                  ],
                  400,
                  2500
                )
              }
              className={styles.descImage2}
              src="/src/assets/img/Potemkin.png"
              alt="Description Orlov"
            />
            <img
              onClick={() =>
                handleItemClick(
                  [
                    {
                      name: "",
                      image: "/src/assets/img/Zubov.png",
                    },
                  ],
                  400,
                  2700
                )
              }
              className={styles.descImage3}
              src="/src/assets/img/Zubov.png"
              alt="Description Orlov"
            />
          </div>
          <div className={styles.historyEkaterinaII}>
            <img
              onClick={() =>
                handleItemClick(
                  [
                    {
                      name: "",
                      image: "/src/assets/img/Melissino.png",
                    },
                  ],
                  400,
                  1700
                )
              }
              className={styles.imgMelissino}
              src="/src/assets/img/Melissino.png"
              alt="Melissino"
            />
            <img
              onClick={() =>
                handleItemClick(
                  [
                    {
                      name: "",
                      image: "/src/assets/img/MelissinoDesc.png",
                    },
                  ],
                  400,
                  2000
                )
              }
              className={styles.imgDescMelissino}
              src="/src/assets/img/MelissinoDesc.png"
              alt="Desc Melissino"
            />
            <img
              onClick={() =>
                handleItemClick(
                  [
                    {
                      name: "",
                      image: "/src/assets/img/Arakcheev.png",
                    },
                  ],
                  400,
                  2200
                )
              }
              className={styles.imgArakcheev}
              src="/src/assets/img/Arakcheev.png"
              alt="Arakcheev"
            />
            <img
              onClick={() =>
                handleItemClick(
                  [
                    {
                      name: "",
                      image: "/src/assets/img/ArakcheevDesc.png",
                    },
                  ],
                  400,
                  2400
                )
              }
              className={styles.imgDescArakcheev}
              src="/src/assets/img/ArakcheevDesc.png"
              alt="Desc Arakcheev"
            />
            <img
              onClick={() =>
                handleItemClick(
                  [
                    {
                      name: "",
                      image: "/src/assets/img/SmokingPavelI.png",
                    },
                  ],
                  500,
                  2650
                )
              }
              className={styles.imgSmoking}
              src="/src/assets/img/SmokingPavelI.png"
              alt="Smoking PavelI"
            />
            <img
              onClick={() =>
                handleItemClick(
                  [
                    {
                      name: "",
                      image: "/src/assets/img/Cadets.png",
                    },
                  ],
                  400,
                  1650
                )
              }
              className={styles.imgCadets}
              src="/src/assets/img/Cadets.png"
              alt="Cadets"
            />
            <img
              onClick={() =>
                handleItemClick(
                  [
                    {
                      name: "",
                      image: "/src/assets/img/Greece.png",
                    },
                  ],
                  600,
                  2000
                )
              }
              className={styles.imgGreece}
              src="/src/assets/img/Greece.png"
              alt="Greece"
            />
            <img
              onClick={() =>
                handleItemClick(
                  [
                    {
                      name: "",
                      image: "/src/assets/img/Znamya.png",
                    },
                  ],
                  400,
                  2250
                )
              }
              className={styles.imgZnamya}
              src="/src/assets/img/Znamya.png"
              alt="Znamya"
            />
            <img
              onClick={() =>
                handleItemClick(
                  [
                    {
                      name: "",
                      image: "/src/assets/img/Схема1.png",
                    },
                  ],
                  800,
                  2600
                )
              }
              className={styles.imgPlan}
              src="/src/assets/img/Схема1.png"
              alt="General Plan"
            />
          </div>
        </div>
        <div className={styles.imp5}>
          <div className={styles.historyPavelI}>
            <img
              onClick={() =>
                handleItemClick(
                  [
                    {
                      name: "",
                      image: "/src/assets/img/plantown.png",
                    },
                  ],
                  700,
                  2950
                )
              }
              className={styles.imgPlanTown}
              src="/src/assets/img/plantown.png"
              alt="Plan Town"
            />
            <img
              onClick={() =>
                handleItemClick(
                  [
                    {
                      name: "",
                      image: "/src/assets/img/EkaterinaDesc.png",
                    },
                  ],
                  400,
                  3000
                )
              }
              className={styles.imgEkaterinaDesc}
              src="/src/assets/img/EkaterinaDesc.png"
              alt="Description Ekaterina"
            />
          </div>
        </div>
        <div className={styles.imp6}>
          <div className={styles.description}>
            <img
              onClick={() =>
                handleItemClick(
                  [
                    {
                      name: "",
                      image: "/src/assets/img/Konovnicin.png",
                    },
                  ],
                  400,
                  3300
                )
              }
              className={styles.imgDesc1}
              src="/src/assets/img/Konovnicin.png"
              alt="Konovnicin"
            />
            <img
              onClick={() =>
                handleItemClick(
                  [
                    {
                      name: "",
                      image: "/src/assets/img/Golenischev.png",
                    },
                  ],
                  400,
                  4000
                )
              }
              className={styles.imgDesc2}
              src="/src/assets/img/Golenischev.png"
              alt="Golenischev"
            />
          </div>
          <div className={styles.historyAlexanderI}>
            <img
              onClick={() =>
                handleItemClick(
                  [
                    {
                      name: "",
                      image: "/src/assets/img/Zubov.png",
                    },
                  ],
                  400,
                  3300
                )
              }
              className={styles.imgZubov}
              src="/src/assets/img/Zubov.png"
              alt="Zubov"
            />
            <img
              onClick={() =>
                handleItemClick(
                  [
                    {
                      name: "",
                      image: "/src/assets/img/KorpusPavel.png",
                    },
                  ],
                  400,
                  3500
                )
              }
              className={styles.imgKorpus}
              src="/src/assets/img/KorpusPavel.png"
              alt="KorpusPavel"
            />
            <img
              onClick={() =>
                handleItemClick(
                  [
                    {
                      name: "",
                      image: "/src/assets/img/VolontKorpus.png",
                    },
                  ],
                  400,
                  3700
                )
              }
              className={styles.imgVolont}
              src="/src/assets/img/VolontKorpus.png"
              alt="VolontKorpus"
            />
            <img
              onClick={() =>
                handleItemClick(
                  [
                    {
                      name: "",
                      image: "/src/assets/img/Excercirgaus.png",
                    },
                  ],
                  400,
                  3900
                )
              }
              className={styles.imgExcercirgaus}
              src="/src/assets/img/Excercirgaus.png"
              alt="Excercirgaus"
            />
            <img
              onClick={() =>
                handleItemClick(
                  [
                    {
                      name: "",
                      image: "/src/assets/img/ProjectStone.png",
                    },
                  ],
                  800,
                  3400
                )
              }
              className={styles.imgProjectStone}
              src="/src/assets/img/ProjectStone.png"
              alt="ProjectStone"
            />
            <img
              onClick={() =>
                handleItemClick(
                  [
                    {
                      name: "",
                      image: "/src/assets/img/ProjectEkatII.png",
                    },
                  ],
                  400,
                  3700
                )
              }
              className={styles.imgProjectEkaterinaII}
              src="/src/assets/img/ProjectEkatII.png"
              alt="ProjectEkaterinaII"
            />
            <img
              onClick={() =>
                handleItemClick(
                  [
                    {
                      name: "",
                      image: "/src/assets/img/SmokingAlexI.png",
                    },
                  ],
                  400,
                  3900
                )
              }
              className={styles.imgSmokingAlexI}
              src="/src/assets/img/SmokingAlexI.png"
              alt="SmokingAlexI"
            />
          </div>
        </div>
        <div className={styles.imp7}>
          <div className={styles.description}>
            <img
              onClick={() =>
                handleItemClick(
                  [
                    {
                      name: "",
                      image: "/src/assets/img/Znamya1862.png",
                    },
                  ],
                  400,
                  5000
                )
              }
              className={styles.descImage}
              src="/src/assets/img/Znamya1862.png"
              alt="Знамя 1862 года"
            />
          </div>
          <div className={styles.historyNikolayI}>
            <img
              onClick={() =>
                handleItemClick(
                  [
                    {
                      name: "",
                      image: "/src/assets/img/SmokingNikolayI.png",
                    },
                  ],
                  400,
                  4100
                )
              }
              className={styles.imgSmokingNikolayI}
              src="/src/assets/img/SmokingNikolayI.png"
              alt="Форма одежды при Николае I"
            />
            <img
              onClick={() =>
                handleItemClick(
                  [
                    {
                      name: "",
                      image: "/src/assets/img/Desc2Cadet.png",
                    },
                  ],
                  400,
                  4300
                )
              }
              className={styles.imgCadetKorpus}
              src="/src/assets/img/Desc2Cadet.png"
              alt="Description 2 Cadet "
            />
            <img
              onClick={() =>
                handleItemClick(
                  [
                    {
                      name: "",
                      image: "/src/assets/img/Mendeleev.png",
                    },
                  ],
                  400,
                  4600
                )
              }
              className={styles.imgMendeleev}
              src="/src/assets/img/Mendeleev.png"
              alt="Mendeleev"
            />
            <img
              onClick={() =>
                handleItemClick(
                  [
                    {
                      name: "",
                      image: "/src/assets/img/Dobrolyubov.png",
                    },
                  ],
                  400,
                  4800
                )
              }
              className={styles.imgDobrolyubov}
              src="/src/assets/img/Dobrolyubov.png"
              alt="Dobrolyubov"
            />
            <img
              onClick={() =>
                handleItemClick(
                  [
                    {
                      name: "",
                      image: "/src/assets/img/Chernishevskiy.png",
                    },
                  ],
                  400,
                  5000
                )
              }
              className={styles.imgChernishevskiy}
              src="/src/assets/img/Chernishevskiy.png"
              alt="Chernishevskiy"
            />
            <img
              onClick={() =>
                handleItemClick(
                  [
                    {
                      name: "",
                      image: "/src/assets/img/Схемa2.png",
                    },
                  ],
                  800,
                  4300
                )
              }
              className={styles.imgGeneralPlan2}
              src="/src/assets/img/Схемa2.png"
              alt="GeneralPlan2"
            />
            <img
              onClick={() =>
                handleItemClick(
                  [
                    {
                      name: "",
                      image: "/src/assets/img/Znamya1844.png",
                    },
                  ],
                  400,
                  4500
                )
              }
              className={styles.imgZnamya1844}
              src="/src/assets/img/Znamya1844.png"
              alt="Znamya1844"
            />
            <img
              onClick={() =>
                handleItemClick(
                  [
                    {
                      name: "",
                      image: "/src/assets/img/GeneralPlan1858.png",
                    },
                  ],
                  800,
                  4900
                )
              }
              className={styles.imgGeneralPlan1858}
              src="/src/assets/img/GeneralPlan1858.png"
              alt="GeneralPlan1858"
            />
          </div>
        </div>
        <div className={styles.imp8}>
          <div className={styles.historyAlexanderII}>
            <img
              onClick={() =>
                handleItemClick(
                  [
                    {
                      name: "",
                      image: "/src/assets/img/Attestat.png",
                    },
                  ],
                  400,
                  5600
                )
              }
              className={styles.imgAttestat}
              src="/src/assets/img/Attestat.png"
              alt="Attestat"
            />
            <img
              onClick={() =>
                handleItemClick(
                  [
                    {
                      name: "",
                      image: "/src/assets/img/SmokingAlexanderII.png",
                    },
                  ],
                  400,
                  5500
                )
              }
              className={styles.imgSmokingAlexII}
              src="/src/assets/img/SmokingAlexanderII.png"
              alt="SmokingAlexanderII"
            />
            <img
              onClick={() =>
                handleItemClick(
                  [
                    {
                      name: "",
                      image: "/src/assets/img/Desc2.png",
                    },
                  ],
                  400,
                  5800
                )
              }
              className={styles.img1863}
              src="/src/assets/img/Desc2.png"
              alt="Decs1863"
            />
            <img
              onClick={() =>
                handleItemClick(
                  [
                    {
                      name: "",
                      image: "/src/assets/img/Cadets1887.png",
                    },
                  ],
                  400,
                  5900
                )
              }
              className={styles.imgCadets1887}
              src="/src/assets/img/Cadets1887.png"
              alt="Cadets1887"
            />
            <img
              onClick={() =>
                handleItemClick(
                  [
                    {
                      name: "",
                      image: "/src/assets/img/DesctoPlan.png",
                    },
                  ],
                  400,
                  5300
                )
              }
              className={styles.imgDesctoPlan}
              src="/src/assets/img/DesctoPlan.png"
              alt="DesctoPlan"
            />
            <img
              onClick={() =>
                handleItemClick(
                  [
                    {
                      name: "",
                      image: "/src/assets/img/ChurchNevskiy.png",
                    },
                  ],
                  800,
                  5500
                )
              }
              className={styles.imgChurchNevskiy}
              src="/src/assets/img/ChurchNevskiy.png"
              alt="ChurchNevskiy"
            />
            <img
              onClick={() =>
                handleItemClick(
                  [
                    {
                      name: "",
                      image: "/src/assets/img/Soyuzov.png",
                    },
                  ],
                  400,
                  5900
                )
              }
              className={styles.imgSoyuzov}
              src="/src/assets/img/Soyuzov.png"
              alt="Soyuzov"
            />
          </div>
        </div>
        <div className={styles.imp9}>
          <div className={styles.historyAlexanderIII}>
            <img
              onClick={() =>
                handleItemClick(
                  [
                    {
                      name: "",
                      image: "/src/assets/img/Mordovin.png",
                    },
                  ],
                  800,
                  6000
                )
              }
              className={styles.imgMordovin}
              src="/src/assets/img/Mordovin.png"
              alt="Mordovin"
            />
            <img
              onClick={() =>
                handleItemClick(
                  [
                    {
                      name: "",
                      image: "/src/assets/img/AltarNevskiy.png",
                    },
                  ],
                  800,
                  6000
                )
              }
              className={styles.imgAltarNevskiy}
              src="/src/assets/img/AltarNevskiy.png"
              alt="AltarNevskiy"
            />
          </div>
        </div>
        <div className={styles.imp10}>
          <div className={styles.historyNikolayII}>
            <img
              onClick={() =>
                handleItemClick(
                  [
                    {
                      name: "",
                      image: "/src/assets/img/Moleben.png",
                    },
                  ],
                  600,
                  6200
                )
              }
              className={styles.imgMoleben}
              src="/src/assets/img/Moleben.png"
              alt="Moleben"
            />
            <img
              onClick={() =>
                handleItemClick(
                  [
                    {
                      name: "",
                      image: "/src/assets/img/NikolayII.png",
                    },
                  ],
                  600,
                  6200
                )
              }
              className={styles.imgNikolayII}
              src="/src/assets/img/NikolayII.png"
              alt="NikolayII"
            />
            <img
              onClick={() =>
                handleItemClick(
                  [
                    {
                      name: "",
                      image: "/src/assets/img/BirthdayCadet.png",
                    },
                  ],
                  750,
                  6200
                )
              }
              className={styles.imgBirthdayCadet}
              src="/src/assets/img/BirthdayCadet.png"
              alt="BirthdayCadet"
            />
            <img
              onClick={() =>
                handleItemClick(
                  [
                    {
                      name: "",
                      image: "/src/assets/img/Gramota.png",
                    },
                  ],
                  500,
                  6200
                )
              }
              className={styles.imgGramota}
              src="/src/assets/img/Gramota.png"
              alt="Gramota"
            />
          </div>
        </div>
      </div>
    </div>
  );
};

export default Content;
