export const personDescription = [
  {
    id: "Kutuzov",
    title: "Кутузов Михаил Илларионович",
    content: (
      <div style={{ padding: "10px", fontSize: 20, textAlign: "justify" }}>
        <p style={{ textIndent: "30px" }}>
          <b>ГОЛЕНИЩЕВ-КУТУЗОВ Михаил Илларионович</b>{" "}
          <i>[5(16).9.1747, С.-Петербург, – 16(28).4.1813, Бунцлау, Силезия]</i>
          , государственный и военный деятель, генерал-фельдмаршал (1812), граф
          (1811), светлейший князь Смоленский (1812).
        </p>{" "}
        <p style={{ textIndent: "30px" }}>
          Происходил из старомосковского дворянского рода. По окончании
          артиллерийско-инженерной школы в янв. 1761 произведен в
          инженер-прапорщики и оставлен при ней для обучения воспитанников
          математике. С марта 1762 состоял адъютантом петербургского и
          эстляндского губернатора. Затем в чине капитана назначен в
          Астраханский пехотный полк.
        </p>{" "}
        <p style={{ textIndent: "30px" }}>
          В 1764 – 1765 служил в войсках, находившихся в Польше. В авг. 1767
          привлечён для работы в Комиссии по составлению нового Уложения. С 1768
          вновь находился в Польше, где сражался с польскими конфедератами. В
          1770 назначен дивизионным квартирмейстером в Молдавскую армию, в
          составе которой принял участие в Русско-турецкой войне 1768–1774. Во
          время войны находился в сражениях при Рябой Могиле, Ларге и Кагуле,
          где проявил себя храбрым, энергичным и инициативным офицером. За
          отличие произведен в подполковники. В 1772 переведён во 2-ю Крымскую
          армию, где командовал гренадерским батальоном.
        </p>
        <p style={{ textIndent: "30px" }}>
          В июле 1774 в бою тяжело ранен в левый висок пулей, вышедшей у правого
          глаза. Лечился за границей. По возвращении в Россию в июне 1777
          произведен в полковники и вскоре назначен командиром Луганского
          пикинёрного полка. В июне 1782 произведен в бригадиры и через год
          назначен командиром Мариупольского легкоконного полка. За успешные
          переговоры с крымским ханом, уступившим России свои владения от Буга
          до Кубани, в нояб. 1784 произведен в ген.-майоры и возглавил им же
          сформированный Бугский егерский корпус.
        </p>{" "}
        <p style={{ textIndent: "30px" }}>
          В начале Русско-турецкой войны 1787–1791 во главе корпуса охранял
          юго-западную границу по р. Буг. Принимал участие в боях под Очаковом,
          снова ранен. С янв. 1789, командуя различными соединениями, участвовал
          в боевых действиях под Каушанами и при взятии крепостей Аккерман и
          Бендеры.
        </p>{" "}
        <p style={{ textIndent: "30px" }}>
          В дек. 1790 отличился при штурме Измаила, где командовал 6-й штурмовой
          колонной. За отличие в марте 1791 удостоен чина ген.-поручика. В июне
          1791 разгромил турецкое войско при Бабадаге. Командуя войсками левого
          фланга, отличился в Мачинском сражении 1791, в котором показал себя
          искусным мастером манёвренных действий. В окт. 1792 направлен
          чрезвычайным и полномочным послом в Константинополь, где разрешил в
          пользу России ряд важных вопросов и значительно улучшил
          взаимоотношения с Османской империей.
        </p>{" "}
        <p style={{ textIndent: "30px" }}>
          С сент. 1793 – казанский и вятский ген.-губернатор. В 1794 назначен
          главным директором Сухопутного шляхетского кадетского корпуса.
          Одновременно в февр. 1795 назначен инспектором Финляндской инспекции.
          С дек. 1797 – шеф Рязанского мушкетерского полка. В янв. – марте 1798
          успешно выполнил дипломатическую миссию в Берлине, в результате
          которой Пруссия склонилась к союзу с Россией и Англией против Франции.
        </p>
        <p style={{ textIndent: "30px" }}>
          Произведенный в 1798 в генералы от инфантерии, некоторое время
          командовал Финляндской инспекцией, вел переговоры со Швецией по
          демаркации границ. С окт. 1799 – литовский военный губернатор и шеф
          Псковского мушкетерского полка. В июне 1801 назначен военным
          губернатором С.-Петербурга, а в июле 1801 – инспектором по инфантерии
          Финляндской инспекции. В 1802, попав в опалу, испросил увольнения от
          службы и 3 года жил в своём поместье.
        </p>{" "}
        <p style={{ textIndent: "30px" }}>
          В авг. 1805 назначен главнокомандующим русскими войсками,
          направленными против Наполеона в ходе Русско-австро-французской войны.
          В результате разгрома австрийской армии в Ульмском сражении русская
          армия оказалась один на один с противником, обладавшим значительным
          превосходством в силах. Сохраняя войска, К. в окт. 1805 совершил
          марш-манёвр от Браунау к Ольмюцу и, нанеся поражение маршалам Й.
          Мюрату под Амштеттеном и Э. Мортье под Дюренштейном, вывел войска
          из-под нависшей угрозы окружения. Однако проигранное сражение под
          Аустерлицем заставило его отвести войска в Россию. Александр I,
          фактически отстранивший К. от командования войском, возложил на него
          ответственность за неудачу. В сент. 1806 назначен военным губернатором
          Киева. В марте 1808 направлен в Молдавскую армию и возглавил ее
          главный корпус (8-я и 22-я дивизии), однако из-за конфликта с
          главнокомандующим ген.-фельдмаршалом А.А. Прозоровским был назначен
          виленским губернатором. В марте 1811 возвратился в Молдавскую армию ее
          командующим. В окт. 1811 возведен в графское достоинство. Нанеся
          поражение турецкой армии под Рущуком и Слободзеей, заставил Турцию
          заключить весной 1812 выгодный для России Бухарестский мир. За это в
          июле 1812 возведен в княжеское достоинство.
        </p>{" "}
        <p style={{ textIndent: "30px" }}>
          С началом Отечественной войны 1812 последовательно занимал должности
          командующего Нарвским корпусом, Петербургским ополчением, всеми
          войсками в Петербурге, Кронштадте и Финляндии. С авг. 1812 – член
          Госсовета. Ввиду напряжённой военной обстановки и настойчивых
          требований, исходивших от армии и народа, император Александр I 8(20)
          авг. назначил его главнокомандующим действующей армией. Прибыв к
          войскам 18(30) августа, вскоре дал генеральное сражение при Бородине,
          за которое был удостоен чина ген.-фельдмаршала. На военном совете в
          Филях принял решение отвести армию на восток и оставить Москву, что
          позволило ему сохранить армию и перевести войну в новую фазу – войну
          на истощение противника. Совершив фланговый Тарутинский манёвр, вывел
          армию из-под удара, закрыл для Наполеона пути движения в южные районы
          страны и создал благоприятные условия для организации и подготовки
          контрнаступления. В дальнейшем нанес поражение армии Наполеона под
          Вязьмой и Красным, окончательно разгромив ее на р. Березина.
        </p>{" "}
        <p style={{ textIndent: "30px" }}>
          В дек. 1812 пожалован титулом светлейшего князя Смоленского. После
          изгнания французов из России участвовал в разработке дальнейших планов
          ведения войны. Скончался в начале заграничного похода русской армии в
          силезском городке Бунцлау, тело его было забальзамировано и отправлено
          в С.-Петербург, где погребено в Казанском соборе. В 1826 в память
          заслуг покойного Псковскому пехотному полку навечно было повелено
          именоваться пехотным фельдмаршала князя Кутузова-Смоленского полком.
        </p>{" "}
        <p style={{ textIndent: "30px" }}>
          Награжден орденами: российскими – Св. Андрея Первозванного и алмазными
          знаками к ордену, Св. Владимира 1-й и 2-й ст., Св. Александра
          Невского, Св. Иоанна Иерусалимского, Св. Георгия 1-й, 2-й, 3-й и 4-й
          ст.; иностранными: австрийским – Военным Марии Терезии 1-й ст.,
          голштинским – Св. Анны, прусскими – Черного Орла и Красного Орла 1-й
          ст., золотым оружием «За храбрость» с алмазами и лаврами.
        </p>
      </div>
    ),
  },
  {
    id: "Arakcheev",
    title: "Аракчеев Алексей Андреевич",
    content: (
      <div style={{ padding: "10px", fontSize: 20, textAlign: "justify" }}>
        <p style={{ textIndent: "30px" }}>
          <b>АРАКЧЕЕВ Алексей Андреевич</b>{" "}
          <i>
            [23.9(4.10).1769, с. Гарусово Новгородской губ. — 21.4(3.5).1834, с.
            Грузино Новгородской губ.]
          </i>
          , государственный и военный деятель, генерал от артиллерии (1807),
          сенатор (1808), граф (1799).
        </p>{" "}
        <p style={{ textIndent: "30px" }}>
          Происходил из дворян. После окончания в 1787 Шляхетского
          артиллерийского и инженерного корпуса с чином поручика оставлен при
          нем преподавателем математики и артиллерии. С 1792 служил в гатчинских
          войсках наследника престола Павла I: командовал пехотным батальоном,
          артиллерией, инспектор артиллерии, а с 1796 и пехоты. В 1796
          произведен в ген.-майоры и назначен комендантом С.-Петербурга. В
          1797–1798 – командир л.-гв. Преображенского полка, в 1797–1799 -
          генерал-квартирмейстер всей армии (с перерывом в 1798), в 1799 -
          инспектор артиллерии.
        </p>{" "}
        <p style={{ textIndent: "30px" }}>
          В 1798 и 1799 дважды увольнялся из армии по прихоти императора Павла
          I. После воцарения Александра I назначен инспектором всей артиллерии
          (1803) и командиром л.-гв. Артиллерийского батальона. За пять лет
          пребывания на посту провел в жизнь важные мероприятия по реорганизации
          артиллерии и ее оснащению. В янв. 1808 назначен министром военных
          сухопутных сил (с июня – военным министром) и генерал-инспектором всей
          пехоты и артиллерии. При его непосредств. участии создан
          Артиллерийский комитет (1808) и начат выпуск «Артиллерийского журнала»
          (1808).
        </p>{" "}
        <p style={{ textIndent: "30px" }}>
          На посту министра обеспечил численный рост армии, улучшил ее
          снабжение, сыграв важную роль в подготовке России к войне с
          Наполеоном. В февр. 1809 направлен в Финляндию для ускорения хода
          боевых действий со Швецией. В 1810–1812 и 1816–1826 – председатель
          департамента военных дел Госсовета.
        </p>{" "}
        <p style={{ textIndent: "30px" }}>
          Во время Отечественной войны 1812 входил в состав императорской
          квартиры, занимался комплектованием войск, пополнением арт. парка,
          организацией подготовки ополчения. Был в числе лиц, убедивших
          императора покинуть действующую армию и выступавших за назначение на
          пост главнокомандующего М.И. Кутузова.
        </p>{" "}
        <p style={{ textIndent: "30px" }}>
          Во время Заграничных походов русской армии 1813–1814 исполнял роль
          начальника императорской походной канцелярии, являясь единственным
          докладчиком по военным, дипломатическим и др. вопросам. В сражениях
          при Люцене и Бауцене командовал артиллерией. В 1814 отказался от
          звания ген.-фельдмаршала, ссылаясь на то, что непосредственно войсками
          не командовал.
        </p>{" "}
        <p style={{ textIndent: "30px" }}>
          С 1815 фактически руководил Госсоветом и Комитетом министров. Ставя
          превыше всего интересы государства, подавлял любые формы оппозиции и
          инакомыслия, осуществлял политику крайне жестокими методами (отсюда
          нарицат. — аракчеевщина). С созданием военных поселений в России
          возглавлял их.
        </p>{" "}
        <p style={{ textIndent: "30px" }}>
          С 1819 - главный начальник над военными поселениями, в 1821–1826 -
          главный начальник Отдельного корпуса военных поселений. С восшествием
          на престол Николая I отстранен от дел и уволен в отпуск по болезни.
          Свое состояние пожертвовал Новгородскому кадетскому корпусу (в
          дальнейшем получившем название Аракчеевский).
        </p>{" "}
        <p style={{ textIndent: "30px" }}>
          Награжден орденами: российскими – Св. Андрея Первозванного, Св.
          Владимира 1-й ст., Св. Александра Невского, Св. Анны 1-й ст., Св.
          Иоанна Иерусалимского; иностранными: австрийским – св. Стефана,
          прусскими – Черного Орла и Красного Орла 1-й ст.
        </p>
      </div>
    ),
  },
  {
    id: "Melissino",
    title: "Мелиссино Петр Иванович",
    content: (
      <div style={{ padding: "10px", fontSize: 20, textAlign: "justify" }}>
        <p style={{ textIndent: "30px" }}>
          <b>МЕЛИССИНО Петр Иванович</b>{" "}
          <i>[1726 – 26.12.1797(06.01.1728), С.-Петербург]</i>, российский
          военный деятель, генерал от артиллерии (1796).
        </p>{" "}
        <p style={{ textIndent: "30px" }}>
          Происходил из дворянского рода, имевшего древние греческие корни. Дед,
          лекарь по профессии, приехал в Россию при Петре I. Служил долго и к
          концу службы занимал должность вице-директора Медицинской канцелярии.
          П.И. Мелиссино получил хорошее домашнее образование, а в 1740 г. был
          отдан на воспитание в Сухопутный кадетский корпус. В 1750 г. ему
          присваивают чин подпоручика, а в следующем году – капитан-поручика. В
          1756 г. Мелиссино был выпущен в армию с чином капитана. В 1759 г. по
          собственному желанию он бы переведен в артиллерию и получил чин
          майора. Участвовал в Семилетней войне 1756 – 1763 гг.
        </p>{" "}
        <p style={{ textIndent: "30px" }}>
          В Русско-турецкую войну 1768–1774 гг. был уже полковником, ему было
          поручено начальство над всей артиллерией 1-й армии
          генерал-фельдмаршала А.М. Голицына, затем генерал-аншефа П.А.
          Румянцева. В январе 1770 г. произведен в генерал-майоры. Способствовал
          победам под Хотином, при Ларге и Кагуле. В сражении при Кагуле, когда
          турки опрокинули каре П.Г. Племянникова и готовы были ворваться в каре
          П.И. Олица, хладнокровно открыл огонь картечью и содействовал
          отражению турок. При осаде Силистрии был ранен. За успешные действия в
          ходе войны получил репутацию одного из лучших артиллеристов своего
          времени.
        </p>{" "}
        <p style={{ textIndent: "30px" }}>
          По окончании войны Мелиссино некоторое время служил в Главной
          канцелярии артиллерии и фортификации, а в 1782 г. получил чин
          генерал-поручика. В 1783 г. его назначают директором Артиллерийского и
          инженерного шляхетского кадетского корпуса. С его именем связаны самые
          яркие страницы в истории корпуса. Он сочувствовал в целом передовым
          просветительским идеям, разработал полные и толковые должностные
          инструкции для кадетов и всех служащих в корпусе, отменил телесные
          наказания для кадетов. Мелиссино усилил в программе обучения
          общеобразовательную подготовку, преподавание истории и географии. В
          курс обучения были введены естественная история, верховая езда и
          иностранные языки: немецкий и французский. Больше времени стало
          уделяться преподаванию не только артиллерии, но тактики и
          фортификации. В корпусе существенно пополнялась библиотека, было
          приобретено много инструментов для физических упражнений,
          артиллерийская лаборатория. Во время Русско-шведской войны 1788–1790
          гг. корпус, благодаря активным действиям Мелиссино, ускорил выпуск
          подготовленных офицеров-артиллеристов в действующую армию. С 1790 г.
          исполнял должности старшего члена Экспедиции Государственной Военной
          коллегии и первоприсутствующего в канцелярии Главной артиллерии и
          фортификации. По воцарении императора Павла I в 1796 г. назначен
          инспектором всей артиллерии, первым в российской армии получил чин
          генерала от артиллерии. Умер в 1797 г. Похоронен в Лазаревской церкви
          Александро-Невской лавры в С.-Петербурге.
        </p>
        <p style={{ textIndent: "30px" }}>
          Награжден российскими орденами: Св. Андрея Первозванного, Св.
          Владимира 1-й ст., Св. Александра Невского, Св. Анны 1-й ст., Св.
          Георгия 3-й ст.
        </p>
      </div>
    ),
  },
  {
    id: "Konovnicin",
    title: "Коновницын Петр Петрович",
    content: (
      <div style={{ padding: "10px", fontSize: 20, textAlign: "justify" }}>
        <p style={{ textIndent: "30px" }}>
          <b>КОНОВНИЦЫН Петр Петрович</b>{" "}
          <i>
            [28.9(9.10).1764, Ахтырский у-д, Слободская Украина, –
            28.8(9.9).1822, Петергоф]
          </i>
          , государственный и военный деятель, генерал от инфантерии (1817),
          генерал-адъютант (1812), граф (1819), сенатор.
        </p>{" "}
        <p style={{ textIndent: "30px" }}>
          Происходил из дворян С.-Петербургской губ., сын петербургского
          губернатора ген.-поручика П.П. Коновницына. В 1770 записан в
          Артиллерийский и инженерный кадетский корпус, а в 1774 – в л-гв.
          Семеновский полк. Действительную службу начал в янв. 1785 прапорщиком
          того же полка. Участник Русско-шведской войны 1788–1790. В 1791
          переведен в армию с чином премьер-майора и назначен адъютантом к Г.А.
          Потемкину. В ходе Польских кампаний 1792 и 1794 командовал
          Старооскольским пехотным полком, отличился в боях при Баре, под
          Хельмом и Слонимом. В 1797–1798 - шеф Киевского гренадерского, затем
          Углицкого мушкетёрского полков. В 1798 императором Павлом I уволен от
          службы и до 1807 находился в отставке. В 1806 петербургское дворянство
          избрало его начальником губернской земской милиции. В 1807 вновь
          принят на службу и назначен в свиту имп. Александра I.
        </p>{" "}
        <p style={{ textIndent: "30px" }}>
          Во время Русско-шведской войны 1808–1809 - дежурный генерал штаба
          действующей армии, участвовал в боях под Свеаборгом и в отражении
          высадки морских десантов под Або, Русало, Кимито.
        </p>{" "}
        <p style={{ textIndent: "30px" }}>
          С 1809 - командир 3-й пехотной дивизии, с которой вступил в
          Отечественную войну 1812. Дивизия под его командованием в составе 3-го
          пехотного корпуса отличилась в боях под Витебском, Смоленском и
          Валутиной Горе, а затем, действуя в арьергарде, обеспечивала отход гл.
          сил и их развёртывание под Бородином. Во время Бородинского сражения
          1812 после ранения П.И. Багратиона временно командовал 2-й Западной
          армией, был дважды контужен. С сентября – дежурный генерал штаба
          действующей армии, участвовал в боях при Тарутине, Малоярославце,
          Вязьме и Красном. Во время Заграничных походов русской армии 1813–1814
          командовал Гренадерским корпусом, участвовал в сражениях при Люцене и
          Лейпциге. С 1814 - в свите императора Александра I. В дек. 1815
          назначен военным министром. С 1819 - член Госсовета и сенатор. В мае
          1819 освобожден от должности военного министра. Последние годы жизни
          являлся главным директором Пажеского корпуса и ряда других кадетских
          корпусов, а также Царскосельского лицея. На этих постах проявил
          незаурядный педагогический дар. По его инициативе был создан первый в
          русской историографии труд об Отечественной войне – «Описание войны
          1812 года».
        </p>
        <p style={{ textIndent: "30px" }}>
          Был похоронен в с. Киярово Гдовского у-да Псковской губ. Награжден
          орденами: российскими – Св. Владимира 1-й и 2-й ст., Св. Александра
          Невского и алмазными знаками к нему, Св. Анны 1-й ст., Св. Георгия
          2-й, 3-й и 4-й ст.; иностранными: австрийским – Леопольда, баварским –
          Максимилиана Иосифа, прусским – Красного Орла 1-й ст., французским –
          Св. Людовика; золотым оружием «За храбрость»
        </p>
      </div>
    ),
  },
  {
    id: "Golenischev",
    title: "Голенищев-Кутузов Павел Васильевич",
    content: (
      <div style={{ padding: "10px", fontSize: 20, textAlign: "justify" }}>
        <p style={{ textIndent: "30px" }}>
          <b>ГОЛЕНИЩЕВ-КУТУЗОВ Павел Васильевич</b>{" "}
          <i>[12(23).6.1772 – 01(13).11.1843, С.-Петербург]</i>, генерал от
          кавалерии (1826), генерал-адъютант (1810), граф (1832).
        </p>{" "}
        <p style={{ textIndent: "30px" }}>
          Происходил из дворян Новгородской губ. В 1782 зачислен в л.-гв. Конный
          полк вахмистром, в 1784 получил чин корнета. С 1783 – камер-паж
          императрицы Екатерины II. В дек. 1796 пожалован во флигель-адъютанты к
          императору Павлу I и в апр. 1798 произведен в полковники.
        </p>{" "}
        <p style={{ textIndent: "30px" }}>
          В марте 1799 уволен в отставку, но в дек. 1800 вновь принят на службу
          с производством в ген.-майоры и переводом в лейб-Гусарский полк. В
          марте 1801 назначен командиром Кавалергардского полка. С мая 1803 –
          шеф Белорусского гусарского полка. Во главе полка участвовал в
          Русско-турецкой войне 1806–1812. Находился в боях под Бухарестом,
          Турбатом, Журжею, отличился во время осады Измаила.
        </p>{" "}
        <p style={{ textIndent: "30px" }}>
          В конце 1807 вышел в отставку по болезни. В февр. 1809 вернулся на
          службу. В февр. 1810 назначен обер-полицеймейстером Петербурга и
          вскоре пожалован в генерал-адъютанты. Летом 1812 сопровождал
          императора Александра I при поездке в Вильно и был оставлен при штабе
          1-й Западной армии. Участвовал в сражении при Островно, был ранен.
          Затем сопровождал императора Александра I в поездке в Финляндию для
          свидания с наследным шведским принцем Карлом-Юханом (Бернадотом).
        </p>{" "}
        <p style={{ textIndent: "30px" }}>
          После занятия французами Москвы по высочайшему повелению собрал между
          Москвой и Вышним Волочком 788 ямщиков, из которых сформировал казачий
          Ямской полк и конную артиллерийскую полуроту. После пленения
          французами ген. Ф.Ф. Винцингероде командовал его отрядом и участвовал
          в преследовании отступавшего неприятеля, затем присоединился к 1-му
          пехотному (отдельному) корпусу ген. П.Х. Витгенштейна. Командуя
          отрядом, у м. Докшицы нанес поражение 6-му Баварскому корпусу ген. К.
          Вреде.
        </p>
        <p style={{ textIndent: "30px" }}>
          Участник Заграничных походов русской армии 1813–1814. В начале
          кампании 1813 командовал авангардом корпуса ген. П.Х. Витгенштейна,
          затем был отозван в Главную квартиру. Находился при императоре
          Александре I и участвовал в сражениях под Люценом, Бауценом, Дрезденом
          и Кульмом. За отличия в сент. 1813 пожалован в ген.-лейтенанты.
          Проявил храбрость и отвагу в «Битве народов» под Лейпцигом.
        </p>{" "}
        <p style={{ textIndent: "30px" }}>
          В кампанию 1814 был в сражениях при Бриенн-ле-Шато, Ла-Ротьере,
          Арси-сюр-Об, Фер-Шампенуазе и при взятии Парижа. Участвовал в работе
          Венского конгресса. В 1815 сопровождал императора во время 2-го похода
          во Францию.
        </p>{" "}
        <p style={{ textIndent: "30px" }}>
          В янв. 1823 назначен главным директором всех военно-учебных заведений.
          С дек. 1825 – С.-Петербургский военный губернатор. Состоял членом
          Следственной комиссии по делу декабристов. В авг. 1826, при коронации
          императора Николая I, пожалован в генералы от кавалерии. В 1830 был
          уволен от должности генерал-губернатора, а в 1832 возведен в графское
          достоинство и назначен членом Госсовета. Похоронен в с. Печетово
          Корчевского у-да Тверской губ.
        </p>{" "}
        <p style={{ textIndent: "30px" }}>
          Награжден орденами: российскими – Св. Андрея Первозванного, Св.
          Владимира 1-й и 2-й ст., Св. Александра Невского и алмазными знаками к
          ордену, Св. Анны 1-й ст. и алмазными знаками к ордену, Св. Георгия 3-й
          ст.; иностранными: австрийским – Леопольда 2-й ст., баварским –
          Военным Максимилиана Иосифа 2-й ст., прусским – Красного Орла 1-й ст.,
          шведским – Военным Меча 4-й ст.; золотым оружием «За храбрость» с
          алмазами.
        </p>
      </div>
    ),
  },
  {
    id: "Bruce",
    title: "Брюс Яков Вилимович",
    content: (
      <div style={{ padding: "10px", fontSize: 20, textAlign: "justify" }}>
        <p style={{ textIndent: "30px" }}>
          <b>Брюс Яков Вилимович</b> <i>(1670-1735)</i> – потомок шотландских
          королей, сподвижник Петра I, государственный деятель, ученый.
        </p>{" "}
        <p style={{ textIndent: "30px" }}>
          Яков Брюс родился в 1670 году, по одним данным в Москве, а по другим –
          в Пскове. В числе предков его были короли Роберт и Давид,
          царствовавшие в Шотландии в начале XIV столетия. В 1683 году был
          записан в царские потешные, в 1687 и 1689 годах принимал участие,
          будучи в чине прапорщика, в Азовских походах Голицына и был награжден
          поместьем в 120 четвертей земли и деньгами в размере от 20-30 рублей,
          как за первый поход, так и за второй.
        </p>{" "}
        <p style={{ textIndent: "30px" }}>
          В 1695-1696 годах участвовал в Азовских походах Петра I. Во времяосады
          Азова в 1696 году занимался составлением карты земель от Москвы до
          берегов Малой Азии, которая впоследствии была напечатана в Амстердаме,
          и в этом же году был пожалован в полковники. Из Амстердама, по
          повелению царя, Яков Брюс был отправлен в Англию изучать математику и
          астрономию. По возвращении в Россию занимался астрономией, переводом
          книг и их изданием.
        </p>{" "}
        <p style={{ textIndent: "30px" }}>
          В 1700 году получил звание генерал-майора артиллерии. В качестве
          начальника артиллерии Яков Брюс принимал активное участие в сражениях
          Северной войны. В битве при деревне Лесной командовал левым флангом
          русской армии. В Полтавской битве Яков Брюс успешно командовал всей
          русской артиллерией, за что был награжден орденом святого Андрея
          Первозванного.
        </p>{" "}
        <p style={{ textIndent: "30px" }}>
          В 1710 году Брюс участвовал в осаде и взятии Риги, в 1711 году
          сопровождал Петра I в Прутском походе. В 1712 году военными действиями
          на севере Германии, в союзе с датчанами и саксонцами, Яков Брюс
          закончил свое военное поприще. В 1714 году Брюс был обвинен в хищении
          казны и освобожден от наказания личным указанием Петра I.В 1717 году
          при учреждении коллегий, Петр назначил Брюса президентом берг-коллегии
          и мануфактур-коллегии, со званием сенатора, а в 1718 году отправил
          первым министром на Аланский конгресс для переговоров о мире.
        </p>{" "}
        <p style={{ textIndent: "30px" }}>
          В 1721 году Яков Брюс успешно заключил Ништадтский мирный договор,
          который существенно расширил русские владения в Прибалтике. За
          проявленное мастерство политика и дипломата Петр I пожаловал Брюсу
          графский титул и поместье из 500 крестьянских дворов. В 1726 году Яков
          Брюс был удостоен звания генерал-фельдмаршала, подал в отставку и
          целиком посвятил себя науке.
        </p>{" "}
        <p style={{ textIndent: "30px" }}>
          Яков Брюс был одним из образованнейших людей России,
          естествоиспытателем и астрономом, владел крупнейшей библиотекой,
          насчитывавшей около 1500 томов, почти исключительно
          научно-технического и справочного содержания. В 1702 году Брюс открыл
          первую в России обсерваторию при Навигацкой школе в Москве. Он
          является автором зодиакальной радиально-кольцевой планировки Москвы,
          составителем и издателем справочно-астрологического "Брюсова
          календаря".
        </p>{" "}
        <p style={{ textIndent: "30px" }}>
          Брюс свободно владел шестью европейскими языками, при его активном
          участии были составлены первые голландско-русский и русско-голландский
          словари, отредактированы многие издания по математике, военному делу,
          географии.
        </p>{" "}
        <p style={{ textIndent: "30px" }}>
          Яков Брюс скончался в своей подмосковной усадьбе Глинки 19 апреля 1735
          года.
        </p>
      </div>
    ),
  },
  {
    id: "Minikh",
    title: "Миних Бурхард Христофор",
    content: (
      <div style={{ padding: "10px", fontSize: 20, textAlign: "justify" }}>
        <p style={{ textIndent: "30px" }}>
          <b>Граф Бурхард Христофор Миних</b> родился в Ольденбурге 9 мая 1683
          года. В 1700-1720 годах служил инженером во французской,
          гессен-дармштадтской, гессен-кассельской и польско-саксонской армиях.
          В Германии заслужил чин полковника, в Польше получил от Августа II чин
          генерал-майора.
        </p>
        <p style={{ textIndent: "30px" }}>
          В 1721 году приглашен в Россию вести инженерные дела, задуманные
          Петром I.
        </p>{" "}
        <p style={{ textIndent: "30px" }}>
          Участвовал в устройстве судоходства на Неве, прокладке дорог,
          строительству Балтийского порта, проведению Ладожского канала. В 1722
          году он был произведен в генерал-лейтенанты, в 1726 году, уже при
          Екатерине I — в генерал-аншефы, удостоен ордена святого Александра
          Невского, с 1728 года — граф, генерал-губернатор Ингерманландии,
          Карелии и Финляндии.
        </p>{" "}
        <p style={{ textIndent: "30px" }}>
          В 1730 году после восшествия на престол Анны Иоанновны, Христофор
          Миних был пожалован генерал-фельдцейхмейстером, президентом Военной
          коллегии, генерал-фельдмаршалом.
        </p>{" "}
        <p style={{ textIndent: "30px" }}>
          Миних образовал 2 новых гвардейских полка, провел переустройство
          гвардейских и армейских полков, преобразовал Военную коллегию, основал
          в Петербурге первый в России кадетский корпус, составил новые штаты
          для армии, ввел в армии корпус (12 полков) тяжелой конницы (кирасир),
          создал первые полки гусар, сравнял жалованье природных русских
          офицеров с приглашенными иностранными. Возглавлял русскую армию во
          время Польской кампании 1733-1734 годов.
        </p>{" "}
        <p style={{ textIndent: "30px" }}>
          Во время русско-турецкой войны 1735-1739 годов был назначен
          командующим русских войск. Организовал осаду Азова и Очакова, овладел
          Перекопом, проник в Крым, захватив столицу Крымского ханства
          Бахчисарай.
        </p>{" "}
        <p style={{ textIndent: "30px" }}>
          В ночь с 8 (19) на 9 (20) ноября 1721 года арестовал Бирона и
          провозгласил Анну Леопольдовну правительницей государства. Назначен
          первым кабинет-министром, но вскоре ушел в отставку.
        </p>{" "}
        <p style={{ textIndent: "30px" }}>
          После свержения Брауншвейгской династии и воцарения Елизаветы Петровны
          24-25 ноября (5-6 декабря) 1741 был сослан в Пелым (Тобольская
          провинция), где провел 20 лет.
        </p>{" "}
        <p style={{ textIndent: "30px" }}>
          В 1762 по указу Петра III освобожден и восстановлен во всех правах и
          званиях. Во время переворота 28 июня (9 июля) 1762 года оставался
          рядом с императором, однако затем присягнул Екатерине II.
        </p>{" "}
        <p style={{ textIndent: "30px" }}>
          Назначен командующим над главными балтийскими портами и над Ладожским
          каналом; в последующие годы занимался в основном устройством
          Рогервикской гавани. Умер 16 (27) октября 1767 года в Дерпте (совр.
          Тарту) в возрасте 84 лет.
        </p>
      </div>
    ),
  },
  {
    id: "Shuvalov",
    title: "Шувалов Петр Иванович ",
    content: (
      <div style={{ padding: "10px", fontSize: 20, textAlign: "justify" }}>
        <p style={{ textIndent: "30px" }}>
          <b>ШУВА́ЛОВ Пётр Иванович</b>{" "}
          <i>[кон. 1711 или 1712 – 4(15).1.1762, С.-Петербург]</i>, граф (с
          1746), рос. гос. и воен. деятель, предприниматель, ген.-фельдмаршал
          (1761/62), дейст-вит. камергер (1741/42), ген.-адъютант (1748). Второй
          сын Ивана Максимовича Старшего, выборгского коменданта. Старший брат,
          Александр Иванович Шувалов, генерал-фельдмаршал, в течение многих лет
          возглавлял тайную канцелярию. Начал службу пажом имп. Екатерины I в
          1723. Камер-паж цесаревны Анны Петровны (1726–28). С 1731 камер-юнкер
          цесаревны Елизаветы Петровны, вхо-дил в её ближайшее окружение. Один
          из деятельных участников дворцового перево-рота 1741, приведшего её к
          власти. Сенатор (с 1744). С 1756 чл. Конференции при Высо-чайшем
          дворе, генерал-фельдцейхмейстер и нач. Оружейной канцелярии (1757–61).
          В дек. 1761/янв. 1762 – янв. 1762 гл. советник имп. Петра III.
        </p>{" "}
        <p style={{ textIndent: "30px" }}>
          С сер. 1740-х гг. один из гл. руководителей внутр. политики Рос.
          империи. Инициатор снижения подушной подати за счёт увеличения
          косвенных налогов (повышения цен на соль и вино; 1750), проведения
          таможенной реформы 1753–54, в ходе которой бы-ли упразднены внутр.
          таможни. В 1753 предложил широкую программу освоения Си-бири. В 1754
          по инициативе Ш. созданы Уложенная комиссия по составлению нового
          свода законов, Дворянский заёмный банк и Купеч. банк. С 1755
          «Государственный ме-жевщик» и гл. присутствующий в Гл. межевой
          канцелярии, руководил проведением т. н. Елизаветинского межевания. Под
          контролем Ш. находилась Петерб. монетная экспе-диция (1756–1761), т.
          н. Медный банк (с 1758), Арт. банк (с 1760). С 1757 по предложению Ш.
          начат широкий выпуск медных денег при уменьшении веса монет в 2 раза
          (что уд-ваивало прибыль гос. казны). В 1760 по проекту Ш. учреждена
          2-я Комиссия о коммерции.
        </p>{" "}
        <p style={{ textIndent: "30px" }}>
          В 1754 выдвинул проект создания первой воен. академии в России и
          представил док-ладную записку «О военной науке», в которой обобщил
          передовые для своего време-ни принципы воен. теории. После начала
          Семилетней войны 1756–63 сформировал в 1756–57 30-тысячный Обсервац.
          корпус, в 1757 спец. Понтонную роту, в 1760 особый Инж. полк. В 1757
          инициировал создание Комиссии о всех рос. крепостях, описавшую все
          рос. цитадели и улучшившую состояние некоторых из них. Под общим рук.
          Ш. раз-работано неск. образцов арт. орудий, в т. ч. полевая секретная
          гаубица, имевшая рас-ширявшийся к дульной части эллиптич. канал ствола
          для веерообразного разлёта картечи в горизонт (1753), единорог
          (1757–59). В 1758 по инициативе Ш. создана объе-динённая Арт. и инж.
          школа (с 1762 Арт. и инж. кадетский шляхетный корпус).
        </p>{" "}
        <p style={{ textIndent: "30px" }}>
          Крупный землевладелец. В 1748 получил монополию на сальные промыслы у
          Архан-гельска и Колы, Грунландские китоловные промыслы у о.
          Шпицберген, позднее на тю-леньи промыслы на Ладожском оз., а также на
          Каспийском м. (1751), рыболовные про-мыслы на Белом и Каспийском
          морях. Владел винокуренными заводами в нескольких губерниях, с 1754
          железоделательными Гороблагодатскими заводами на Урале. По-строил
          Верхний (пущен в 1755) и Нижний (пущен в 1756) Авзянопетровские
          (владел до 1758), Серебрянский (пущен в 1755), Воткинский (пущен в
          1759) заводы, в 1760 начал строительство Ижевского завода. С 1756
          держал табачный откуп.
        </p>{" "}
        <p style={{ textIndent: "30px" }}>
          Награждён орденами Св. Александра Невского (1742), Св. Андрея
          Первозванного (1753) и др. Пётр Иванович похоронен на Лазаревском
          кладбище Александро-Невской лавры.
        </p>
      </div>
    ),
  },
];
