export const personDescription = [
  {
    id: "Kutuzov",
    title: "Кутузов Михаил Илларионович",
    content: (
      <div style={{ padding: "10px", fontSize: 20, textAlign: "justify",fontFamily: "'Poppins', sans-serif", }}>
        <p style={{ textIndent: "30px" }}>
          <b>ГОЛЕНИЩЕВ-КУТУЗОВ Михаил Илларионович</b>{" "}
          <i>[5(16).9.1747, С.-Петербург, – 16(28).4.1813, Бунцлау, Силезия]</i>
          , государственный и военный деятель, генерал-фельдмаршал (1812), граф
          (1811), светлейший князь Смоленский (1812).
        </p>{" "}
        <p style={{ textIndent: "30px" }}>
          Происходил из старомосковского дворянского рода. По окончании
          артиллерийско-инженерной школы в янв. 1761 произведен в
          инженер-прапорщики и оставлен при ней для обучения воспитанников
          математике. С марта 1762 состоял адъютантом петербургского и
          эстляндского губернатора. Затем в чине капитана назначен в
          Астраханский пехотный полк.
        </p>{" "}
        <p style={{ textIndent: "30px" }}>
          В 1764 – 1765 служил в войсках, находившихся в Польше. В авг. 1767
          привлечён для работы в Комиссии по составлению нового Уложения. С 1768
          вновь находился в Польше, где сражался с польскими конфедератами. В
          1770 назначен дивизионным квартирмейстером в Молдавскую армию, в
          составе которой принял участие в Русско-турецкой войне 1768–1774. Во
          время войны находился в сражениях при Рябой Могиле, Ларге и Кагуле,
          где проявил себя храбрым, энергичным и инициативным офицером. За
          отличие произведен в подполковники. В 1772 переведён во 2-ю Крымскую
          армию, где командовал гренадерским батальоном.
        </p>
        <p style={{ textIndent: "30px" }}>
          В июле 1774 в бою тяжело ранен в левый висок пулей, вышедшей у правого
          глаза. Лечился за границей. По возвращении в Россию в июне 1777
          произведен в полковники и вскоре назначен командиром Луганского
          пикинёрного полка. В июне 1782 произведен в бригадиры и через год
          назначен командиром Мариупольского легкоконного полка. За успешные
          переговоры с крымским ханом, уступившим России свои владения от Буга
          до Кубани, в нояб. 1784 произведен в ген.-майоры и возглавил им же
          сформированный Бугский егерский корпус.
        </p>{" "}
        <p style={{ textIndent: "30px" }}>
          В начале Русско-турецкой войны 1787–1791 во главе корпуса охранял
          юго-западную границу по р. Буг. Принимал участие в боях под Очаковом,
          снова ранен. С янв. 1789, командуя различными соединениями, участвовал
          в боевых действиях под Каушанами и при взятии крепостей Аккерман и
          Бендеры.
        </p>{" "}
        <p style={{ textIndent: "30px" }}>
          В дек. 1790 отличился при штурме Измаила, где командовал 6-й штурмовой
          колонной. За отличие в марте 1791 удостоен чина ген.-поручика. В июне
          1791 разгромил турецкое войско при Бабадаге. Командуя войсками левого
          фланга, отличился в Мачинском сражении 1791, в котором показал себя
          искусным мастером манёвренных действий. В окт. 1792 направлен
          чрезвычайным и полномочным послом в Константинополь, где разрешил в
          пользу России ряд важных вопросов и значительно улучшил
          взаимоотношения с Османской империей.
        </p>{" "}
        <p style={{ textIndent: "30px" }}>
          С сент. 1793 – казанский и вятский ген.-губернатор. В 1794 назначен
          главным директором Сухопутного шляхетского кадетского корпуса.
          Одновременно в февр. 1795 назначен инспектором Финляндской инспекции.
          С дек. 1797 – шеф Рязанского мушкетерского полка. В янв. – марте 1798
          успешно выполнил дипломатическую миссию в Берлине, в результате
          которой Пруссия склонилась к союзу с Россией и Англией против Франции.
        </p>
        <p style={{ textIndent: "30px" }}>
          Произведенный в 1798 в генералы от инфантерии, некоторое время
          командовал Финляндской инспекцией, вел переговоры со Швецией по
          демаркации границ. С окт. 1799 – литовский военный губернатор и шеф
          Псковского мушкетерского полка. В июне 1801 назначен военным
          губернатором С.-Петербурга, а в июле 1801 – инспектором по инфантерии
          Финляндской инспекции. В 1802, попав в опалу, испросил увольнения от
          службы и 3 года жил в своём поместье.
        </p>{" "}
        <p style={{ textIndent: "30px" }}>
          В авг. 1805 назначен главнокомандующим русскими войсками,
          направленными против Наполеона в ходе Русско-австро-французской войны.
          В результате разгрома австрийской армии в Ульмском сражении русская
          армия оказалась один на один с противником, обладавшим значительным
          превосходством в силах. Сохраняя войска, К. в окт. 1805 совершил
          марш-манёвр от Браунау к Ольмюцу и, нанеся поражение маршалам Й.
          Мюрату под Амштеттеном и Э. Мортье под Дюренштейном, вывел войска
          из-под нависшей угрозы окружения. Однако проигранное сражение под
          Аустерлицем заставило его отвести войска в Россию. Александр I,
          фактически отстранивший К. от командования войском, возложил на него
          ответственность за неудачу. В сент. 1806 назначен военным губернатором
          Киева. В марте 1808 направлен в Молдавскую армию и возглавил ее
          главный корпус (8-я и 22-я дивизии), однако из-за конфликта с
          главнокомандующим ген.-фельдмаршалом А.А. Прозоровским был назначен
          виленским губернатором. В марте 1811 возвратился в Молдавскую армию ее
          командующим. В окт. 1811 возведен в графское достоинство. Нанеся
          поражение турецкой армии под Рущуком и Слободзеей, заставил Турцию
          заключить весной 1812 выгодный для России Бухарестский мир. За это в
          июле 1812 возведен в княжеское достоинство.
        </p>{" "}
        <p style={{ textIndent: "30px" }}>
          С началом Отечественной войны 1812 последовательно занимал должности
          командующего Нарвским корпусом, Петербургским ополчением, всеми
          войсками в Петербурге, Кронштадте и Финляндии. С авг. 1812 – член
          Госсовета. Ввиду напряжённой военной обстановки и настойчивых
          требований, исходивших от армии и народа, император Александр I 8(20)
          авг. назначил его главнокомандующим действующей армией. Прибыв к
          войскам 18(30) августа, вскоре дал генеральное сражение при Бородине,
          за которое был удостоен чина ген.-фельдмаршала. На военном совете в
          Филях принял решение отвести армию на восток и оставить Москву, что
          позволило ему сохранить армию и перевести войну в новую фазу – войну
          на истощение противника. Совершив фланговый Тарутинский манёвр, вывел
          армию из-под удара, закрыл для Наполеона пути движения в южные районы
          страны и создал благоприятные условия для организации и подготовки
          контрнаступления. В дальнейшем нанес поражение армии Наполеона под
          Вязьмой и Красным, окончательно разгромив ее на р. Березина.
        </p>{" "}
        <p style={{ textIndent: "30px" }}>
          В дек. 1812 пожалован титулом светлейшего князя Смоленского. После
          изгнания французов из России участвовал в разработке дальнейших планов
          ведения войны. Скончался в начале заграничного похода русской армии в
          силезском городке Бунцлау, тело его было забальзамировано и отправлено
          в С.-Петербург, где погребено в Казанском соборе. В 1826 в память
          заслуг покойного Псковскому пехотному полку навечно было повелено
          именоваться пехотным фельдмаршала князя Кутузова-Смоленского полком.
        </p>{" "}
        <p style={{ textIndent: "30px" }}>
          Награжден орденами: российскими – Св. Андрея Первозванного и алмазными
          знаками к ордену, Св. Владимира 1-й и 2-й ст., Св. Александра
          Невского, Св. Иоанна Иерусалимского, Св. Георгия 1-й, 2-й, 3-й и 4-й
          ст.; иностранными: австрийским – Военным Марии Терезии 1-й ст.,
          голштинским – Св. Анны, прусскими – Черного Орла и Красного Орла 1-й
          ст., золотым оружием «За храбрость» с алмазами и лаврами.
        </p>
      </div>
    ),
  },
  {
    id: "Arakcheev",
    title: "Аракчеев Алексей Андреевич",
    content: (
      <div style={{ padding: "10px", fontSize: 20, textAlign: "justify",fontFamily: "'Poppins', sans-serif", }}>
        <p style={{ textIndent: "30px" }}>
          <b>АРАКЧЕЕВ Алексей Андреевич</b>{" "}
          <i>
            [23.9(4.10).1769, с. Гарусово Новгородской губ. — 21.4(3.5).1834, с.
            Грузино Новгородской губ.]
          </i>
          , государственный и военный деятель, генерал от артиллерии (1807),
          сенатор (1808), граф (1799).
        </p>{" "}
        <p style={{ textIndent: "30px" }}>
          Происходил из дворян. После окончания в 1787 Шляхетского
          артиллерийского и инженерного корпуса с чином поручика оставлен при
          нем преподавателем математики и артиллерии. С 1792 служил в гатчинских
          войсках наследника престола Павла I: командовал пехотным батальоном,
          артиллерией, инспектор артиллерии, а с 1796 и пехоты. В 1796
          произведен в ген.-майоры и назначен комендантом С.-Петербурга. В
          1797–1798 – командир л.-гв. Преображенского полка, в 1797–1799 -
          генерал-квартирмейстер всей армии (с перерывом в 1798), в 1799 -
          инспектор артиллерии.
        </p>{" "}
        <p style={{ textIndent: "30px" }}>
          В 1798 и 1799 дважды увольнялся из армии по прихоти императора Павла
          I. После воцарения Александра I назначен инспектором всей артиллерии
          (1803) и командиром л.-гв. Артиллерийского батальона. За пять лет
          пребывания на посту провел в жизнь важные мероприятия по реорганизации
          артиллерии и ее оснащению. В янв. 1808 назначен министром военных
          сухопутных сил (с июня – военным министром) и генерал-инспектором всей
          пехоты и артиллерии. При его непосредств. участии создан
          Артиллерийский комитет (1808) и начат выпуск «Артиллерийского журнала»
          (1808).
        </p>{" "}
        <p style={{ textIndent: "30px" }}>
          На посту министра обеспечил численный рост армии, улучшил ее
          снабжение, сыграв важную роль в подготовке России к войне с
          Наполеоном. В февр. 1809 направлен в Финляндию для ускорения хода
          боевых действий со Швецией. В 1810–1812 и 1816–1826 – председатель
          департамента военных дел Госсовета.
        </p>{" "}
        <p style={{ textIndent: "30px" }}>
          Во время Отечественной войны 1812 входил в состав императорской
          квартиры, занимался комплектованием войск, пополнением арт. парка,
          организацией подготовки ополчения. Был в числе лиц, убедивших
          императора покинуть действующую армию и выступавших за назначение на
          пост главнокомандующего М.И. Кутузова.
        </p>{" "}
        <p style={{ textIndent: "30px" }}>
          Во время Заграничных походов русской армии 1813–1814 исполнял роль
          начальника императорской походной канцелярии, являясь единственным
          докладчиком по военным, дипломатическим и др. вопросам. В сражениях
          при Люцене и Бауцене командовал артиллерией. В 1814 отказался от
          звания ген.-фельдмаршала, ссылаясь на то, что непосредственно войсками
          не командовал.
        </p>{" "}
        <p style={{ textIndent: "30px" }}>
          С 1815 фактически руководил Госсоветом и Комитетом министров. Ставя
          превыше всего интересы государства, подавлял любые формы оппозиции и
          инакомыслия, осуществлял политику крайне жестокими методами (отсюда
          нарицат. — аракчеевщина). С созданием военных поселений в России
          возглавлял их.
        </p>{" "}
        <p style={{ textIndent: "30px" }}>
          С 1819 - главный начальник над военными поселениями, в 1821–1826 -
          главный начальник Отдельного корпуса военных поселений. С восшествием
          на престол Николая I отстранен от дел и уволен в отпуск по болезни.
          Свое состояние пожертвовал Новгородскому кадетскому корпусу (в
          дальнейшем получившем название Аракчеевский).
        </p>{" "}
        <p style={{ textIndent: "30px" }}>
          Награжден орденами: российскими – Св. Андрея Первозванного, Св.
          Владимира 1-й ст., Св. Александра Невского, Св. Анны 1-й ст., Св.
          Иоанна Иерусалимского; иностранными: австрийским – св. Стефана,
          прусскими – Черного Орла и Красного Орла 1-й ст.
        </p>
      </div>
    ),
  },
  {
    id: "Melissino",
    title: "Мелиссино Петр Иванович",
    content: (
      <div style={{ padding: "10px", fontSize: 20, textAlign: "justify",fontFamily: "'Poppins', sans-serif", }}>
        <p style={{ textIndent: "30px" }}>
          <b>МЕЛИССИНО Петр Иванович</b>{" "}
          <i>[1726 – 26.12.1797(06.01.1728), С.-Петербург]</i>, российский
          военный деятель, генерал от артиллерии (1796).
        </p>{" "}
        <p style={{ textIndent: "30px" }}>
          Происходил из дворянского рода, имевшего древние греческие корни. Дед,
          лекарь по профессии, приехал в Россию при Петре I. Служил долго и к
          концу службы занимал должность вице-директора Медицинской канцелярии.
          П.И. Мелиссино получил хорошее домашнее образование, а в 1740 г. был
          отдан на воспитание в Сухопутный кадетский корпус. В 1750 г. ему
          присваивают чин подпоручика, а в следующем году – капитан-поручика. В
          1756 г. Мелиссино был выпущен в армию с чином капитана. В 1759 г. по
          собственному желанию он бы переведен в артиллерию и получил чин
          майора. Участвовал в Семилетней войне 1756 – 1763 гг.
        </p>{" "}
        <p style={{ textIndent: "30px" }}>
          В Русско-турецкую войну 1768–1774 гг. был уже полковником, ему было
          поручено начальство над всей артиллерией 1-й армии
          генерал-фельдмаршала А.М. Голицына, затем генерал-аншефа П.А.
          Румянцева. В январе 1770 г. произведен в генерал-майоры. Способствовал
          победам под Хотином, при Ларге и Кагуле. В сражении при Кагуле, когда
          турки опрокинули каре П.Г. Племянникова и готовы были ворваться в каре
          П.И. Олица, хладнокровно открыл огонь картечью и содействовал
          отражению турок. При осаде Силистрии был ранен. За успешные действия в
          ходе войны получил репутацию одного из лучших артиллеристов своего
          времени.
        </p>{" "}
        <p style={{ textIndent: "30px" }}>
          По окончании войны Мелиссино некоторое время служил в Главной
          канцелярии артиллерии и фортификации, а в 1782 г. получил чин
          генерал-поручика. В 1783 г. его назначают директором Артиллерийского и
          инженерного шляхетского кадетского корпуса. С его именем связаны самые
          яркие страницы в истории корпуса. Он сочувствовал в целом передовым
          просветительским идеям, разработал полные и толковые должностные
          инструкции для кадетов и всех служащих в корпусе, отменил телесные
          наказания для кадетов. Мелиссино усилил в программе обучения
          общеобразовательную подготовку, преподавание истории и географии. В
          курс обучения были введены естественная история, верховая езда и
          иностранные языки: немецкий и французский. Больше времени стало
          уделяться преподаванию не только артиллерии, но тактики и
          фортификации. В корпусе существенно пополнялась библиотека, было
          приобретено много инструментов для физических упражнений,
          артиллерийская лаборатория. Во время Русско-шведской войны 1788–1790
          гг. корпус, благодаря активным действиям Мелиссино, ускорил выпуск
          подготовленных офицеров-артиллеристов в действующую армию. С 1790 г.
          исполнял должности старшего члена Экспедиции Государственной Военной
          коллегии и первоприсутствующего в канцелярии Главной артиллерии и
          фортификации. По воцарении императора Павла I в 1796 г. назначен
          инспектором всей артиллерии, первым в российской армии получил чин
          генерала от артиллерии. Умер в 1797 г. Похоронен в Лазаревской церкви
          Александро-Невской лавры в С.-Петербурге.
        </p>
        <p style={{ textIndent: "30px" }}>
          Награжден российскими орденами: Св. Андрея Первозванного, Св.
          Владимира 1-й ст., Св. Александра Невского, Св. Анны 1-й ст., Св.
          Георгия 3-й ст.
        </p>
      </div>
    ),
  },
  {
    id: "Konovnicin",
    title: "Коновницын Петр Петрович",
    content: (
      <div style={{ padding: "10px", fontSize: 20, textAlign: "justify",fontFamily: "'Poppins', sans-serif", }}>
        <p style={{ textIndent: "30px" }}>
          <b>КОНОВНИЦЫН Петр Петрович</b>{" "}
          <i>
            [28.9(9.10).1764, Ахтырский у-д, Слободская Украина, –
            28.8(9.9).1822, Петергоф]
          </i>
          , государственный и военный деятель, генерал от инфантерии (1817),
          генерал-адъютант (1812), граф (1819), сенатор.
        </p>{" "}
        <p style={{ textIndent: "30px" }}>
          Происходил из дворян С.-Петербургской губ., сын петербургского
          губернатора ген.-поручика П.П. Коновницына. В 1770 записан в
          Артиллерийский и инженерный кадетский корпус, а в 1774 – в л-гв.
          Семеновский полк. Действительную службу начал в янв. 1785 прапорщиком
          того же полка. Участник Русско-шведской войны 1788–1790. В 1791
          переведен в армию с чином премьер-майора и назначен адъютантом к Г.А.
          Потемкину. В ходе Польских кампаний 1792 и 1794 командовал
          Старооскольским пехотным полком, отличился в боях при Баре, под
          Хельмом и Слонимом. В 1797–1798 - шеф Киевского гренадерского, затем
          Углицкого мушкетёрского полков. В 1798 императором Павлом I уволен от
          службы и до 1807 находился в отставке. В 1806 петербургское дворянство
          избрало его начальником губернской земской милиции. В 1807 вновь
          принят на службу и назначен в свиту имп. Александра I.
        </p>{" "}
        <p style={{ textIndent: "30px" }}>
          Во время Русско-шведской войны 1808–1809 - дежурный генерал штаба
          действующей армии, участвовал в боях под Свеаборгом и в отражении
          высадки морских десантов под Або, Русало, Кимито.
        </p>{" "}
        <p style={{ textIndent: "30px" }}>
          С 1809 - командир 3-й пехотной дивизии, с которой вступил в
          Отечественную войну 1812. Дивизия под его командованием в составе 3-го
          пехотного корпуса отличилась в боях под Витебском, Смоленском и
          Валутиной Горе, а затем, действуя в арьергарде, обеспечивала отход гл.
          сил и их развёртывание под Бородином. Во время Бородинского сражения
          1812 после ранения П.И. Багратиона временно командовал 2-й Западной
          армией, был дважды контужен. С сентября – дежурный генерал штаба
          действующей армии, участвовал в боях при Тарутине, Малоярославце,
          Вязьме и Красном. Во время Заграничных походов русской армии 1813–1814
          командовал Гренадерским корпусом, участвовал в сражениях при Люцене и
          Лейпциге. С 1814 - в свите императора Александра I. В дек. 1815
          назначен военным министром. С 1819 - член Госсовета и сенатор. В мае
          1819 освобожден от должности военного министра. Последние годы жизни
          являлся главным директором Пажеского корпуса и ряда других кадетских
          корпусов, а также Царскосельского лицея. На этих постах проявил
          незаурядный педагогический дар. По его инициативе был создан первый в
          русской историографии труд об Отечественной войне – «Описание войны
          1812 года».
        </p>
        <p style={{ textIndent: "30px" }}>
          Был похоронен в с. Киярово Гдовского у-да Псковской губ. Награжден
          орденами: российскими – Св. Владимира 1-й и 2-й ст., Св. Александра
          Невского и алмазными знаками к нему, Св. Анны 1-й ст., Св. Георгия
          2-й, 3-й и 4-й ст.; иностранными: австрийским – Леопольда, баварским –
          Максимилиана Иосифа, прусским – Красного Орла 1-й ст., французским –
          Св. Людовика; золотым оружием «За храбрость»
        </p>
      </div>
    ),
  },
  {
    id: "Golenischev",
    title: "Голенищев-Кутузов Павел Васильевич",
    content: (
      <div style={{ padding: "10px", fontSize: 20, textAlign: "justify",fontFamily: "'Poppins', sans-serif", }}>
        <p style={{ textIndent: "30px" }}>
          <b>ГОЛЕНИЩЕВ-КУТУЗОВ Павел Васильевич</b>{" "}
          <i>[12(23).6.1772 – 01(13).11.1843, С.-Петербург]</i>, генерал от
          кавалерии (1826), генерал-адъютант (1810), граф (1832).
        </p>{" "}
        <p style={{ textIndent: "30px" }}>
          Происходил из дворян Новгородской губ. В 1782 зачислен в л.-гв. Конный
          полк вахмистром, в 1784 получил чин корнета. С 1783 – камер-паж
          императрицы Екатерины II. В дек. 1796 пожалован во флигель-адъютанты к
          императору Павлу I и в апр. 1798 произведен в полковники.
        </p>{" "}
        <p style={{ textIndent: "30px" }}>
          В марте 1799 уволен в отставку, но в дек. 1800 вновь принят на службу
          с производством в ген.-майоры и переводом в лейб-Гусарский полк. В
          марте 1801 назначен командиром Кавалергардского полка. С мая 1803 –
          шеф Белорусского гусарского полка. Во главе полка участвовал в
          Русско-турецкой войне 1806–1812. Находился в боях под Бухарестом,
          Турбатом, Журжею, отличился во время осады Измаила.
        </p>{" "}
        <p style={{ textIndent: "30px" }}>
          В конце 1807 вышел в отставку по болезни. В февр. 1809 вернулся на
          службу. В февр. 1810 назначен обер-полицеймейстером Петербурга и
          вскоре пожалован в генерал-адъютанты. Летом 1812 сопровождал
          императора Александра I при поездке в Вильно и был оставлен при штабе
          1-й Западной армии. Участвовал в сражении при Островно, был ранен.
          Затем сопровождал императора Александра I в поездке в Финляндию для
          свидания с наследным шведским принцем Карлом-Юханом (Бернадотом).
        </p>{" "}
        <p style={{ textIndent: "30px" }}>
          После занятия французами Москвы по высочайшему повелению собрал между
          Москвой и Вышним Волочком 788 ямщиков, из которых сформировал казачий
          Ямской полк и конную артиллерийскую полуроту. После пленения
          французами ген. Ф.Ф. Винцингероде командовал его отрядом и участвовал
          в преследовании отступавшего неприятеля, затем присоединился к 1-му
          пехотному (отдельному) корпусу ген. П.Х. Витгенштейна. Командуя
          отрядом, у м. Докшицы нанес поражение 6-му Баварскому корпусу ген. К.
          Вреде.
        </p>
        <p style={{ textIndent: "30px" }}>
          Участник Заграничных походов русской армии 1813–1814. В начале
          кампании 1813 командовал авангардом корпуса ген. П.Х. Витгенштейна,
          затем был отозван в Главную квартиру. Находился при императоре
          Александре I и участвовал в сражениях под Люценом, Бауценом, Дрезденом
          и Кульмом. За отличия в сент. 1813 пожалован в ген.-лейтенанты.
          Проявил храбрость и отвагу в «Битве народов» под Лейпцигом.
        </p>{" "}
        <p style={{ textIndent: "30px" }}>
          В кампанию 1814 был в сражениях при Бриенн-ле-Шато, Ла-Ротьере,
          Арси-сюр-Об, Фер-Шампенуазе и при взятии Парижа. Участвовал в работе
          Венского конгресса. В 1815 сопровождал императора во время 2-го похода
          во Францию.
        </p>{" "}
        <p style={{ textIndent: "30px" }}>
          В янв. 1823 назначен главным директором всех военно-учебных заведений.
          С дек. 1825 – С.-Петербургский военный губернатор. Состоял членом
          Следственной комиссии по делу декабристов. В авг. 1826, при коронации
          императора Николая I, пожалован в генералы от кавалерии. В 1830 был
          уволен от должности генерал-губернатора, а в 1832 возведен в графское
          достоинство и назначен членом Госсовета. Похоронен в с. Печетово
          Корчевского у-да Тверской губ.
        </p>{" "}
        <p style={{ textIndent: "30px" }}>
          Награжден орденами: российскими – Св. Андрея Первозванного, Св.
          Владимира 1-й и 2-й ст., Св. Александра Невского и алмазными знаками к
          ордену, Св. Анны 1-й ст. и алмазными знаками к ордену, Св. Георгия 3-й
          ст.; иностранными: австрийским – Леопольда 2-й ст., баварским –
          Военным Максимилиана Иосифа 2-й ст., прусским – Красного Орла 1-й ст.,
          шведским – Военным Меча 4-й ст.; золотым оружием «За храбрость» с
          алмазами.
        </p>
      </div>
    ),
  },
  {
    id: "Bruce",
    title: "Брюс Яков Вилимович",
    content: (
      <div style={{ padding: "10px", fontSize: 20, textAlign: "justify",  fontFamily: "'Poppins', sans-serif", }}>
        <p style={{ textIndent: "30px" }}>
          <b>Брюс Яков Вилимович</b> <i>(1670-1735)</i> – потомок шотландских
          королей, сподвижник Петра I, государственный деятель, ученый.
        </p>{" "}
        <p style={{ textIndent: "30px" }}>
          Яков Брюс родился в 1670 году, по одним данным в Москве, а по другим –
          в Пскове. В числе предков его были короли Роберт и Давид,
          царствовавшие в Шотландии в начале XIV столетия. В 1683 году был
          записан в царские потешные, в 1687 и 1689 годах принимал участие,
          будучи в чине прапорщика, в Азовских походах Голицына и был награжден
          поместьем в 120 четвертей земли и деньгами в размере от 20-30 рублей,
          как за первый поход, так и за второй.
        </p>{" "}
        <p style={{ textIndent: "30px" }}>
          В 1695-1696 годах участвовал в Азовских походах Петра I. Во времяосады
          Азова в 1696 году занимался составлением карты земель от Москвы до
          берегов Малой Азии, которая впоследствии была напечатана в Амстердаме,
          и в этом же году был пожалован в полковники. Из Амстердама, по
          повелению царя, Яков Брюс был отправлен в Англию изучать математику и
          астрономию. По возвращении в Россию занимался астрономией, переводом
          книг и их изданием.
        </p>{" "}
        <p style={{ textIndent: "30px" }}>
          В 1700 году получил звание генерал-майора артиллерии. В качестве
          начальника артиллерии Яков Брюс принимал активное участие в сражениях
          Северной войны. В битве при деревне Лесной командовал левым флангом
          русской армии. В Полтавской битве Яков Брюс успешно командовал всей
          русской артиллерией, за что был награжден орденом святого Андрея
          Первозванного.
        </p>{" "}
        <p style={{ textIndent: "30px" }}>
          В 1710 году Брюс участвовал в осаде и взятии Риги, в 1711 году
          сопровождал Петра I в Прутском походе. В 1712 году военными действиями
          на севере Германии, в союзе с датчанами и саксонцами, Яков Брюс
          закончил свое военное поприще. В 1714 году Брюс был обвинен в хищении
          казны и освобожден от наказания личным указанием Петра I.В 1717 году
          при учреждении коллегий, Петр назначил Брюса президентом берг-коллегии
          и мануфактур-коллегии, со званием сенатора, а в 1718 году отправил
          первым министром на Аланский конгресс для переговоров о мире.
        </p>{" "}
        <p style={{ textIndent: "30px" }}>
          В 1721 году Яков Брюс успешно заключил Ништадтский мирный договор,
          который существенно расширил русские владения в Прибалтике. За
          проявленное мастерство политика и дипломата Петр I пожаловал Брюсу
          графский титул и поместье из 500 крестьянских дворов. В 1726 году Яков
          Брюс был удостоен звания генерал-фельдмаршала, подал в отставку и
          целиком посвятил себя науке.
        </p>{" "}
        <p style={{ textIndent: "30px" }}>
          Яков Брюс был одним из образованнейших людей России,
          естествоиспытателем и астрономом, владел крупнейшей библиотекой,
          насчитывавшей около 1500 томов, почти исключительно
          научно-технического и справочного содержания. В 1702 году Брюс открыл
          первую в России обсерваторию при Навигацкой школе в Москве. Он
          является автором зодиакальной радиально-кольцевой планировки Москвы,
          составителем и издателем справочно-астрологического "Брюсова
          календаря".
        </p>{" "}
        <p style={{ textIndent: "30px" }}>
          Брюс свободно владел шестью европейскими языками, при его активном
          участии были составлены первые голландско-русский и русско-голландский
          словари, отредактированы многие издания по математике, военному делу,
          географии.
        </p>{" "}
        <p style={{ textIndent: "30px" }}>
          Яков Брюс скончался в своей подмосковной усадьбе Глинки 19 апреля 1735
          года.
        </p>
      </div>
    ),
  },
  {
    id: "Minikh",
    title: "Миних Бурхард Христофор",
    content: (
      <div style={{ padding: "10px", fontSize: 20, textAlign: "justify", fontFamily: "'Poppins', sans-serif", }}>
        <p style={{ textIndent: "30px" }}>
          <b>Граф Бурхард Христофор Миних</b> родился в Ольденбурге 9 мая 1683
          года. В 1700-1720 годах служил инженером во французской,
          гессен-дармштадтской, гессен-кассельской и польско-саксонской армиях.
          В Германии заслужил чин полковника, в Польше получил от Августа II чин
          генерал-майора.
        </p>
        <p style={{ textIndent: "30px" }}>
          В 1721 году приглашен в Россию вести инженерные дела, задуманные
          Петром I.
        </p>{" "}
        <p style={{ textIndent: "30px" }}>
          Участвовал в устройстве судоходства на Неве, прокладке дорог,
          строительству Балтийского порта, проведению Ладожского канала. В 1722
          году он был произведен в генерал-лейтенанты, в 1726 году, уже при
          Екатерине I — в генерал-аншефы, удостоен ордена святого Александра
          Невского, с 1728 года — граф, генерал-губернатор Ингерманландии,
          Карелии и Финляндии.
        </p>{" "}
        <p style={{ textIndent: "30px" }}>
          В 1730 году после восшествия на престол Анны Иоанновны, Христофор
          Миних был пожалован генерал-фельдцейхмейстером, президентом Военной
          коллегии, генерал-фельдмаршалом.
        </p>{" "}
        <p style={{ textIndent: "30px" }}>
          Миних образовал 2 новых гвардейских полка, провел переустройство
          гвардейских и армейских полков, преобразовал Военную коллегию, основал
          в Петербурге первый в России кадетский корпус, составил новые штаты
          для армии, ввел в армии корпус (12 полков) тяжелой конницы (кирасир),
          создал первые полки гусар, сравнял жалованье природных русских
          офицеров с приглашенными иностранными. Возглавлял русскую армию во
          время Польской кампании 1733-1734 годов.
        </p>{" "}
        <p style={{ textIndent: "30px" }}>
          Во время русско-турецкой войны 1735-1739 годов был назначен
          командующим русских войск. Организовал осаду Азова и Очакова, овладел
          Перекопом, проник в Крым, захватив столицу Крымского ханства
          Бахчисарай.
        </p>{" "}
        <p style={{ textIndent: "30px" }}>
          В ночь с 8 (19) на 9 (20) ноября 1721 года арестовал Бирона и
          провозгласил Анну Леопольдовну правительницей государства. Назначен
          первым кабинет-министром, но вскоре ушел в отставку.
        </p>{" "}
        <p style={{ textIndent: "30px" }}>
          После свержения Брауншвейгской династии и воцарения Елизаветы Петровны
          24-25 ноября (5-6 декабря) 1741 был сослан в Пелым (Тобольская
          провинция), где провел 20 лет.
        </p>{" "}
        <p style={{ textIndent: "30px" }}>
          В 1762 по указу Петра III освобожден и восстановлен во всех правах и
          званиях. Во время переворота 28 июня (9 июля) 1762 года оставался
          рядом с императором, однако затем присягнул Екатерине II.
        </p>{" "}
        <p style={{ textIndent: "30px" }}>
          Назначен командующим над главными балтийскими портами и над Ладожским
          каналом; в последующие годы занимался в основном устройством
          Рогервикской гавани. Умер 16 (27) октября 1767 года в Дерпте (совр.
          Тарту) в возрасте 84 лет.
        </p>
      </div>
    ),
  },
  {
    id: "Shuvalov",
    title: "Шувалов Петр Иванович ",
    content: (
      <div style={{ padding: "10px", fontSize: 20, textAlign: "justify",fontFamily: "'Poppins', sans-serif", }}>
        <p style={{ textIndent: "30px" }}>
          <b>ШУВА́ЛОВ Пётр Иванович</b>{" "}
          <i>[кон. 1711 или 1712 – 4(15).1.1762, С.-Петербург]</i>, граф (с
          1746), рос. гос. и воен. деятель, предприниматель, ген.-фельдмаршал
          (1761/62), дейст-вит. камергер (1741/42), ген.-адъютант (1748). Второй
          сын Ивана Максимовича Старшего, выборгского коменданта. Старший брат,
          Александр Иванович Шувалов, генерал-фельдмаршал, в течение многих лет
          возглавлял тайную канцелярию. Начал службу пажом имп. Екатерины I в
          1723. Камер-паж цесаревны Анны Петровны (1726–28). С 1731 камер-юнкер
          цесаревны Елизаветы Петровны, вхо-дил в её ближайшее окружение. Один
          из деятельных участников дворцового перево-рота 1741, приведшего её к
          власти. Сенатор (с 1744). С 1756 чл. Конференции при Высо-чайшем
          дворе, генерал-фельдцейхмейстер и нач. Оружейной канцелярии (1757–61).
          В дек. 1761/янв. 1762 – янв. 1762 гл. советник имп. Петра III.
        </p>{" "}
        <p style={{ textIndent: "30px" }}>
          С сер. 1740-х гг. один из гл. руководителей внутр. политики Рос.
          империи. Инициатор снижения подушной подати за счёт увеличения
          косвенных налогов (повышения цен на соль и вино; 1750), проведения
          таможенной реформы 1753–54, в ходе которой бы-ли упразднены внутр.
          таможни. В 1753 предложил широкую программу освоения Си-бири. В 1754
          по инициативе Ш. созданы Уложенная комиссия по составлению нового
          свода законов, Дворянский заёмный банк и Купеч. банк. С 1755
          «Государственный ме-жевщик» и гл. присутствующий в Гл. межевой
          канцелярии, руководил проведением т. н. Елизаветинского межевания. Под
          контролем Ш. находилась Петерб. монетная экспе-диция (1756–1761), т.
          н. Медный банк (с 1758), Арт. банк (с 1760). С 1757 по предложению Ш.
          начат широкий выпуск медных денег при уменьшении веса монет в 2 раза
          (что уд-ваивало прибыль гос. казны). В 1760 по проекту Ш. учреждена
          2-я Комиссия о коммерции.
        </p>{" "}
        <p style={{ textIndent: "30px" }}>
          В 1754 выдвинул проект создания первой воен. академии в России и
          представил док-ладную записку «О военной науке», в которой обобщил
          передовые для своего време-ни принципы воен. теории. После начала
          Семилетней войны 1756–63 сформировал в 1756–57 30-тысячный Обсервац.
          корпус, в 1757 спец. Понтонную роту, в 1760 особый Инж. полк. В 1757
          инициировал создание Комиссии о всех рос. крепостях, описавшую все
          рос. цитадели и улучшившую состояние некоторых из них. Под общим рук.
          Ш. раз-работано неск. образцов арт. орудий, в т. ч. полевая секретная
          гаубица, имевшая рас-ширявшийся к дульной части эллиптич. канал ствола
          для веерообразного разлёта картечи в горизонт (1753), единорог
          (1757–59). В 1758 по инициативе Ш. создана объе-динённая Арт. и инж.
          школа (с 1762 Арт. и инж. кадетский шляхетный корпус).
        </p>{" "}
        <p style={{ textIndent: "30px" }}>
          Крупный землевладелец. В 1748 получил монополию на сальные промыслы у
          Архан-гельска и Колы, Грунландские китоловные промыслы у о.
          Шпицберген, позднее на тю-леньи промыслы на Ладожском оз., а также на
          Каспийском м. (1751), рыболовные про-мыслы на Белом и Каспийском
          морях. Владел винокуренными заводами в нескольких губерниях, с 1754
          железоделательными Гороблагодатскими заводами на Урале. По-строил
          Верхний (пущен в 1755) и Нижний (пущен в 1756) Авзянопетровские
          (владел до 1758), Серебрянский (пущен в 1755), Воткинский (пущен в
          1759) заводы, в 1760 начал строительство Ижевского завода. С 1756
          держал табачный откуп.
        </p>{" "}
        <p style={{ textIndent: "30px" }}>
          Награждён орденами Св. Александра Невского (1742), Св. Андрея
          Первозванного (1753) и др. Пётр Иванович похоронен на Лазаревском
          кладбище Александро-Невской лавры.
        </p>
      </div>
    ),
  },
  {
    id: "Vilboa",
    title: "Вильбоа Александр Никитич",
    content: (
      <div style={{ padding: "10px", fontSize: 20, textAlign: "justify",fontFamily: "'Poppins', sans-serif", }}>
        <p style={{ textIndent: "30px" }}>
          <b>ВИЛЬБОА (фр. AlexanderGuillemotdeVillebois) Александр Никитич</b>{" "}
          <i>
            [1716 – 29.01(09.02).1781, пом. Сарракус близ Дерпта, Лифляндия]
          </i>
          , российский военный деятель, генерал-поручик (1758).
        </p>{" "}
        <p style={{ textIndent: "30px" }}>
          Происходил из семьи, имевшей старинные французские корни. Младший сын
          главного командира Кронштадтского порта вице-адмирала Н.П. Вильбоа,
          принятого на русскую службу Петром I в 1697 г. В августе 1739 г.
          поступил на военную службу и был зачислен в лейб-гвардии бомбардирскую
          роту сержантом. В 1741 г. произведен в подпоручики. С 1742 г.
          участвовал в Русско-шведской войне 1741–1743 гг. В 1744 г. был
          пожалован в камер-юнкеры ко двору императрицы Елизавета Петровны с
          чином полковника. В 1755 г. его жалуют чином генерал-майора. С 1756 г.
          занимал должность генерал-квартирмейстера Лифляндской дивизии.
          Участник Семилетней войны 1756–1763 гг. Отличился в сражении при
          Гросс-Егерсдорфе, в ходе которой командовал пехотной бригадой 2-й
          дивизии. Получил тяжелое ранение в голову. За отличие пожалован
          орденом Св. Александра Невского. В январе 1758 г. произведен в
          генерал-поручики.
        </p>{" "}
        <p style={{ textIndent: "30px" }}>
          После выздоровления участвовал в осаде Кюстрина, в сражении при
          Пальциге. В Кунерсдорфском сражении командовал авангардом русской
          армии. После возвращения действующей армии в Россию в январе 1762 г.
          его именем был назван Великолуцкий пехотный полк. В феврале того же
          года его назначают генерал-фельдцейхмейстером, а в марте – членом
          Военной коллегии. Участвовал в перевороте 28 июня (9 июля) 1762 г.
          После свержения Петра III поддержал на престоле Екатерину II, резко
          выступив против проекта Н.П. Панина об ограничении власти императрицы.
          По свидетельству современников, обилие и объём резолюций, которыми он
          снабжал поступавшие к нему документы по всем четырем вверенным ему,
          как генерал-фельдцейхмейстеру, ведомствам: артиллерийскому,
          инженерному, оружейному и кадетских корпусов, поразительны. Многие из
          них содержат «целые инструкции и положения, в большинстве крайне
          полезные и полно разрешающие все затруднения». Деятельность Вильбоа на
          посту генерал-фельдцехмейстера обещала быть очень полезной, однако в
          1765 г. он был вынужден просить об отставке по состоянию здоровья:
          сказались последствия тяжёлого ранения. Находясь не у дел, Вильбоа
          поселился в своем поместье Сарракус в Лифляндии. В качестве депутата
          от Лифляндской губернии с 1767 г. принимал участие в работе Уложенной
          комиссии. Умер в 1781 г. в своем поместье, где и был захоронен.
        </p>{" "}
        <p style={{ textIndent: "30px" }}>
          Награжден орденами: Св. Андрея Первозванного, Св. Александра Невского,
          Св. Анны.
        </p>
      </div>
    ),
  },
  {
    id: "Orlov",
    title: "Орлов Григорий Григорьевич",
    content: (
      <div style={{ padding: "10px", fontSize: 20, textAlign: "justify",fontFamily: "'Poppins', sans-serif", }}>
        <p style={{ textIndent: "30px" }}>
          <b>Орлов Григорий Григорьевич</b> - второй сын новгородского
          губернатора Григория Ивановича Орлова (1685—1746) и его жены Лукерьи
          Ивановны Зиновьевой.
        </p>{" "}
        <p style={{ textIndent: "30px" }}>
          Родился 6 (17) октября 1734 года в родовой усадьбе Орловых в селе
          Люткино. Детство его прошло в Москве. Начальное образование получил
          дома. В 1749 году, 15-летним, записан в лейб-гвардии Семёновский полк
          рядовым. В 1757 году переведён офицером в армию и принял участие в
          Семилетней войне. В сражении при Цорндорфе получил три ранения, но не
          покинул поле боя. Это сделало его весьма популярным в офицерской
          среде. В 1759 году переведён на службу в столицу в один из
          артиллерийских полков.
        </p>{" "}
        <p style={{ textIndent: "30px" }}>
          В 1760 году Григорий Григорьевич Орлов обратил на себя внимание
          генерал-фельдцейхмейстера графа П. И. Шувалова, который взял его к
          себе адъютантом. Рослый, статный и красивый, склонный к кутежам и
          смелым, рискованным похождениям, Орлов скоро составил себе в
          Санкт-Петербурге репутацию донжуана. Роман его с княгиней Куракиной,
          возлюбленной графа Шувалова, повлёк за собой отчисление от должности
          адъютанта и перевод в фузилёрный гренадерский полк, что только
          увеличило популярность Орлова в петербургском обществе. Им
          заинтересовалась царевна Екатерина Алексеевна (будущая императрица
          Екатерина II), супруга Петра III, и пожелала с ним познакомиться.
          Смелый, решительный характер Орлова привлёк симпатии царевны, которая
          и доверила ему свою судьбу. При её содействии Орлов, только что
          произведённый в капитаны, был назначен 23 февраля (6 марта) 1762 года
          цалмейстером (казначеем) Канцелярии главной артиллерии и фортификации,
          что оказало существенную помощь дворцовому перевороту в 1762 году, так
          как ставило его вне подозрений о близости к императрице и в то же
          время давало ему возможность располагать денежными средствами, нужными
          для пропаганды задуманного переворота.
        </p>{" "}
        <p style={{ textIndent: "30px" }}>
          Успех последнего вознёс Орлова на вершину почестей и влияния. В день
          восшествия Екатерины II на престол, 28 июня (9 июля) 1762 года,
          артиллерии капитан Григорий Орлов был произведён в генерал-майоры. В
          тот же день ему было пожалованы звание действительного камергера,
          орден Св. Александра Невского и шпага, богато украшенная бриллиантами.
        </p>{" "}
        <p style={{ textIndent: "30px" }}>
          В день своей коронации, 22 сентября (3 октября) 1762 года, императрица
          Екатерина II произвела генерал-майора Григория Григорьевича Орлова в
          генерал-поручики и назначила своим генерал-адъютантом. Кроме того,
          именным Высочайшим указом от 22 сентября (3 октября) 1762 года
          камергер Иван, генерал-поручик Григорий, гвардии майор Алексей,
          камер-юнкеры Фёдор и Владимир Григорьевичи Орловы возведены, с
          нисходящим их потомством, в графское Российской империи достоинство.
        </p>{" "}
        <p style={{ textIndent: "30px" }}>
          Грамотой римского императора Франца I от 10 (21) июня 1763 года
          действительный камергер, генерал-адъютант, генерал-поручик, граф
          Российской империи Григорий Григорьевич Орлов возведён, с нисходящим
          его потомством, в княжеское Римской империи достоинство, с титулом
          светлости.
        </p>{" "}
        <p style={{ textIndent: "30px" }}>
          22 июля (2 августа) 1763 года Высочайшим указом императрицы Екатерины
          II была учреждена Канцелярия Опекунства иностранных, и Орлов назначен
          её президентом, коим он и оставался до самой своей смерти. 25 марта (5
          апреля) 1764 года назначен лейб-гвардии Конного полка подполковником в
          чине генерал-поручика, 30 декабря 1764 (10 января 1765) года
          произведён в генерал-аншефы.25 марта (5 апреля) 1765 года назначен
          шефом Кавалергардского корпуса.
        </p>{" "}
        <p style={{ textIndent: "30px" }}>
          11 (22) мая 1765 года Орлов назначен генерал-фельдцейхмейстером по
          Артиллерийскому корпусу и генерал-директором по Инженерному корпусу, а
          ещё через некоторое время стал первоприсутствующим в Канцелярии
          главной артиллерии и фортификации. Влияние Орлова особенно усилилось
          после раскрытия хитровского заговора, имевшего целью вырезать всю
          семью Орловых. Одно время императрица думала о бракосочетании со своим
          фаворитом, но план её вызвал большое сопротивление в обществе, в
          результате чего бракосочетание не состоялось. Григорий Орлов не был
          выдающимся государственным деятелем. Скорее всего императрица смотрела
          на него как на податливый материал, который должен был поступать так,
          как ей нужно. На все государственные должности Орлов был назначен не
          по своей воле, но он обладал определённым темпераментом, авантюризмом
          и находчивостью, имел довольно точную оценку текущих событий и был
          полезным и сочувствующим консультантом во время раннего периода
          правления Екатерины II. Как президент Вольного экономического
          общества, он был также его самым видным защитником в великой комиссии
          1767 года, хотя и нацеливался прежде всего на то, чтобы угодить
          императрице. 21 сентября (2 октября) 1771 года Григорий Орлов был
          послан в Москву «с полною мочию» для прекращения эпидемии чумы,
          уносившей до тысячи человек в день, и действительно принял вполне
          разумные по тем временам меры для прекращения эпидемии. В частности,
          он установил денежное вознаграждение выписываемым из больниц (женатым
          — по 10 рублей, холостым — по 5 рублей), что стало более действенной
          мерой против утаивания больных, чем самые строгие приказы.
        </p>
        <p style={{ textIndent: "30px" }}>
          По возвращении из Москвы императрица удостоила его изъявлением своей
          благодарности и, в память его подвигов, вручила ему именную медаль «За
          избавление Москвы от язвы в 1771 году» вначале с надписью «такового
          сына Россия имеет», впоследствии отчеканена ещё одна именная медаль с
          надписью «Россия таковых сынов в себе имеет», а также воздвигла в
          Царском Селе ворота с надписью «Орловым от бед избавлена Москва».
        </p>{" "}
        <p style={{ textIndent: "30px" }}>
          Орлов был одним из самых ранних пропагандистов идеи славянофильской
          эмансипации христиан против османского ига. В 1772 году Орлов был
          послан на мирный конгресс в Фокшаны (с 27.VII по 28.VIII) как первый
          российский полномочный представитель, где он потерпел неудачу в своей
          миссии, отчасти из-за упрямства османов, а отчасти (согласно Панину)
          по вине собственного буйного нрава. После возвращения Григория Орлова
          без разрешения в Санкт-Петербург его заменили младшим братом —
          Алексеем Орловым.
        </p>{" "}
        <p style={{ textIndent: "30px" }}>
          27 сентября (8 октября) 1772 года уволен на год за границу для
          поправления здоровья с полным жалованием, какое он в то время получал.
        </p>{" "}
        <p style={{ textIndent: "30px" }}>
          4 (15) октября 1772 года императрица дозволила ему принять от римского
          императора присланный ему на княжеское достоинство Римской империи
          диплом, соизволяя ему именоваться навсегда Римской империи светлейшим
          князем.
        </p>{" "}
        <p style={{ textIndent: "30px" }}>
          23 мая (3 июня) 1773 года в Указе Её Императорского Величества
          сказано: «Её Императорское Величество к удовольствию своему видя, что
          генерал-фельдцейхмейстера графа Орлова состояние здоровья поправилось,
          и желая всегда к пользе Империи употребить его природные отменные
          дарования, ревность и усердие к Её Императорскому Величеству и
          отечеству, именным Своим Высочайшим Указом, данным ему,
          генерал-фельдцейхмейстеру, объявить изволила, что Её Императорского
          Величества желание есть, чтобы он, господин генерал-фельдцейхмейстер и
          кавалер вступил паки в отправление дел, Её Императорским Величеством
          порученных».
        </p>{" "}
        <p style={{ textIndent: "30px" }}>
          15 (26) октября 1774 года уволен на 2 года за границу для излечения
          болезни. 25 апреля (6 мая) 1780 года уволен снова на 2 года за
          границу.
        </p>
        <p style={{ textIndent: "30px" }}>
          5 (16) июня 1777 года 43-летний Григорий Орлов женился на своей
          18-летней двоюродной сестре Екатерине Зиновьевой, но брак не был
          долгим. Супруга скончалась в Лозанне в июне 1781 года в возрасте 22
          лет от чахотки, после чего Орлов тронулся рассудком и впал в детство.
        </p>{" "}
        <p style={{ textIndent: "30px" }}>
          Скончался Орлов в своём имении Нескучное под Москвой в ночь на 13 (24)
          апреля 1783 года, торжественные похороны состоялись 17 апреля.
          Отпевали Григория Орлова архиепископ Платон и крутицкий епископ
          Амвросий. Из дома гроб вынесли четверо братьев Орловых в сопровождении
          многих знатных лиц. Гроб с телом князя Орлова хотели было положить на
          парадный одр, но офицеры-конногвардейцы выпросили разрешение донести
          гроб своего любимого командира до места его последнего пристанища.
        </p>{" "}
        <p style={{ textIndent: "30px" }}>
          В популярной литературе встречается информация о том, что останки всех
          Орловых были сожжены большевиками в Отраде в 1924 году. Хотя Отрада
          действительно была уничтожена в 1924 году, гроб с телом Григория
          Орлова ещё в 1832 году был перенесён в новгородский Юрьев монастырь и
          захоронен на северной стороне Георгиевского собора у западной стены
          рядом с братьями Алексеем и Фёдором.
        </p>{" "}
        <p style={{ textIndent: "30px" }}>
          По другим данным, прах выдающегося сподвижника императрицы Екатерины
          II находился в монастыре лишь около 60-ти лет, а в 1896 году, в
          столетнюю годовщину со дня кончины императрицы, его правнук А. В.
          Орлов-Давыдов получил высочайшее дозволение перевезти останки в
          родовое имение «Отрада» на место прежнего упокоения. Торжественная
          церемония перезахоронения состоялась 24 февраля 1896 года. В 1924 году
          захоронение Орловых подверглось разграблению, а их останки были
          уничтожены.
        </p>
      </div>
    ),
  },
  {
    id: "Meller",
    title: "Меллер-Закомельский Иван Иванович",
    content: (
      <div style={{ padding: "10px", fontSize: 20, textAlign: "justify",fontFamily: "'Poppins', sans-serif", }}>
        <p style={{ textIndent: "30px" }}>
          <b>Меллер-Закомельский Иван Иванович</b> происходил из семьи Меллер —
          «немецкой нации мещан лютеранского закона». Службу начал в артиллерии
          канониром в 1739 году. В 1752 произведён в офицеры.
        </p>{" "}
        <p style={{ textIndent: "30px" }}>
          В 1759 году в чине подполковника принял участие в Семилетней войне и в
          1762 за отличие при взятии Кольберга произведён в полковники, 22
          сентября (3 октября) 1764 — в артиллерии генерал-майоры, а 21 апреля
          (2 мая) 1773 — в артиллерии генерал-поручики.
        </p>{" "}
        <p style={{ textIndent: "30px" }}>
          Назначенный в 1772 присутствовать в Канцелярии главной артиллерии и
          фортификации, скоро занял в ней первенствующее положение, а в 1783,
          после смерти светлейшего князя Григория Григорьевича Орлова, стал
          исполнять обязанности генерал-фельдцейхмейстера Артиллерийского
          корпуса с производством (24 ноября (5 декабря) 1783) в чин артиллерии
          генерал-аншефа. С началом 2-й турецкой войны (1787—1791) был вызван
          Потёмкиным в Екатеринославскую армию, и по его плану велись осада и
          штурм Очакова. Награждён за взятие этой крепости орденами Святого
          Андрея Первозванного и Святого Георгия 2 класса (16 (27) декабря
          1788).
        </p>{" "}
        <p style={{ textIndent: "30px" }}>
          В кампанию 1790 года он был поставлен во главе отдельного корпуса,
          назначенного для взятия крепости Килии, при штурме которой Иван
          Иванович Меллер-Закомельский был смертельно ранен и через 4 дня умер.
        </p>
      </div>
    ),
  },
  {
    id: "Potemkin",
    title: "Потёмкин Григорий Александрович",
    content: (
      <div style={{ padding: "10px", fontSize: 20, textAlign: "justify",fontFamily: "'Poppins', sans-serif", }}>
        <p style={{ textIndent: "30px" }}>
          <b>ПОТЁМКИН Григорий Александрович </b>
          <i>
            [13(24).09.1739, с. Чижово Смоленской губ., – 05(16).10.1791, р-н г.
            Яссы, Молдавское княжество]
          </i>
          , российский государственный и военный деятель, граф, светлейший князь
          (1776), генерал-фельдмаршал (1784).
        </p>{" "}
        <p style={{ textIndent: "30px" }}>
          Родился в семье среднепоместного смоленского дворянина. В 1754 – 1755
          гг. обучался в закрытом учебном заведении Иоганна Литке в Москве, а
          затем в гимназии при Московском университете. На военной службе с 1760
          г., капрал лейб-гвардии Конного полка, с 1761 г. вице-вахмистр,
          ординарец принца Георга Людвига Голштинского. Участник переворота
          26.06(07.07.).1762 г., в результате которого была возведена на
          российский престол жена Петра III Екатерина Алексеевна. После
          переворота пожалован в подпоручики и камер-юнкеры. С 1765 г. в чине
          поручика занимал должность казначея, в то же время ревностно изучал
          строевую службу и манежную езду. В 1766 г. назначен командиром роты в
          лейб-гвардии Конном полку. В 1767 г. участвовал в работе Уложенной
          комиссии в целях создания нового свода законов на основе Соборного
          уложения 1649 г.; состоял в комиссии по определению статуса
          иноверческих народов. Состоял также членом духовной крестьянской
          комиссии, где поддерживал идею освобождения крестьян. С 1768 г.
          действительный камергер. В 1769 г. добровольно отправился на
          Русско-турецкую войну 1768 – 1774 гг., отличился в боях под Хотином. В
          1769 г. произведен в чин генерал-майора. Под знамёнами П.А. Румянцева
          в 1770 г. участвовал в разгроме турецких войск под Фокшанами и
          Браиловом, находился при взятии крепости Журжа на Дунае, в сражениях
          при Рябой Могиле, Ларге и Кагуле, во взятии Измаила. Кавалерийский
          отряд под его командованием успешно действовал против османской
          конницы на Дунае, осаждал крепости, блокировал деятельность
          неприятельской флотилии.
        </p>{" "}
        <p style={{ textIndent: "30px" }}>
          Боевые успехи и личные качества Потемкина привлекли к нему внимание
          Екатерины II. В 1774 г. он стал её фаворитом, назначен
          вице-президентом Военной коллегии, членом Государственного совета,
          командующим лёгкой конницей и шефом иррегулярных войск Российской
          империи. Одновременно он стал подполковником лейб-гвардии
          Преображенского полка, где полковником была императрица. В дальнейшем
          проявил себя талантливым администратором и организатором строительства
          армии и флота. Занимался вопросами экономической жизни России,
          усиления её международных позиций; всемерно помогал императрице в
          проведении политики укрепления абсолютистского государства. В 1775 г.
          ликвидировал Запорожскую Сечь как постоянный очаг
          антиправительственных выступлений. С 1776 г. – генерал-губернатор
          Новороссийской, Азовской и Астраханской губерний. В 1783 г. реализовал
          свой проект присоединения Крыма к России. Много сделал для
          хозяйственного освоения и развития Причерноморья, строительства
          городов Херсон, Николаев, Севастополь и Екатеринослав
          (Днепропетровск). Под его руководством осуществлялось строительство
          торгового флота на Чёрном море, был создан военный Черноморский флот,
          что в значительной степени обезопасило южную и юго-западную границы
          России на суше и море. С 1784 г. таврический и екатеринославский
          генерал-губернатор.
        </p>{" "}
        <p style={{ textIndent: "30px" }}>
          В 1784 г. назначен президентом Военной коллегии. На этом посту провёл
          ряд преобразований. Все полки армии по новому уставу получили точную
          роспись расходов. Были внесены существенные изменения в экипировку
          военнослужащих: обмундирование и обувь стали больше отвечать
          требованиям боевой и походной жизни, улучшился их внешний вид.
          Усилились требования к санитарному состоянию войск, приняты меры по
          устройству быта отставных солдат. Внёс серьёзные изменения в уставы,
          регламентирующие полевую и гарнизонную службы, организацию обучения
          солдат; увеличил численность пехоты, кавалерии, вдвое - количество
          донских казачьих частей; сформировал новые драгунские, гренадерские
          мушкетёрские полки и егерские батальоны. Выступал сторонником
          сознательного отношения военнослужащих к воинскому долгу, при
          сохранении строгой дисциплины. С началом Русско-турецкой войны 1787 –
          1791 гг. возглавил 1-ю Екатеринославскую армию, с осени 1789 г. –
          главнокомандующий объединенной Южной армией. В этот период усилил
          Черноморскую эскадру, егерским и гренадерским полкам придал
          артиллерию, сформировал подвижные и осадные артиллерийские парки. В
          1790 – 1791 гг. Южная армия под его командованием одержала ряд крупных
          побед, в т.ч. при Фокшанах, Рымнике, под Измаилом и в Керченском
          сражении 1790 г. В 1790 г. назначен великим гетманом
          Екатеринославского и Черноморского казачьих войск. В конце июля 1791
          г. Потемкин выехал из Петербурга в Крымскую армию. В Яссах тяжело
          заболел малярией и скончался по дороге в Николаев. Был похоронен в
          Херсоне. В 1836 г. ему был воздвигнут памятник (в 1927 снесён).
        </p>{" "}
        <p style={{ textIndent: "30px" }}>
          Награждён орденами: российскими – Св. Андрея Первозванного, Св.
          Владимира 1-й ст., Св. Александра Невского, Св. Георгия 1-й, 2-й и 3-й
          ст., Св. Александра Невского, Св. Анны 1-й ст.; иностранными орденами:
          датским – Слона, польскими – Белого Орла и Св. Станислава, прусским –
          Черного орла, шведским – Серафимов; золотой шпагой с алмазами.
        </p>
      </div>
    ),
  },
  {
    id: "MikhailPavlovich",
    title: "Великий князь Михаил Павлович",
    content: (
      <div style={{ padding: "10px", fontSize: 20, textAlign: "justify",fontFamily: "'Poppins', sans-serif", }}>
        <p style={{ textIndent: "30px" }}>
          <b>Великий князь Михаил Павлович</b> родился пополуночи в половине 4го
          часа утра 28 января (8 февраля) 1798 года в Зимнем дворце,
          Санкт-Петербург, и был десятым, последним ребёнком и четвёртым,
          младшим сыном императора Павла I и его жены императрицы Марии
          Фёдоровны.
        </p>
        <p style={{ textIndent: "30px" }}>
          В этот день в Камер-фурьерском журнале была сделана <b>запись:</b>
          <p
            style={{
              textIndent: "0px",
              paddingLeft: "50px",
              paddingRight: "50px",
            }}
          >
            <i>
              "Январь 28е, четверг. Пополуночи в половине 4го часа утра Её
              императорское величество благополучно разрешилась от бремени
              рождённым государем великим князем. В три четверти того же часа
              позван во внутренние комнаты духовник Его величества, который
              давал молитву и наречено высоконоворждённому великому князю имя
              Михаил,"
            </i>
          </p>
          <p style={{ textIndent: "30px" }}>
            а в газете «СанктПетербургскiя Вѣдомости» от 29 января 1798 г.
            опубликовано <b>сообщение:</b>
          </p>
          <p
            style={{
              textIndent: "0px",
              paddingLeft: "50px",
              paddingRight: "50px",
            }}
          >
            <i>
              "Сего Генваря 28 го въ три часа с половиною пополуночи, ко
              всеобщей радости, разрѣшилась благополучно отъ бремени ЕЯ
              ИМЕРАТОРСКОЕ ВЕЛИЧЕСТВО, приумноживъ Императорскую Фимилiю
              Великимъ Княземъ, нареченнымъ на молитвѣ МИХАИЛОМЪ ПАВЛОВИЧЕМЪ."
            </i>
          </p>
        </p>
        <p style={{ textIndent: "30px" }}>
          В подённых придворных записях было отмечено: «Благополучное разрешение
          от бремени сыном Михаилом возвещено 201 выстрелом ко всеобщей
          радости». Имя новорожденному было выбрано ещё до его появления на
          свет. Графиня В. Н. Головина вспоминала: «Ходила молва, будто с
          первого дня царствования государя часовому Летнего дворца было видение
          Архангела Михаила… При первом известии о чудесном видении часовому
          император Павел дал обет — в случае, если у него будет ещё сын,
          назвать его Михаилом…». После его рождения начались различные толки:
          спрашивали, не будет ли новорожденный, как сын царствующего государя,
          иметь предпочтительное право на престол, поскольку его старшие братья
          родились тогда, когда Павел был великим князем. Павел I решил, что
          крещение и крестины должны сопровождаться таким торжественным
          церемониалом, который бы показал всем, и в том числе цесаревичу
          Александру, разницу, существующую между сыном императора и сыном
          наследника престола. Восприемниками ребёнка от купели были: его
          старший брат, великий князь Александр Павлович, и старшая сестра,
          великая княжна Александра Павловна, представлявшая их бабушку,
          герцогиню Фредерику-Софию Вюртембергскую.
        </p>
        <p
          style={{
            textIndent: "140px",
            fontWeight: "bold",
            paddingTop: "3px",
            paddingBottom: "6px",
            fontSize: "25px",
          }}
        >
          Описание крещения и крестин
        </p>{" "}
        <p style={{ textIndent: "30px" }}>
          Император Александр I успевал лишь изредка навещать младших братьев и
          мало входил в дело их обучения. Установившаяся система их воспитания
          была сурова; телесные наказания играли в ней не последнюю роль;
          главный воспитатель, генерал Ламсдорф являлся наставником
          требовательным и строгим. С малых лет Михаил, также как и его старший
          брат Николай, проявили исключительную склонность ко всему военному; у
          них были целые арсеналы военных игрушек. В 1814 г. император Александр
          впервые разрешил братьям прибыть к армии, находившейся во Франции, и
          на Высочайшем смотру в Вертю (29 августа 1815 г.)
        </p>{" "}
        <p style={{ textIndent: "50px" }}>
          Михаил Павлович в первый раз командовал воинской частью
          (конно-артиллерийской бригадой).
        </p>{" "}
        <p style={{ textIndent: "30px" }}>
          С августа 1817 г. по июнь 1819 г. Михаил Павлович совершил
          образовательную поездку сначала по России, затем по Западной Европе,
          под руководством И. Ф. Паскевича. Однако Паскевич оказался бессильным
          в борьбе со склонностью Михаила Павловича к «экзерцирмейстерству»:
          «Его занимали, — пишет Паскевич, — одни только выправки и красота
          фронта».
        </p>
        <p style={{ textIndent: "30px" }}>
          Вскоре по возвращении из заграничного путешествия Михаил Павлович был
          назначен командиром 1-й бригады 1-й гвардейской пехотной дивизии и
          шефом лейб-гвардии Московского полка.
        </p>{" "}
        <p style={{ textIndent: "30px" }}>
          Облеченный званием генерал-фельдцейхмейстера со дня рождения, Михаил
          Павлович фактически вступил в управление артиллерийским ведомством в
          1819 г.; при нём был произведен в этой части целый ряд преобразований
          и улучшений. По докладу Михаила Павловича в 1820 г. было открыто
          первое в России артиллерийское училище.
        </p>{" "}
        <p style={{ textIndent: "30px" }}>
          Михаил Павлович участвовал в подавлении восстания декабристов 14
          декабря 1825 года. Известие о кончине Александра I застало его в
          Варшаве; на другой же день он выехал в Петербург с письмом от
          Константина Павловича об отречении последнего от прав на престол.
          Прибыв в Петербург и узнав, что там принесена уже присяга на
          верноподданство Константину, Михаил Павлович поспешил опять в Варшаву
          для убеждения Константина Павловича приехать в столицу, но безуспешно.
          Прибыв вновь в Петербург утром 14 декабря 1825 года и получив
          сведение, что принесение присяги Николаю Павловичу чинами гвардейской
          конной артиллерии сопровождалось некоторым замешательством, Михаил
          Павлович решил своим личным присутствием в артиллерийских казармах
          восстановить порядок; затем, получив донесение о возмущении
          Московского полка, как шеф его, поспешил в казармы и, собрав людей, не
          принимавших участие в восстании, привел их на Сенатскую площадь, где
          императором Николаем была вверена его начальству часть войск,
          собранных между Исаакиевским собором и Конногвардейским манежем,
          против стоявших тут же восставших рот Гвардейского экипажа.
        </p>{" "}
        <p style={{ textIndent: "30px" }}>
          Позже, как член Следственной комиссии по делу декабристов, великий
          князь Михаил Павлович настоял на замене смертной казни вечной каторгой
          Вильгельму Кюхельбекеру, поэту и другу Пушкина, который обвинялся в
          том, что стрелял в Михаила Павловича.
        </p>{" "}
        <p style={{ textIndent: "30px" }}>
          Сразу после восстания декабристов Михаил Павлович был назначен
          генерал-инспектором по инженерной части, членом Государственного
          Совета, а в 1826 году он был назначен командиром Гвардейского корпуса.
        </p>{" "}
        <p style={{ textIndent: "30px" }}>
          В 1826—1828 годах во главе Гвардейского корпуса участвовал в
          русско-турецкой войне. Награждённый после победы под Браиловом орденом
          Святого Георгия II степени, отказался надеть его, посчитав, что достиг
          успеха слишком дорогой ценой. Николай I удостоил брата шпагой с
          надписью «За храбрость» с лаврами и алмазными украшениями.
        </p>{" "}
        <p style={{ textIndent: "30px" }}>
          В 1830—1831 годах во главе Гвардейского корпуса участвовал в
          подавлении Польского восстания. В том же 1831 году получил свитское
          звание генерал-адъютанта за штурм Варшавы.
        </p>{" "}
        <p style={{ textIndent: "30px" }}>
          С 1831 года являлся главным начальником Пажеского и всех сухопутных
          кадетских корпусов, Дворянского полка. При его участии было основано
          около 14 кадетских корпусов.
        </p>{" "}
        <p style={{ textIndent: "30px" }}>
          Председательствовал в Комитете о составлении устава воинской пехотной
          службы. По предложению великого князя Михаила Павловича в Царском Селе
          организовали Офицерскую школу для подготовки инструкторов по
          стрелковому делу для армейских и гвардейских частей.
        </p>{" "}
        <p style={{ textIndent: "30px" }}>
          Свою военную карьеру он закончил в должности главнокомандующего
          гвардейским и гренадерским корпусами (с 1844 года). Нельзя недооценить
          вклад великого князя Михаила Павловича в развитие военного, а особенно
          артиллерийского дела в России.{" "}
          <b>Князь Чернышёв (военный министр) писал:</b>
          <p style={{ textIndent: "0px", paddingLeft: "50px" }}>
            <i>
              "Ни одна часть военно-сухопутного управления не подвергалась
              большим преобразованиям, как артиллерийское ведомство. Почти все
              новые заграничные изобретения по усовершенствованию вооружения
              войск и артиллерии, были у нас, в течение 25-ти лет, испытываемы,
              применяемы к нашим войскам и постепенно вводимы, с необходимыми
              изменениями и улучшениями."
            </i>
          </p>
        </p>{" "}
        <p style={{ textIndent: "30px" }}>
          В то же время командир корпуса жандармов и управляющий III отделением
          Собственной Его императорского величества канцелярии Дубельт высказал
          совершенно <b>противоположное суждение:</b>
        </p>{" "}
        <p style={{ paddingLeft: "50px" }}>
          <i>
            "Воля ваша, а этот человек беда России. Своим фронтом он сбил с
            толку и Государя. — Генерал-фельдцейхмейстер, генерал-инспектор по
            инженерной части, он не думает ни об укреплении границ государства,
            ни об улучшении оружия; отказывает приезжающим к нам иностранцам с
            предложением новой системы ружей и оставляет армию, вместо ружья, с
            палками! Он раз даже выразился, что война портит солдата и, по его
            разумению, достоинство войска состоит только в блистательных
            парадах. В этой слепоте он умел внушить доброму Государю, что мы-де
            забросаем всех шапками!"
          </i>
        </p>
        <p
          style={{
            textIndent: "50px",
            fontSize: "25px",
            paddingLeft: "80px",
            paddingTop: "12px",
            paddingBottom: "12px",
          }}
        >
          <b>Общественная деятельность</b>
        </p>
        <p style={{ textIndent: "30px" }}>
          Великий князь Михаил Павлович никогда не играл серьёзной роли в
          государственных делах. Его супругу (Елену Павловну) всегда раздражало
          пассивное устранение мужа от государственных дел, его роль первого
          слуги своего царственного брата.{" "}
        </p>
        <p style={{ paddingLeft: "50px" }}>
          <i>
            •C 1825 года Михаил Павлович являлся членом Государственного совета.
            <br /> •С 1834 года — сенатор.
            <br /> •В 1832 году стал почётным президентом Императорской военной
            академии.
          </i>
        </p>{" "}
        <p
          style={{
            textIndent: "50px",
            fontSize: "25px",
            paddingLeft: "70px",
            paddingTop: "12px",
            paddingBottom: "12px",
          }}
        >
          <b>Благотворительная деятельность</b>{" "}
        </p>
        <p style={{ textIndent: "30px" }}>
          Занимался великий князь Михаил Павлович и благотворительностью. Но она
          носила больше личную направленность.
        </p>{" "}
        <p style={{ textIndent: "30px" }}>
          Ф. Гагерн, сопровождавший нидерландского принца Александра, племянника
          Михаила Павловича, в путешествии по России, писал в своём дневнике:
          «Внешность его непривлекательна; в нём есть что-то мрачное и суровое,
          но в сущности его можно назвать „мрачный благотворитель“; о нём
          рассказывают случаи, где он проявил прекрасные черты великодушия».
        </p>
        <p style={{ textIndent: "30px" }}>
          Например, по свидетельству его адъютанта И. И. Бибикова, у одного из
          гвардейских полковников обнаружилась недостача в средствах, которые он
          истратил на свои нужды. Перед инспекторской проверкой эту сумму
          требовалось срочно внести в полковую кассу, чтобы избежать обвинения в
          растрате. Полковник, не видя выхода из сложившейся ситуации, бросился
          в Михайловский дворец и рассказал всё адъютанту. Не называя фамилии,
          Бибиков рассказал всё великому князю. Выслушав рассказ, Михаил
          Павлович подошёл к письменному столу, вынул необходимую сумму и,
          передав её адъютанту, сказал: «Отдай ему и не смей мне никогда
          называть его фамилию, иначе, как командир корпуса, я отдам его под
          суд. Скажи, что я помогаю ему как великий князь и как частный
          человек».
        </p>{" "}
        <p style={{ textIndent: "30px" }}>
          Щедрость Михаила Павловича доходила порой до таких размеров, что
          гофмейстер его двора вынужден был не раз отказывать великому князю в
          выдаче сумм на благотворительность, чтобы привести кассу в порядок. В
          конце января 1848 года праздновалось пятидесятилетие великого князя
          Михаила Павловича. Военные инженеры и артиллеристы собрали около 18
          000 рублей для сооружения бюста своего шефа. Бюст был вылеплен
          известным скульптором И. П. Витали, потом из бронзы его отлил бывший
          воспитанник Артиллерийского училища барон П. К. Клодт. От сооружения
          бюста, который установили в конференц-зале Артиллерийского училища,
          осталось неизрасходованными 8000 рублей. К этой сумме Михаил Павлович
          добавил ещё 3 000, чтобы этот капитал положить в банк и на проценты с
          него (с добавлениями ежегодной значительной суммы, которую жертвовал
          великий князь) назначить пособие для воспитания в Мариинском институте
          пяти дочерей «недостаточных» и заслуженных артиллеристов,
          преимущественно сирот.
        </p>{" "}
        <p
          style={{
            textIndent: "50px",
            fontSize: "25px",
            paddingLeft: "120px",
            paddingTop: "10px",
            paddingBottom: "10px",
          }}
        >
          <b>Михайловский дворец</b>
        </p>{" "}
        <p style={{ textIndent: "30px" }}>
          Ещё при рождении Михаила Павловича император Павел приказал
          откладывать деньги на строительство дворца, достойного порфирородного
          сына. Но сам завершить его не успел. Дворец стал подарком Александра I
          младшему из своих братьев. Дворец назвали в честь князя Михайловским.
          Это великолепное здание и по сей день является одним из лучших
          украшений Санкт-Петербурга. Для его строительства был приглашен
          знаменитый архитектор Карл Росси. Возведение огромного здания заняло
          всего шесть лет, с 1819 по 1825 годы. Наследники Михаила Павловича
          продали дворец в казну. В настоящее время дворец принадлежит
          Государственному Русскому музею.
        </p>{" "}
        <p
          style={{
            textIndent: "50px",
            fontSize: "25px",
            paddingLeft: "225px",
            paddingTop: "5px",
            paddingBottom: "8px",
          }}
        >
          <b>Брак</b>{" "}
        </p>
        <p style={{ textIndent: "30px" }}>
          В отличие от старших братьев, женившихся в ранней молодости, великий
          князь Михаил Павлович оставался холостяком до двадцати шести лет.
          Невесту для младшего сына императрица Мария Фёдоровна нашла в родном
          ей Вюртембергском доме. Ею стала внучка родного брата императрицы и
          старшая дочь принца Павла Генриха Карла Фридриха Августа
          Вюртембергского — Фредерика Шарлотта Мария. Чтобы познакомиться с
          принцессой, предназначенной ему в супруги, в 1822 году Михаил Павлович
          ездил в Штутгарт. По воспоминаниям графа Мориоля жених не испытывал
          каких-либо нежных чувств к невесте, а подчинялся матери-императрице.
          Граф писал в 1823 году перед встречей невесты: «Эта поездка была ему
          очень не по сердцу и, забывая о всякой осторожности, он обнаруживал
          свою холодность, или, скорее, отвращение к новому положению, которое
          ему предстояло». Подобное отношение скорее всего объяснялось влиянием
          старшего брата Константина, который после первого неудачного брака
          возненавидел всех немецких принцесс и поддерживал младшего брата в
          нежелании жениться на одной из них. Между тем принцессу Шарлотту
          многие называли очаровательной во всех отношениях.
        </p>{" "}
        <p style={{ textIndent: "30px" }}>
          8 февраля 1824 года в Петербурге Михаил Павлович женился на
          Фредерике-Шарлотте, принявшей в православии имя Елена Павловна
          (1806—1873). Впоследствии отношения между супругами не становились
          теплее, наоборот, невнимание Михаила к жене шокировало даже его
          братьев. В мае 1828 года Константин Павлович писал брату Николаю:
          «Положение (Елены Павловны) оскорбительно для женского самолюбия и для
          той деликатности, которая вообще свойственна женщинам. Это —
          потерянная женщина, если плачевное положение, в котором она находится,
          не изменится».
        </p>{" "}
        <p style={{ textIndent: "30px" }}>
          Принцесса была высокообразованной женщиной с широким кругом знаний,
          великий князь же всего себя посвятил делам армии. О нём говорили, что
          «кроме армейского устава он ни одной книги не открыл». Как ни
          старалась Елена Павловна подлаживаться под вкусы супруга, но, когда
          дело доходило до принципиальных вопросов, она не всегда умела
          сдерживаться: по своей горячности даже при посторонних выражала досаду
          и прекращала разговор, выходя из комнаты. Великий князь по возможности
          старался избегать общества жены. Добрый по сути своей человек, Михаил
          Павлович был не самым приятным в общении, с манерами невоспитанного
          холостяка. Но он смирился со своим браком и «простил ей, что она была
          выбрана ему в жены, тем дело и кончилось». Права оказалась императрица
          Елизавета Алексеевна, которая писала вскоре после свадьбы: «…надо
          надеяться, что при настойчивости с её стороны время изменит эти
          грустные отношения».
        </p>{" "}
        <p
          style={{
            textIndent: "50px",
            fontSize: "25px",
            paddingLeft: "235px",
            paddingTop: "4px",
            paddingBottom: "6px",
          }}
        >
          <b>Дети</b>
        </p>{" "}
        <p style={{ textIndent: "30px" }}>
          В браке родились пять дочерей, две из которых умерли в раннем детстве.
          Большой трагедией для супругов стала смерть ещё двух взрослых дочерей.
        </p>
        <p style={{ paddingLeft: "50px" }}>
          <i>1. Мария Михайловна </i>(25 февраля (9 марта) 1825 — 7 (19) ноября
          1846) <br />
          <i>2. Елизавета Михайловна</i> (14 (26) мая 1826 — 16 (28) января
          1845), в 1844 году вступила в брак с герцогом Нассауским Адольфом.
          <br /> <i>3. Екатерина Михайловна</i> (16 (28) августа 1827 — 30
          апреля (12 мая) 1894), вступила в брак с Георгом, герцогом
          Мекленбург-Стрелицким.
          <br /> <i>4. Александра Михайловна</i> (16 (28) января 1831 — 15 (27)
          марта 1832) <br />
          <i>5. Анна Михайловна</i> (15 (27) октября 1834 — 10 (22) марта 1836)
        </p>{" "}
        <p style={{ textIndent: "50px" }}>
          <b>Внебрачная дочь:</b>
        </p>{" "}
        <p style={{ textIndent: "50px" }}>
          • <i>Надежда Михайловна Половцова </i>(урожд. Июнева, 1843—1908).
        </p>{" "}
        <p
          style={{
            textIndent: "50px",
            fontSize: "25px",
            paddingLeft: "210px",
            paddingTop: "0px",
            paddingBottom: "6px",
          }}
        >
          <b>Смерть</b>
        </p>{" "}
        <p style={{ textIndent: "30px" }}>
          Хотя Михаил Павлович на вид был телосложения крепкого, но здоровьем
          похвастаться не мог. Ещё в 1819 году он перенёс тяжёлую болезнь, и
          врачи порекомендовали ему пройти курс лечения целебными водами в
          Карлсбаде, куда он и отправился летом 1821 года. В 1837 году он
          несколько месяцев лечился на европейских курортах. Но даже через два
          года Ф. Гагерн отмечал в своём дневнике, что у великого князя
          «здоровье страдает». Тем не менее над докторами он смеялся, не всегда
          следуя рекомендациям. Император Николай I писал: «Скорый приезд
          Михаила Павловича вместо радости нам скорее в горе, ибо возвращается,
          не кончив лечения своего, которое вновь начинать придётся, ежели, как
          полагать должно, не переменит здесь своего образа жизни и дурных
          привычек».
        </p>{" "}
        <p style={{ textIndent: "30px" }}>
          Тяжёлым потрясением для Михаила Павловича стала смерть дочери
          Елизаветы в 1845 году, через год на его руках скончалась старшая дочь
          — Мария. Там, в Вене, организм великого князя не выдержал — у него
          началось кровотечение из носа. Через три года, во время пребывания
          императорской семьи в Москве на Святой неделе у Михаила Павловича
          повторилось кровотечение, следствием чего стало нервное расстройство.
          В июле 1849 года, несмотря на болезненное состояние, великий князь
          отправился в Варшаву, где сосредоточились вверенные ему гвардейский и
          гренадерский корпусы. 12 августа во время осмотра кавалерийской
          дивизии и артиллерии на Мокотовом поле под Варшавой великий князь
          обратился к сопровождавшему его Н. Н. Муравьеву: «У меня немеет
          рука…». Окружавшие едва успели снять великого князя с лошади и отвезли
          во дворец Бельведер.
        </p>{" "}
        <p style={{ textIndent: "30px" }}>
          Около двух с половиной недель продолжалась борьба за жизнь разбитого
          параличом Михаила Павловича. В Варшаву срочно прибыли Елена Павловна с
          дочерью Екатериной. Как писал очевидец, «они провели последние дни у
          постели умирающего, который их узнал и был очень обрадован…». 28
          августа (9 сентября) 1849 года великий князь Михаил Павлович
          скончался. Тело Михаила Павловича на пароходе из Штеттина отправили в
          Петербург. Погребение его состоялось 16 сентября в Петропавловском
          соборе. Русская армия и гвардия носили траур три месяца. Траур его
          семьи продолжался целый год. Николай I тосковал после смерти брата,
          которая произвела на него очень сильное впечатление. Он как-то сразу
          постарел, поседел, быстро утомлялся, стал грустен.
        </p>{" "}
        <p
          style={{
            textIndent: "50px",
            fontSize: "25px",
            paddingLeft: "200px",
            paddingTop: "2px",
            paddingBottom: "6px",
          }}
        >
          <b>Личность</b>
        </p>{" "}
        <p style={{ textIndent: "30px" }}>
          Михаил Павлович был всеобщим любимцем в императорской семье. С детства
          живой, общительный, он привязался к старшему брату Николаю, и с годами
          их сплотила крепкая дружба. Николай ценил преданность Михаила и считал
          его поведение настоящим примером братской любви и преданности. В одном
          из писем Николаю он писал: «Покуда я жив и во мне хоть малейшая сила,
          они (жизнь и сила) будут посвящены служить тебе верой и правдой».
          Столь же добрые отношения Михаил поддерживал и с другим братом
          Константином, недаром именно он был «связующим звеном» между Варшавой
          и Санкт-Петербургом в трагические дни 1825 года.
        </p>{" "}
        <p style={{ textIndent: "30px" }}>
          Михаил Павлович был кладезем всевозможных шуток и острот и прославился
          своей любовью к не всегда благопристойным розыгрышам и каламбурам.
          Порой сказанное им меткое словцо расходилось по России и долго
          передавалось из уст в уста. В юности он позволял себе подтрунивать и
          над старшими братьями. Но с изменением их статуса Михаил Павлович
          никогда не позволял себе называть старших братьев, даже за глаза,
          уменьшительными именами — строгий блюститель субординации, он был
          противником фамильярности даже в семейном кругу. Добрый и веселый нрав
          уживался в нём с любовью к порядку и строгой дисциплине, причём
          увлекаясь внешней формой, великий князь зачастую терял чувство меры.
          Именно поэтому его недолюбливали в тех воинских частях, которыми он
          командовал. Преподаватель кадетских корпусов И. К. Зайцев писал в
          своих <b>«Воспоминаниях старого учителя»:</b>
        </p>
        <p style={{ paddingLeft: "50px" }}>
          <i>
            "Великий Князь Михаил Павлович был человек серьёзный, строгий, гроза
            всех военных, хотя в душе был добрый и великодушный. Я склоняюсь к
            тому мнению, что он только маскировался грозою, для большего
            внушения военным дисциплины. Начать с того, что он только во время
            смотров являлся суровым и придирчивым, а как только кончался смотр,
            делался прост и обходителен."
          </i>
        </p>{" "}
        <p style={{ textIndent: "30px" }}>
          Великий князь Михаил во многом напоминал своего старшего брата
          Константина, в них будто сосуществовали две противоположные личности.
          Похоже, что такой неровный нрав они унаследовали от отца.
        </p>{" "}
        <p style={{ textIndent: "30px" }}>
          Вот что вспоминал о Михаиле Павловиче граф Дмитрий Петрович Бутурлин,
          военный писатель и член Военно-учебного комитета:
        </p>{" "}
        <p style={{ paddingLeft: "50px" }}>
          <i>
            "Великий князь был добрейший души человек; все его приближённые
            подтверждают это и отзываются о нём с глубокой преданностью,
            вследствие ежедневных и домашних с ним отношений. Но таковым он
            вовсе не представлялся нам, фронтовым его подчиненным: он силился
            казаться зверем и достиг своей цели. Мы его боялись как огня, и
            старались избегать всякой уличной встречи с ним… Мы не столько
            боялись государя, как его."
          </i>
        </p>
        <p style={{ textIndent: "30px" }}>
          Пётр Иванович Бартенев, издатель «Русского архива», одного из лучших
          исторических журналов, тоже отмечал двойственность натуры Михаила
          Павловича. Он оставил подробную <b>характеристику великого князя</b>,
          которого считал «в высшей степени примечательной личностью»:
        </p>{" "}
        <p style={{ paddingLeft: "50px" }}>
          <i>
            "В обществе, благодаря нашему легкомыслию и всяческой небрежности,
            сохранились предания не столько о нравственных качествах его,
            достойных подражания и благородной памяти потомства, сколько об его
            острословии и о неумолимой строгости в соблюдении воинских форм.
            Впрочем, великий князь считал долгом скрывать лучшие стороны души
            своей и большинству современников казался человеком преимущественно
            вспыльчивым, шероховатым, даже страшным. А между тем он был, прежде
            всего, человек добрый и сверх того — необычайно честный и правдивый,
            пламенно-преданный своему брату-государю и своему Отечеству. По
            природной горячности нрава он иногда требовал того же и в той же
            степени от других. Вот почему таким, каким он был, знали его в
            сущности немногие, только близкие к нему люди, да те, которые
            обращались к нему с просьбою в своих трудах, и никогда не получали
            отказа. В сём последнем рука его была неоскудевающая."
          </i>
        </p>{" "}
        <p style={{ textIndent: "30px" }}>
          Михаил Павлович не раз свободно беседовал с А. С. Пушкиным. 22 декабря
          1834 года Пушкин записал в дневнике: «Великий князь был очень любезен
          и откровенен… Я успел высказать ему многое. Дай бог, чтобы слова мои
          произвели хоть каплю добра.
        </p>
      </div>
    ),
  },
  {
    id: "Gessen",
    title: (
      <div
        style={{
          WebkitTextStroke: "1.2px #000",
          fontFamily: "'Dosis', sans-serif",

        }}
      >
        Людвиг Иоганн Вильгельм Груно Гессен-Гомбургский
      </div>
    ),
    content: (
      <div
        style={{
          padding: "10px",
          fontSize: 20,
          textAlign: "justify",
          fontFamily: "'Poppins', sans-serif",
        }}
      >
        <div style={{ textIndent: "30px" }}>
          <b>Принц Людвиг Иоганн Вильгельм Груно Гессен-Гомбургский</b> (нем. Ludwig
          Johann Wilhelm Gruno, Prinz von Hessen-Homburg; родился15 января 1705
          года, Бад-Хомбург — умер 23 октября 1745, Берлин) — представитель
          Гессенского владетельного дома, российский генерал-фельдцейхмейстер
          (1735) и генерал-фельдмаршал (1742).
        </div>{" "}
        <div style={{ textIndent: "30px" }}>
          Сын ландграфа Гессен-Гомбургского Фридриха III Якова (1673—1746) от
          1-го брака с Елизаветой Доротеей (1676—1721), принцессой
          Гессен-Дармштадтской.
        </div>{" "}
        <div style={{ textIndent: "30px" }}>
          С апреля 1722 года по январь 1723 года принц слушал лекции в
          Гиссенском университете, но не проявил любви к наукам.
        </div>
        <div style={{ textIndent: "30px" }}>
          Отец его в 1723 году согласился на предложение П. И. Ягужинского,
          посетившего Бад-Гомбург, и отпустил сыновей своих Людвига и Иоганна
          Карла (1706—1728) на русскую службу. 9 ноября 1723 года принц Людвиг
          определен был полковником в Нарвский полк и в январе 1724 года явился
          на службу в Ревель. После кончины Петра І положение принцев
          Гомбургских ухудшилось из-за недоброжелательного отношения к ним А. Д.
          Меншикова. Оно укрепилось с опалой последнего.
        </div>
        <div style={{ textIndent: "30px" }}>
          Принц Людвиг в апреле 1727 года перешёл со своим полком в Ригу и 1
          декабря произведён в генерал-майоры. Живя здесь, он познакомился с
          вдовствующей герцогиней Анной Иоанновной, с восшествием которой на
          русский престол положение его ещё более улучшилось. Осенью 1730 года
          он был вызван в Москву, произведён в генерал-лейтенанты и
          премьер-майоры Преображенского полка и назначен советником Военной
          коллегии; уплачены были все его долги.
        </div>
        <div style={{ textIndent: "30px" }}>
          2 мая 1732 году принц назначен был командующим полевыми войсками в
          Петербурге и его окрестностях, 28 августа того же года ему было
          поручено командование отрядом войск в Прикаспийских владениях России.
          22 апреля 1733 года принц принял начальство над войсками на Кавказе
          вместо временно командовавшего генерала Левашёва и стал титуловаться
          главнокомандующим. Главным местопребыванием его было укрепление
          Святого Креста. В июне ему пришлось вступить в бой с крымским ханом
          Терти-Гиреем, стремившимся пробраться на помощь осажденному персиянами
          Багдаду. 11 июня принцу удалось одержать победу над татарами при
          Горанчи (Горечае, Горячей), но при этом он, будучи окружён врагами,
          спасся от смерти только благодаря быстроте своего коня.
        </div>
        <div style={{ textIndent: "30px" }}>
          Вернувшись в укрепление св. Креста, принц почти безвыездно жил там;
          его бездействием воспользовался сын крымского хана Фети-Гирей, и
          пробился с 50 000 татар сквозь русские отряды. 16 сентября (5 октября)
          принц со своим отрядом перешёл в Дербент, а 21-го сентября (октября)
          действовавший с ним генерал Еропкин взял Багили, местопребывание
          враждебного русским хана Усмея. В общем принц не проявил способностей
          полководца и вскоре был отозван. В середине ноября он вернулся в
          укрепление св. Креста и 8 декабря отбыл в Москву, где за свои успешные
          военные действия был награждён 10 февраля 1734 года орденами св.
          Андрея Первозванного и Александра Невского.
        </div>
        <div style={{ textIndent: "30px" }}>
          В том же году принц принял участие в польской войне в защиту русского
          кандидата на польский престол — Августа III Саксонского — и успешно
          осаждал крепости Збараж и Броды, которые сдались ему в июле. Весною
          1735 году ему было поручено успокоение Подольского воеводства. 3
          августа за исполнение этого поручения он получил от короля орден
          Белого Орла. В августе же принц вступил вместо Миниха в командование
          действовавшим в Польше корпусом, который он должен был вывести на
          Украину.
        </div>
        <div style={{ textIndent: "30px" }}>
          28 марта 1735-го принц Гомбургский был назначен
          генерал-фельдцейхмейстером, а так же Генерал-провиантмейстера но до
          июля 1736 года ему пришлось разделять власть со своим предшественником
          Минихом, сохранившим за собой должность обер-директора над
          фортификациями и инженерами.{" "}
        </div>
        <div style={{ textIndent: "30px" }}>
          Так же он стал губернатором Астраханской и Персидских областей
          (провинции Ширван, Гилян, Мазендеран и Астрабад, по заключенному еще
          Петром I Рештскому договору, подписанный 21 января (1 февраля) 1732
          года в городе Решт).
        </div>
        <div style={{ textIndent: "30px" }}>
          {" "}
          В 1736 году принц, в должности генерал-фельдцейхмейстера в чине
          генерал-аншефа командуя одной из колонн войска, участвовал под
          начальством Б. Миниха в Крымском походе в кампанию 1736 года и был при
          взятии Перекопа, разорении Гёзлёва, Бахчисарая и Ак-Мечети[1].
          Отношения его с Минихом испортились ещё до этого похода, а теперь
          стали ещё более натянутыми. Принц убедил нескольких генералов
          подписать протест против действий главнокомандующего и, по словам
          Манштейна, намеревался даже арестовать Миниха, если он не исполнит
          требований генералов. Протест не имел никаких результатов, и тогда
          принц написал письмо к Э. Бирону с жалобой на Миниха; Бирон переслал
          донос Миниху, что, конечно, не могло улучшить отношений между
          главнокомандующим и его ближайшим помощником.
        </div>
        <div style={{ textIndent: "30px" }}>
          Тем не менее в кампанию 1737 года принц снова под начальством Миниха
          участвовал в Очаковском походе[1]. В штурме Очакова он не принимал
          непосредственного участия; по словам же Манштейна, принц «занемог в то
          самое время, когда русские готовились идти на приступ, и выздоровел в
          день взятия Очакова». Возвратясь в Петербург по окончании похода, он
          21 января 1738 году вступил в брак с вдовой бывшего молдавского
          господаря, княгиней Анастасией Ивановной Кантемир, урождённой княжной
          Трубецкой — дочерью Ивана Юрьевича Трубецкого.
        </div>
        <div style={{ textIndent: "30px" }}>
          В 1739 году принц отправился, впервые после своего переезда в Россию,
          за границу и представил родным жену. Указом 10 марта 1740 года Миниху
          повелено было под своим председательством и в составе членов принца
          Гомбургского и барона Левендаля образовать особую комиссию «о
          рассмотрении артиллерии и о поправлении в имеющихся при оной
          недостатках и о лучшем и порядочном впредь оной содержании». Комиссия
          собиралась только 3 раза. Деятельность её возобновилась при Анне
          Леопольдовне 23 января 1741 года под председательством принца, и уже
          10 февраля 1742 года представлен был Сенату проект инструкции
          Канцелярии Главной артиллерии и штатов её, но не получил утверждения.
        </div>
        <div style={{ textIndent: "30px" }}>
          В июне 1741 года принцу по случаю войны со Швецией вверено было
          командование войсками, назначенными оборонять побережье Финского
          залива; он оставался при них до наступления зимы, но до военных
          столкновений со шведами дело не доходило. Принц был ревностным
          сторонником цесаревны Елизаветы Петровны, и 25 ноября 1741 года, в
          день переворота, возведшего её на престол, она поручила ему ведать
          военные силы Петербурга и охранять с ними порядок. В награду за
          участие в перевороте принц пожалован был в капитан-поручики
          Лейб-кампании и 11 декабря 1741-го получил в свою «дирекцию» Шляхетный
          кадетский корпус; кроме того, Государыня пожаловала ему перстень с
          бриллиантами, золотую шпагу со своим вензелем и бриллиантами и двор в
          Москве в Немецкой слободе, а так же обширные земли в Ливонии (5 апреля
          1742 года).
        </div>
        <div style={{ textIndent: "30px" }}>
          В день коронации (25 апреля 1742 года) он был произведён в
          генерал-фельдмаршалы и полковники Измайловского полка. 15 февраля
          1742-го Артиллерийская канцелярия была вновь соединена с
          Фортификационной конторой под главным начальством принца Гомбургского.
          27 июля того же года, за отъездом императрицы в Киев, принцу были
          поручены в управление петербургские дворцы, оставшаяся в столице
          гвардия, а также полевые и гарнизонные полки.
        </div>
        <div style={{ textIndent: "30px" }}>
          Осенью этого года принц тяжко заболел и 18 августа 1745 году по совету
          врачей уехал за границу. Доехав до Берлина, он вследствие усилившейся
          болезни принужден был здесь остановиться и скончался.
        </div>
      </div>
    ),
  },
  {
    id: "Matveevich",
    title: (
      <div
        style={{
          WebkitTextStroke: "1.2px #000",
          fontFamily: "'Dosis', sans-serif",

        }}
      >
        Голенищев-Кутузов Илларион Матвеевич
      </div>
    ),
    content: (
        <div
            style={{
              padding: "10px",
              fontSize: 20,
              textAlign: "justify",
              fontFamily: "'Poppins', sans-serif",
            }}
        >

          <div style={{textIndent: "30px"}}><b>Илларион Матвеевич</b> родился около 1718 года в семье псковского
            помещика Матвея Ивановича Голенищева-Кутузова.
          </div>
          <div style={{textIndent: "30px"}}>8 октября 1733 года поступил в Инженерную школу, основанную Пётром I в 1712
            году. После окончания Инженерной школы в 1738 году, он, проявив хорошие способности к рисованию и черчению,
            был направлен для производства топографической и картографической съёмки в окрестностях Петербурга.
          </div>
          <div style={{textIndent: "30px"}}>В 1742 году, после восхождения на российский престол Елизаветы Петровны, он был «назначен в ранге подпоручика
            адъютантом к генерал-аншефу барону Иоганне-Людвиге Люберасу», командиру крепости Кронштадт и начальнику
            гарнизона, бывшему президенту Берг-коллегии, под началом которого Илларион Матвеевич прослужил 11 лет. В этот
            период ему приходилось много путешествовать и работать: составлять карты и планы крепостей, изучать языки и
            участвовать в дипломатических переговорах, в частности, со Швецией. По итогам переговоров на конгрессе в Або
            (Турку) и подписания трактата в 1743 году, упрочившего положение России на северо-западных границах, Люберас
            был награждён императрицей Елизаветой Петровной орденом Святого Владимира, а его адъютант Илларион Матвеевич
            «Большой серебряной медалью».</div>
          <div style={{textIndent: "30px"}}>Большие поездки перемежались заездами домой на Псковщину в Опочецкий уезд (сёла Матюшино, Ступино и др.). В 25
            лет Илларион Матвеевич женился на Анне Илларионовне Беклешовой, уроженке тех же мест. После свадьбы Ларион
            Матвеевич перевёз жену в Петербург, по месту своей постоянной службы.</div>
          <div style={{textIndent: "30px"}}> В начале 1744 года Илларион Матвеевич был отправлен в Стокгольм в качестве адьютанта российского
            министра-резидента при шведском королевском дворе, откуда вернулся в середине 1746 года в Россию, приступив к
            своим прежним делам – строительству канала Петра Великого и усовершенствованию Кронштадта.</div>
          <div style={{textIndent: "30px"}}>При императрице Елизавете Петровне он составил проект проведения Екатерининского канала для предотвращения
            гибельных последствий разливов реки Невы. Проект этот был приведен в исполнение при императрице Екатерине
            Великой, причем Кутузову была пожалована золотая табакерка, осыпанная бриллиантами. Он был лично известен
            Екатерине уже в начале её царствования. 3 февраля 1765 года был награждён орденом Св. Анны.</div>
          <div style={{textIndent: "30px"}}>Участвовал в турецкой войне 1768—1774 годов, под начальством графа Румянцева и считался «весьма сведущим, не
            только в военных делах, но и в гражданских».</div>
          <div style={{textIndent: "30px"}}>Илларион Матвеевич отдал военной службе 30 лет и вышел в отставку в чине генерала-поручика. Оставив службу,
            стал предводителем дворянства Псковской губернии. Прожил здесь до смерти в 1784 году.</div>
          <div style={{textIndent: "30px"}}>Похоронен в церкви Воскресения Христова погоста Теребени (ныне — в Опочецком районе Псковской области).</div>
        </div>
    ),
  },
  {
    id: "Lomonosov",
    title: (
      <div
        style={{
          WebkitTextStroke: "1.2px #000",
          fontFamily: "'Dosis', sans-serif",

        }}
      >
        Ломоносов Михаил Васильевич
      </div>
    ),
    content: (
        <div
            style={{
              padding: "10px",
              fontSize: 20,
              textAlign: "justify",
              fontFamily: "'Poppins', sans-serif",
            }}
        >

          <div style={{textIndent: "30px"}}>Выдающийся русский ученый, первый русский академик, поэт, реформатор русского языка, художник и историк <b>Михаил Васильевич Ломоносов</b> родился 19 ноября (8 ноября по старому стилю) 1711 года в деревне Мишанинской (ныне село Ломоносово) Куростровской волости Двинского уезда Архангельской губернии в семье крестьянина помора Василия Дорофеевича Ломоносова, занимавшегося морским промыслом на собственных судах.
          </div>
          <div style={{textIndent: "30px"}}>В декабре1730 г., стремясь получить образование, Михаил Ломоносов ушел с рыбным обозом в Москву.
            В январе 1731 г. Ломоносов, выдав себя за дворянского сына, поступил в Московскую славяно греко латинскую академию при Заиконоспасском монастыре ("Спасские школы").

          </div>
          <div style={{textIndent: "30px"}}>В 1735 г. в числе 12 лучших студентов академии он был отправлен учиться в Санкт Петербургскую академию наук.
            В 1736 г. трое из способных студентов, в том числе Ломоносов, были отправлены Академией наук в Германию для обучения математике, физике, философии, химии и металлургии. За границей Ломоносов пробыл пять лет.
            В Германии Ломоносов поселился в Мальбурге – в доме Екатерины Елизаветы Цильх, вдовы пивовара и члена городской думы Генриха Цильха, с младшей дочерью которой Елизаветой он обвенчался 6 июня 1740 г.
          </div>
          <div style={{textIndent: "30px"}}>В июне 1741 г. (по другим сведениям, в январе 1742 г.) Ломоносов вернулся в Россию и был назначен в академию адъюнктом Академии наук по физическому классу, а в августе 1745 г. стал первым русским, избранным на должность профессора (академика) химии.</div>
          <div style={{textIndent: "30px"}}> В 1749 г. на торжественном собрании Академии наук Ломоносов выступил с речью под названием "Слово похвальное императрице Елизавете Петровне". Речь произвела хорошее впечатление и Ломоносов стал пользоваться большим вниманием при дворе, сблизился с любимцем Елизаветы графом Иваном Шуваловым.</div>
          <div style={{textIndent: "30px"}}>Ломоносов неоднократно ставил вопрос об открытии университета в Москве. Его предложения, сформулированные в письме к Ивану Шувалову, легли в основу проекта Московского университета.</div>
          <div style={{textIndent: "30px"}}>25 (12 по старому стилю) января 1755 г. Елизавета Петровна подписала указ об основании Московского университета. 7 мая (26 апреля по старому стилю) 1755 г. состоялось торжественное открытие университета в здании Аптекарского дома, находившегося на месте Исторического музея. В 1940 г., в дни празднования 185 летнего юбилея, университету было присвоено имя Михаила Ломоносова.</div>
          <div style={{textIndent: "30px"}}>В марте 1757 г. Ломоносов был назначен советником Академической канцелярии. В ведении Ломоносова находились Академическое собрание, университет, гимназия и Географический департамент.</div>
          <div style={{textIndent: "30px"}}>В 1763 г. Михаил Ломоносов был избран членом Российской академии художеств. В конце жизни Ломоносов стал почетным членом Стокгольмской (в 1760 г.) и Болонской (в 1764 г.) академий наук.</div>
          <div style={{textIndent: "30px"}}>Умер Михаил Ломоносов 15 апреля (4 апреля по старому стилю) 1765 г., похоронен на Лазаревском кладбище Александро Невской лавры в Петербурге.</div>
          <div style={{textIndent: "30px"}}>Открытия Ломоносова в области химии, физики и астрономии на десятилетия опередили работы западноевропейских ученых. Он развил атомно молекулярные представления о строении вещества, высказал принцип сохранения материи и движения, заложил основы физической химии, исследовал атмосферное электричество и силу тяжести. Он выдвинул учение о свете, создал ряд оптических приборов, открыл атмосферу на планете Венера, объяснил происхождение многих полезных ископаемых и минералов. Известны его труды в области истории.</div>
          <div style={{textIndent: "30px"}}>Ломоносов – крупнейший поэт XVIII века, создатель русской оды философского и высокого гражданского звучания, автор поэм, поэтических посланий, трагедий, сатир, филологических трудов и научной грамматики русского </div>
          <div style={{textIndent: "30px"}}>Имя Ломоносова носят многие учреждения науки, образования и культуры России: Московский государственный университет имени М. В. Ломоносова, Музей М.В. Ломоносова Российской Академии Наук, Московская государственная академия тонкой химической технологии им. М. В. Ломоносова, Архангельский театр драмы имени М. В. Ломоносова, Поморский государственный университет имени М. В. Ломоносова и др.
            Именем Ломоносова названы город в Ленинградской области, течение в Атлантическом океане, горный хребет на Новой Земле, подводный хребет в Северном Ледовитом океане, возвышенность на острове Западный Шпицберген, кратер на Луне.
          </div>
        </div>
    ),
  },
  {
    id: "Repnin",
    title: (
      <div
        style={{
          WebkitTextStroke: "1.2px #000",
          fontFamily: "'Dosis', sans-serif",

        }}
      >
        Репнин Аникита Иванович
      </div>
    ),
    content: (
        <div
            style={{
              padding: "10px",
              fontSize: 20,
              textAlign: "justify",
              fontFamily: "'Poppins', sans-serif",
            }}
        >

          <div style={{textIndent: "30px"}}><b>РЕПНИН Аникита Иванович</b> [1668 – 3(14).07.1726, Рига, Российская империя], российский государственный и военный деятель, генерал-фельдмаршал (1725), князь. Происходил из древнего рода князей Черниговских, ведущих свои корни от Рюрика. Родился в семье боярина, новгородского и тамбовского воеводы, начальника Сибирского приказа И.Б. Репнина. В 16 лет начал придворную службу спальником и вошёл в тесный круг приближённых молодого царя Петра Алексеевича. При учреждении в 1685 г. «потешной» роты назначен её поручиком. Во время попытки мятежа 1689 г. одним из первых прибыл в Троицкий монастырь для охраны царя Петра от сторонников Софьи. В чине полуполковника Преображенского полка участвовал в Кожуховских манёврах 1694 г. Отличился в Азовских походах 1695–1696 гг. В 1699 г. ему было поручено сформировать в Казани 10 солдатских полков. С задачей он успешно справился, причём 8 набранных полков составили «третье генеральство» действующей армии под началом Репнина.
          </div>
          <div style={{textIndent: "30px"}}>В начале Северной войны 1700–1721 гг. – командир дивизии и одновременно с 1700 г. новгородский генерал-губернатор. После поражения русских войск под Нарвой в декабре 1700 г. по приказу Петра I приводил в порядок отходившие войска и занимался набором рекрутов в армию. С 1702 г., командуя несколькими полками, участвовал в штурме Нотебурга (1702) и Ниеншанца (1703), во взятии Нарвы (1704) и Митавы (1705). В 1706 г. один из организаторов боевых действий войск в осаждённом Гродно и при их отходе к Бресту. В 1708 г. возглавляемая им дивизия в сражении у села Головчино потерпела поражение, за что по указанию царя Петра I он был предан военному суду и разжалован в рядовые. Но после отличия в боях при Лесной вновь назначен начальником дивизии и восстановлен в чине генерала. В Полтавском сражении 1709 г. командовал центром русской армии. В 1709–1710 гг. руководил осадой Риги. При взятии города в 1710 г. первым вошёл туда, сменив шведские караулы своими войсками, и был назначен губернатором Риги. Некоторое время ведал также гражданским управлением Лифляндии. В ходе Прутского похода 1711 г. командовал авангардом. С 1712 г. состоял вторым после А.Д. Меншикова начальником войск в Померании. Его войска нанесли поражение шведам в сражении при Фридрихштадте (1713), взяли Штеттин (1713), участвовали
            в осаде крепости Тонинген, капитулировавшей в 1713 г., а затем занимались охраной побережья Курляндии.

          </div>
          <div style={{textIndent: "30px"}}>С 1719 г. А.И. Репнин – генерал-губернатор Рижской губернии и одновременно в 1724–1725 гг. президент Военной коллегии. В мае 1724 г. по случаю коронации Петром I своей жены Екатерины I императрицей получил чин генерал-фельдмаршала. После смерти императора Петра I, был сторонником возведения на престол царевича Петра Алексеевича, но затем поддержал мнение Меншикова о передаче короны Екатерине I. После воцарения Екатерины Меншиков, опасавшийся чрезмерного возвышения Репнина, отобрал у него руководство Военной коллегией и добился его возвращения в Ригу, где тот вскоре умер. Похоронен в Алексеевской церкви в Риге.
          </div>
          <div style={{textIndent: "30px"}}>Награждён орденами: российскими – Святого Андрея Первозванного и Святого Александра Невского; датским – Слона; польским – Белого Орла.</div>

        </div>
    ),
  },
  {
    id: "Vilboa",
    title: (
      <div
        style={{
          WebkitTextStroke: "1.2px #000",
          fontFamily: "'Dosis', sans-serif",

        }}
      >
        Вильбоа Александр Никитич
      </div>
    ),
    content: (
        <div
            style={{
              padding: "10px",
              fontSize: 20,
              textAlign: "justify",
              fontFamily: "'Poppins', sans-serif",
            }}
        >
          <div style={{textIndent: "30px"}}><b>ВИЛЬБОА (фр. AlexanderGuillemotdeVillebois) Александр Никитич </b> [1716 – 29.01(09.02).1781, пом. Сарракус близ Дерпта, Лифляндия], российский военный деятель, генерал-поручик (1758). Происходил из семьи, имевшей старинные французские корни. Младший сын главного командира Кронштадтского порта вице-адмирала Н.П. Вильбоа, принятого на русскую службу Петром I в 1697 г.
          </div>
          <div style={{textIndent: "30px"}}>В августе 1739 г. поступил на военную службу и был зачислен в лейб-гвардии бомбардирскую роту сержантом. В 1741 г. произведен в подпоручики. С 1742 г. участвовал в Русско-шведской войне 1741–1743 гг. В 1744 г. был пожалован в камер-юнкеры ко двору императрицы Елизавета Петровны с чином полковника. В 1755 г. его жалуют чином генерал-майора. С 1756 г. занимал должность генерал-квартирмейстера Лифляндской дивизии. Участник Семилетней войны 1756–1763 гг. Отличился в сражении при Гросс-Егерсдорфе, в ходе которой командовал пехотной бригадой 2-й дивизии. Получил тяжелое ранение в голову. За отличие пожалован орденом Св. Александра Невского.
          </div>
          <div style={{textIndent: "30px"}}>В январе 1758г. произведенвгенерал-поручики.
            После выздоровления участвовал в осаде Кюстрина, в сражении при Пальциге. В Кунерсдорфском сражении командовал авангардом русской армии. После возвращения действующей армии в Россию в январе 1762 г. его именем был назван Великолуцкий пехотный полк. В феврале того же года его назначают генерал-фельдцейхмейстером, а в марте – членом Военной коллегии. Участвовал в перевороте 28 июня (9 июля) 1762 г. После свержения Петра III поддержал на престоле Екатерину II, резко выступив против проекта Н.П. Панина об ограничении власти императрицы. По свидетельству современников, обилие и объём резолюций, которыми он снабжал поступавшие к нему документы по всем четырем вверенным ему, как генерал-фельдцейхмейстеру, ведомствам: артиллерийскому, инженерному, оружейному и кадетских корпусов, поразительны. Многие из них содержат «целые инструкции и положения, в большинстве крайне полезные и полно разрешающие все затруднения». Деятельность Вильбоа на посту генерал-фельдцехмейстера обещала быть очень полезной, однако в 1765 г. он был вынужден просить об отставке по состоянию здоровья: сказались последствия тяжёлого ранения. Находясь не у дел, Вильбоа поселился в своем поместье Сарракус в Лифляндии. В качестве депутата от Лифляндской губернии с 1767 г. принимал участие в работе Уложенной комиссии. Умер в 1781 г. в своем поместье, где и был захоронен.

          </div>
          <div style={{textIndent: "30px"}}>Награжден орденами: Св. Андрея Первозванного, Св. Александра Невского, Св. Анны.</div>

        </div>
    ),
  },
  {
    id: "Chernishevskiy",
    title: (
      <div
        style={{
          WebkitTextStroke: "1.2px #000",
          fontFamily: "'Dosis', sans-serif",

        }}
      >
        Чернышевский Николай Гаврилович
      </div>
    ),
    content: (
        <div
            style={{
              padding: "10px",
              fontSize: 20,
              textAlign: "justify",
              fontFamily: "'Poppins', sans-serif",
            }}
        >
          <div style={{textIndent: "30px"}}><b>Николай Гаврилович Чернышевский </b> – русский философ-материалист, автор основ утопического социализма, сторонник революционных изменений, политик, ученый, литератор.
          </div>
          <div style={{textIndent: "30px"}}>Родился 12 (24) июля 1828 года в Саратове в семье протоиерея. До четырнадцати лет обучался дома. Его первыми учителями стали родной отец, двоюродная сестра и гувернер из Франции. В детстве Николай любил читать, посвящая этому занятию все свободное время. Страдал сильной близорукостью.
          </div>
          <div style={{textIndent: "30px"}}>В 1843 году Чернышевский поступил в духовную семинарию Саратова. После трех лет оставляет обучение и отправляется в Санкт-Петербург, где в 1846 году сдает экзамены для поступления на историко-филологический факультет столичного университета. Здесь он знакомится с античными авторами, изучает работы Ньютона, Лапласа и передовых западных представителей материализма. Эти знания стали платформой для формирования будущего революционера.
          </div>
          <div style={{textIndent: "30px"}}>Учась в университете, Чернышевский тесно общается с членами кружка И. И. Введенского. Это общество подтолкнуло Николая к писательской стезе. В 1850 году он оканчивает обучение и едет в Саратовскую губернию по назначению.</div>
          <div style={{textIndent: "30px"}}>В 1853 году Чернышевский женится на Ольге Васильевой, дочери саратовского доктора. Семья переезжает в столицу, где Николай работает в кадетском корпусе, но вскоре он был вынужден уволиться из-за ссоры с офицером. После он сменил много мест, сотрудничал с различными литературными журналами: «Современник», «Военный сборник», «Санкт-Петербургские ведомости» и «Отечественные записки».
          </div>
          <div style={{textIndent: "30px"}}>После проведения «Великих реформ» писатель становится идейным вдохновителем движения народничества. В 1863 году в журнале «Современник» выходит роман «Что делать?» – главный труд жизни писателя.
          </div>
          <div style={{textIndent: "30px"}}>В 1864 году за социально-революционную деятельность был сослан на каторгу на четырнадцать лет. Спустя некоторое время получил амнистию, однако, согласно предписанию, до конца своих дней должен был остаться в Сибири.
          </div>
          <div style={{textIndent: "30px"}}>Спустя пятнадцать лет мытарств, благодаря ходатайствам сына, Николай Чернышевский смог вернуться в родной Саратов. Вскоре тяжело заболел малярией. Умер писатель от кровоизлияния в мозг 17 (29) октября 1889 года. Был похоронен на Воскресенском кладбище Саратова.
          </div>

        </div>
    ),
  },
  {
    id: "Dobrolyubov",
    title: (
      <div
        style={{
          WebkitTextStroke: "1.2px #000",
          fontFamily: "'Dosis', sans-serif",

        }}
      >
        Добролюбов Никита Александрович
      </div>
    ),
    content: (
        <div
            style={{
              padding: "10px",
              fontSize: 20,
              textAlign: "justify",
              fontFamily: "'Poppins', sans-serif",
            }}
        >
          <div style={{textIndent: "30px"}}><b>Николай Александрович Добролюбов </b>– русский литературный критик, публицист и революционер.
          </div>
          <div style={{textIndent: "30px"}}>Николай Добролюбов родился 24 января 1836 года в Нижнем Новгороде в семье священника. Мальчик имел большую страсть к литературе, с трех лет читал наизусть басни Крылова, позже стал одним из лучших в духовной семинарии. В 1853 году Николай отлично закончил обучение и поступил в Главный педагогический институт Петербурга. После смерти отца Николай по собственному решению стал главой семьи и начал энергично работать, отсылая большую часть денег домой.
          </div>
          <div style={{textIndent: "30px"}}>С 1854 года Добролюбов решил полностью посвятить себя литературному творчеству. В рукописном студенческом журнале «Слухи» регулярно появлялись стихотворения и статьи Добролюбова, а в 1856 году в «Современнике» была напечатана первая статья будущего критика о «Собеседнике Российского Слова». Работал он чрезвычайно много и плодотворно, только за один 1958 год было создано семьдесят пять рецензий и статей. В своей критике Николай развивал взгляды и принципы Белинского и Чернышевского, усматривая назначение литературы в критике монархии. Философские взгляды автора нашли отражение в статьях, содержащих острые общественно-политические высказывания. Статьи-рецензии «Когда же придёт настоящий день?», «Что такое обломовщина?», «Луч света в тёмном царстве», «Забитые люди» – это яркие образцы реалистической критики русской литературы того времени. В статье «О степени участия народности в развитии русской литературы» Добролюбов первым употребил термин «реализм» для обозначения художественного стиля.
          </div>
          <div style={{textIndent: "30px"}}>Молодой автор-публицист был блестящим библиографом. Его «Обзор духовной литературы» архиепископа Филарета, статьи о Петре Первом, Роберте Оуэне образцы кропотливого научного труда. Свои взгляды на систему воспитания критик изложил в педагогических трудах: «О значении авторитета в воспитании», «Основные законы воспитания», «Всероссийские иллюзии, разрушаемые розгами». Добролюбов-педагог выступал против подавления личности, воспитания покорности, осуждал физические наказания. Ратовал за воспитание всесторонне развитого самостоятельного человека, воспитание трудом, наглядным примером, за получение образования женщинами наравне с мужчинами.</div>
          <div style={{textIndent: "30px"}}>Однако вскоре интенсивный умственный труд, большие физические и моральные нагрузки подорвали здоровье Николая Добролюбова – развилась чахотка. Весной 1860 года критик по настоянию друзей отправился за границу для лечения, но угасание продолжалось.17 ноября 1861 в возрасте двадцати пяти лет Николай Александрович Добролюбов скончался от туберкулеза и был похоронен в Санкт-Петербурге на мемориальном кладбище «Литераторские мостки» рядом с могилой Белинского.
          </div>
          <div style={{textIndent: "30px"}}>Слава к русскому критику пришла уже после смерти, когда Некрасов посвятил ему стихотворение «Светлой памяти Николая Добролюбова». Вскоре вышло полное собрание сочинений Николая Александровича, которое имело большой успех и только в девятнадцатом веке выдержало семь изданий большими тиражами.
          </div>

        </div>
    ),
  },
  {
    id: "Mendeleev",
    title: (
      <div
        style={{
          WebkitTextStroke: "1.2px #000",
          fontFamily: "'Dosis', sans-serif",

        }}
      >
        Менделеев Дмитрий Иванович
      </div>
    ),
    content: (
        <div
            style={{
              padding: "10px",
              fontSize: 20,
              textAlign: "justify",
              fontFamily: "'Poppins', sans-serif",
            }}
        >
          <div style={{textIndent: "30px"}}><b>Менделеев Дмитрий Иванович </b>родился 8 февраля (27 января по старому стилю) 1834 года в Тобольске.
          </div>
          <div style={{textIndent: "30px"}}>В 1855 году с золотой медалью окончил отделение естественных наук физико-математического факультета Главного педагогического института в Петербурге. В 1856 году защитил в Петербургском университете магистерскую диссертацию, а с 1857 года в качестве доцента читал там же курс органической химии.
          </div>
          <div style={{textIndent: "30px"}}>В январе 1859 года Менделеев был отправлен в двухгодичную командировку в Гейдельберг (Германия), где, устроив небольшую лабораторию, произвел свои исследования над капиллярностью жидкостей. В это время им были написаны работы "О расширении жидкостей" и "О температуре абсолютного кипения".
          </div>
          <div style={{textIndent: "30px"}}>В 1861 году Менделеев вернулся в Петербург, где возобновил чтение лекций по органической химии, в 1861 году опубликовал учебник "Органическая химия", удостоенный Петербургской Академией наук Демидовской премии.
            В 1864-1866 годах — профессор Петербургского технологического института.
          </div>
          <div style={{textIndent: "30px"}}>В 1865 году Менделеев защитил докторскую диссертацию "О соединении спирта с водой" и тогда же был утвержден профессором Петербургского университета.
          </div>
          <div style={{textIndent: "30px"}}>Приступив к работе над учебником "Основы химии", ученый совершил одно из величайших открытий в истории химии — вывел периодический закон химических элементов. Первый вариант периодической таблицы элементов был опубликован в 1869 году под названием "Опыт системы элементов, основанной на их атомном весе и химическом сходстве". Окончательная формулировка закона была дана ученым в июле 1871 года. В классическом труде "Основы химии", выдержавшем при жизни ученого восемь изданий на русском языке и несколько изданий на иностранных языках, Менделеев впервые изложил неорганическую химию на основе периодического закона.
          </div>
          <div style={{textIndent: "30px"}}>В 1871-1875 годах Менделеев занимался исследованием упругости и расширения газов и опубликовал свое сочинение "Об упругости газов".
            В 1876 году он был избран членом-корреспондентом Петербургской АН. В 1880 году виднейшие русские ученые выдвинули Менделеева в члены Петербургской АН, но его кандидатура была отвергнута, что вызвало резкий протест общественности в России и за рубежом.

          </div>
          <div style={{textIndent: "30px"}}>В конце 1870-х — первой половине 1880-х годов Менделеев занимался исследованием растворов, их результаты сведены в обширном сочинении "Исследования растворов по удельному весу" (1887).
          </div>
          <div style={{textIndent: "30px"}}>Менделеев уделял много внимания нефтяной промышленности. В 1876 году по поручению правительства он предпринял путешествие в Америку для ознакомления с постановкой там нефтяного дела, также неоднократно посещал с той же целью кавказские месторождения. В 1888 году он изучал экономическое состояние Донецкого каменноугольного района. Результаты этих работ были изложены им в ряде статей и отдельных монографий.
          </div>
          <div style={{textIndent: "30px"}}>В 1876-1880 годах Менделеев провел исследования в области метеорологии и воздухоплавания. Им был создан чувствительный дифференциальный барометр. В августе 1887 года без пилота совершил полет на воздушном шаре для наблюдения солнечного затмения и изучения высоких слоев атмосферы.
          </div>
          <div style={{textIndent: "30px"}}>В 1890 году Менделеев покинул Петербургский университет вследствие конфликта с министром народного просвещения Иваном Деляновым, отказавшимся во время студенческих волнений принять переданную Менделеевым петицию студентов.
          </div>
          <div style={{textIndent: "30px"}}>В 1890-1895 годах он состоял консультантом Научно-технической лаборатории Морского министерства. В 1890 году изобрел новый вид бездымного пороха ("пироколлодий") и в 1892 году организовал его производство.
          </div>
          <div style={{textIndent: "30px"}}>В 1892 году Дмитрий Менделеев был назначен ученым хранителем Депо образцовых гирь и весов, в 1883 году преобразованного по его инициативе в Главную палату мер и весов. Ее управляющим (директором) он и оставался до конца жизни.
          </div>
          <div style={{textIndent: "30px"}}>Дмитрий Менделеев умер 2 февраля (20 января по старому стилю) 1907 года в Петербурге от воспаления легких. Похоронен на Волковом кладбище.
          </div>
          <div style={{textIndent: "30px"}}>Научная деятельность Менделеева чрезвычайно обширна и многогранна. Среди его печатных трудов (более 500) — фундаментальные работы по химии, химической технологии, физике, метрологии, воздухоплаванию, метеорологии, сельскому хозяйству, по вопросам экономики, народного просвещения и многим др.
          </div>
          <div style={{textIndent: "30px"}}>Дмитрий Менделеев был инициатором создания Русского химического общества (1868) и Русского физического общества (1872).
          </div>
          <div style={{textIndent: "30px"}}>Являлся почетным доктором многих университетов. Почти все крупные учреждения — академии, университеты, научные общества — как в России, так и за рубежом, избрали Менделеева своим почетным членом. Ученый был удостоен многих наград, среди которых Ордена Святого Владимира I и II степеней, Орден Святого Александра Невского, Орден Белого орла, Ордена Святой Анны I и II степеней, Орден Святого Станислава I степени, Орден Почетного легиона (Франция).
          </div>
          <div style={{textIndent: "30px"}}>В честь ученого были названы химический элемент № 101 менделевий, подводный хребет в Северном Ледовитом океане, действующий вулкан на о. Кунашир (Курильские острова), кратер на Луне, минерал менделеевит. В 1964 году имя Менделеева занесено на Доску почета науки Бриджпортского университета (США) в числе имен величайших ученых мира.
          </div>
          <div style={{textIndent: "30px"}}>В крупнейших научных и культурных центрах России не реже одного раза в 4-5 лет проводятся Менделеевские съезды по химии.
          </div>
          <div style={{textIndent: "30px"}}>Дмитрий Менделеев был женат дважды. В 1862 году он сочетался браком с Феозвой Никитичной Лещевой, в этом браке родились три ребенка: дочери Мария и Ольга и сын Володя. В конце 1870-х годов Дмитрий Менделеев женился на Анне Ивановне Поповой, у них родилось четверо детей: Любовь, Иван и близнецы Мария и Василий. Менделеев был тестем русского поэта Александра Блока, женатого на его дочери Любови.
          </div>

        </div>
    ),
  },
  {
    id: "Zubov",
    title: (
      <div
        style={{
          WebkitTextStroke: "1.2px #000",
          fontFamily: "'Dosis', sans-serif",

        }}
      >
        Зубов Платон Александрович
      </div>
    ),
    content: (
        <div
            style={{
              padding: "10px",
              fontSize: 20,
              textAlign: "justify",
              fontFamily: "'Poppins', sans-serif",
            }}
        >
          <div style={{textIndent: "30px"}}><b>Платон Александрович Зубов</b>, последний фаворит императрицы Екатерины II, родился  26 ноября 1767 года. Зубовых было четыре брата. Принадлежали они к семье мелкопоместных дворян, отличавшейся большими претензиями. Отец, Александр Николаевич Зубов, был провинциальным губернатором и на этом разбогател. Он управлял имением фельдмаршала Н.И. Салтыкова, сыгравшего впоследствии не последнюю роль в возвышении Платона Зубова.
          </div>
          <div style={{textIndent: "30px"}}>В двадцать два года Платон Зубов был поручиком одного из гвардейских полков. Екатерина обратила внимание на этого красивого парня хрупкого телосложения. Платон тут же стал разыгрывать роль несчастного влюбленного. Он нашел поддержку придворных дам. Нарышкина, Протасова, Перекусихина уверяли Екатерину II, что Зубов без ума от нее. Императрица, которая и в старости была убеждена, что сохранила былую красоту и обаяние, охотно внимала их настойчивым голосам, твердившим ей о возвращении вечной весны.
          </div>
          <div style={{textIndent: "30px"}}>Однако милое дитя очень скоро проявило всепоглощающее честолюбие. Из поручиков конной гвардии он быстро производится в высшие чины, получает графское достоинство и громадные поместья, заключавшие в себе десятки тысяч душ.
          </div>
          <div style={{textIndent: "30px"}}>После смерти Потёмкина значение Зубова с каждым днем увеличивается; на него переходят многие из тех должностей, которые прежде занимал Потёмкин, он назначается генерал-фельдцейхмейстером, новороссийским генерал-губернатором, начальником Черноморского флота.
          </div>
          <div style={{textIndent: "30px"}}>По мнению современников, Зубов был недалекого ума. Все дела вершили три его секретаря: Альтести, Грибовский и Рибас, лица очень низкой нравственности, усердно заботившиеся о своём обогащении. Сам Зубов за это время получает княжеское достоинство и громадные поместья в новоприсоединённых польских областях.
          </div>
          <div style={{textIndent: "30px"}}>Павел I обошёлся с ним сначала ласково, но после смерти Екатерины Зубову велено было выехать за границу, а имения его были отобраны в казну.
          </div>
          <div style={{textIndent: "30px"}}>Благодаря ходатайству Кутайсова, Зубов вернулся в 1800 году в Россию и получил обратно свои конфискованные имения. Он был в числе заговорщиков и убийц Павла Петровича. Но наград за это не получил: Александр I обошелся с ним холодно.
          </div>
          <div style={{textIndent: "30px"}}>Последние годы жизни Зубов провел в местечке Янишки Виленской губернии, где о нем, как о помещике, осталась дурная слава у крестьян. В 1821 году он женился на Текле Валентинович, 19-летней дочке небогатой литовской помещицы, и перебрался из Литвы в курляндское поместье Руэнталь. Там Платон Александрович Зубов и умер  19 апреля 1822 года. Его единственная законная дочь, Александра, родилась через три недели после смерти князя, умерла в 1824 году и похоронена рядом с отцом.
          </div>
        </div>
    ),
  },
  {
    id: "MikhailNikolaevich",
    title: (
      <div
        style={{
          WebkitTextStroke: "1.2px #000",
          fontFamily: "'Dosis', sans-serif",

        }}
      >
        Романов Михаил Николаевич
      </div>
    ),
    content: (
        <div
            style={{
              padding: "10px",
              fontSize: 20,
              textAlign: "justify",
              fontFamily: "'Poppins', sans-serif",
            }}
        >
          <div style={{textIndent: "30px"}}><b>Романов Михаил Николаевич </b> [13(25).10.1832, Петербург, — 05(18).12.1909, Канн, Франция], великий князь, генерал-фельдмаршал (1878), генерал-адъютант (1856).
          </div>
          <div style={{textIndent: "30px"}}>Четвёртый сын российского императора Николая I. С 1857 г. женат на великой княгине Ольге Феодоровне, дочери великого герцога баденского Леопольда. С 1852 г. генерал-фельдцейхмейстер. В 1854 г. участвовал в военных действиях под Севастополем во время Крымской войны. В 1856 г. назначен вице-председателем комиссии, учрежденной для реформы армии, одновременно являлся членом комитета об учреждении кавалерийской академии. С 1859 г. – член комитета для рассмотрения состояния укреплений Балтийского и Черного морей. В 1860 г. назначен главным начальником военно-учебных заведений. Наместник Кавказа и командующий Кавказской армией (1862–1865) и войсками Кавказского военного округа (1865–1881). При нем окончательно были усмирены Чечня, Дагестан, Предкавказье и Западный Кавказ, учреждены: сухумский отдел из абхазских земель (1866), Черноморский округ (1867), Елизаветпольская губерния (1868), Карская и Батумская области (из земель, полученных от Турции в результате русско-турецкой войны 1877–1878 гг., 1879 г.). Во время Русско-турецкой войны 1877–1878 гг. – главнокомандующий Кавказской армией. В 1881–1905 гг. являлся председателем Государственного совета. В 1846 г. был избран почетным членом Императорского Русского географического общества; в 1855 г. утвержден почетным членом Императорской Академии наук; в 1896 г. избран почетным членом Императорского Русского археологического общества. Кроме того, состоял почетным членом Императорской военно-медицинской и Императорской Николаевской инженерной академий.
          </div>
          <div style={{textIndent: "30px"}}>Награжден орденами: российскими – Св. Андрея Первозванного, Св. Владимира 1-й ст., Св. Александра Невского, Белого Орла, Св. Анны 1-й ст., Св. Станислава 1-й ст., Св. Георгия 1-й, 2-й и 4-й ст.; иностранными: австрийским – Св. Стефана, баварским – Св. Губерта, баденскими Верности и Церингенского Льва, бухарским – Искандер-Салис, дармштадским – Людвига, неаполитанскими – Св. Фердинанда и Заслуг, нидерландским – Золотого Льва, прусскими – Черного Орла, Красного Орла и «За заслуги», румынским – Звезды 1-й ст., саксен-веймарским – Белого Сокола, саксонским – Зеленой Короны, сардинским – Анонсиады, турецким – Османие 1-й ст. с алмазами, шведским – Серафимов; дважды золотым оружием «За храбрость», одно из них с бриллиантами.
          </div>
        </div>
    ),
  },
  {
    id: "KonstantinPavlovich",
    title: (
        <div
            style={{
              WebkitTextStroke: "1.2px #000",
              fontFamily: "'Dosis', sans-serif",

            }}
        >
          Романов Константин Павлович
        </div>
    ),
    content: (
        <div
            style={{
              padding: "10px",
              fontSize: 20,
              textAlign: "justify",
              fontFamily: "'Poppins', sans-serif",
            }}
        >
          <div style={{textIndent: "30px"}}><b>Константин Павлович</b> вошел в российскую историю, прежде всего, как несостоявшийся император, хотя и провозглашенный. На протяжении 16 дней (с 9 по 25 декабря 1825 года) государственные учреждения Москвы и Петербурга признавали его императором и самодержцем Всероссийским Константином I, но фактически он никогда не царствовал и своего вступления на престол не признал.
          </div>
          <div style={{textIndent: "30px"}}>Великий князь Константин Павлович Романов родился (27 апреля) 8 мая 1779 года в Царском Селе. Он – второй сын императора Павла I и Марии Федоровны, брат Александра I. С детских лет Константин рос под присмотром своей бабки – Екатерины II, которая воспитывала его с перспективой возведения на константинопольский престол восстановленной Византии, но позже из этого ничего не вышло.
          </div>
          <div style={{textIndent: "30px"}}>Константин получил прекрасное домашнее образование, но интереса к наукам не проявлял. В 1795 году он был назначен полковником Петербургского гренадерского полка, затем шефом лейб-гвардии Измайловского полка, а в 1797 году – генерал-инспектором всей артиллерии и главным начальником кадетских корпусов. В последующие годы принимал участие в Итальянском и Швейцарском походах А.В. Суворова, за отличия в которых в 1799 году ему был пожалован титул Цесаревича (этот титул мог иметь исключительно наследник российского престола).
          </div>
          <div style={{textIndent: "30px"}}>Не смотря на все это, в юности Константин не раз попадал в немилость к отцу, но известие об убийстве Павла I воспринял крайне эмоционально и призывал строго наказать виновных в его смерти. Тогда в 1801 году, с воцарением Александра I, Константин, согласно Акту своего отца от 1797 года, стал наследником престола своего бездетного брата. Однако в манифесте в тексте присяги Александру I он упомянут не был (т.е. присяга приносилась в нарушение павловского закона). Следует сказать, что сам Константин царствовать не хотел и прибавлял: «Меня задушат, как задушили отца».
          </div>
          <div style={{textIndent: "30px"}}>С 1801 года он занял пост председателя Комиссии, разрабатывавшей меры по реорганизации армии. По инициативе Константина в русской армии началось формирование уланских полков. В последующие годы он участвовал в войнах против Наполеона (1805-1807 годов и в Отечественной войне 1812 года), а затем и в Заграничном походе, где достойно себя показал.
          </div>
          <div style={{textIndent: "30px"}}>Преследуя войска Наполеона, русская армия весной 1813 года заняла почти все Великое герцогство Варшавское. Александр I учредил временный верховный совет для управления делами герцогства во главе с генерал-губернатором В.С. Ланским, а организацию его войска поручил Константину. После восстановления Царства Польского и дарования ему Конституции, Константин Павлович стал главнокомандующим польской армией и фактическим наместником Царства Польского, после чего преимущественно жил в Варшаве.
          </div>
          <div style={{textIndent: "30px"}}>Еще в 1796 году он женился на принцессе Саксен-Кобургской, получившей в православии имя Анны Федоровны. Но брак был неудачным, и в 1820 году Константин добился его расторжения и женился на польской графине Иоанне Грудзинской, получившей титул светлейшей княгини Лович. Брак был морганатическим, поэтому родившиеся в нем дети лишались права на российский престол. Именно ссылаясь на этот брак и неспособность к государственному управлению, в 1823 году Константин тайно отрекся от престолонаследия. Это отречение было оформлено в виде манифеста Александра I, который следовало огласить после его кончины. В силу этого решения наследником престола становился следующий брат, великий князь Николай Павлович.
          </div>
          <div style={{textIndent: "30px"}}>После кончины Александра I посмертный манифест был вскрыт и оглашен, но большинство членов Государственного совета и сам Николай Павлович не решились выполнить волю покойного и присягнули императору Константину I Павловичу, к присяге привели и армию. Была даже отчеканена монета с его профилем – знаменитый редчайший константиновский рубль. Константин же, находясь в Варшаве, потребовал соблюдения манифеста и еще дважды подтвердил свое отречение (до конца жизни он продолжал титуловаться цесаревичем, но из очереди престолонаследия был исключен). После этого 25 декабря 1825 года российским императором был провозглашен Николай I.
          </div>
          <div style={{textIndent: "30px"}}>Но именно этот период «междуцарствия» создал ситуацию, которой воспользовались декабристы.  26 декабря 1825 года произошло восстание декабристов, формальным поводом которого стал отказ от переприсяги Николаю и защита прав Константина.
          </div>
          <div style={{textIndent: "30px"}}>Между тем Польшу все более охватывали волнения, росло число тайных обществ, стремившихся восстановить старые порядки, а вспыхнувшая на западе революция привели в 1830 году к восстанию поляков, к которому Константин Павлович не был готов. Поэтому в спешном порядке вместе со второй женой он был вынужден покинуть Варшаву. Но ему удалось отступить с русскими войсками, отведя их в пределы Российской Империи.
          </div>
          <div style={{textIndent: "30px"}}>В начале июня 1831 года Константин Павлович прибыл в Витебск, где поселился во дворце губернатора. Вскоре он заразился холерой и 27 июня 1831 года умер в Витебске. Погребен был в Петропавловском соборе Санкт-Петербурга.
          </div>
          <div style={{textIndent: "30px"}}>Законных детей у Константина не было, но было два внебрачных сына – Павел от многолетней его любовницы Жозефины Фридрихс и Константин от французской актрисы Клара-Анна де Лоран. Оба впоследствии стали генералами русской армии.
          </div>
        </div>
    ),
  },
  {
    id: "SmokingEkaterinaII",
    title: (
        <div
            style={{
              WebkitTextStroke: "1.2px #000",
              fontFamily: "'Dosis', sans-serif",

            }}
        >
          Форма одежды во время царствования Императрицы Екатерины II

        </div>

    ),
    content: (
        <div
            style={{
              padding: "10px",
              fontSize: 20,
          textAlign: "justify",
              fontFamily: "'Poppins', sans-serif",
            }}
        >
          <div style={{textIndent: "30px"}}><b>Форма одежды во время царствования Императрицы Екатерины II</b> изменялась весьма мало. По положению 1762 года, парадный мундир состоял из: суконного алого кафтана; воротника лацкана и черных триповых обшлагов с золотым галуном; черной стаметовой подкладки; медных пуговиц; шелковых с золотом эполетов на одном плече; суконного камзола лосаннаго цвета; полурубашки с батистовыми манжетами; коротких с шлифованными пряжками штанов, которые зимой были суконные лоссинного цвета, а летом белые полотняные или коломенковые; белых чулков; летом – башмаков с полотняными штиблетами или с пряжками из композитной меди, зимой – коротких сапогов с штибель-манжетами, стянутых также композитными пряжками. Волосы напудренные (но только в парадных мундирах); коса, обвитая черной шелковой лентой с волосяным на конце бантом. Шляпа полупуховая, обшитая золотым позументом и связанная золотыми шунрками; шелковые кисти с золотом на шляпе, волосяной белый бант, красный перьяной с белой верхушкой султан. В последствие по именному Высочайшему указу генерала-поручика Меллисино 19-го марта 1786 года было приказано изготавливать парадные кадетские мундиры без позумента, а выделенные же на него деньги тратить “на другое, на пользу служащих Корпуса”. С того же времени и шляпы стали обшивать вместо золотого галуна черной бархатной лентой, а эполеты делать с медными бляхами.
          </div>
          <div style={{textIndent: "30px"}}>Во время пребывания в лагере кадеты носили суконные полевые колеты с плисовыи воротниками и обшлагами, сначала красными, а в последствие черными. Погоны на колетах были желтые суконные, обшитые у кадетов – черной бархатной лентой, а у унтер-офицеров – узким золотым позументом.
          </div>
          <div style={{textIndent: "30px"}}>Тесаки были с медными грифами и белыми ножнами; темляки сначала – шелковые с золотом, а затем из красного, черного и желтого гаруса. У гренадеров или бомбардиров, по штату 1762 года, шапки были из толстой лакированной черной кожи с такими же козырьками, с изображенными на них золоченными гербами с изображением вензелевого имени Императрицы Екатерины II, и с султанами из разноцветных страусинных перьев. В последствие эти шапки заменены черными плисовыми, с красными суконными околышками, по швам они были обшиты золотой тесьмой; на верхушке были кисти, у кадетов – черные шелковые, а у унтер-офицеров – с золотой канителью. Егеря в строю носили полупуховые картузы с белыми полотняными бантами и перяными султанами, такими же как на шляпах. Ночью и во время плохой погоды в лагере кадеты надевали красные суконные плащи без рукавов. Ружья были с медным прибором и со штыками; погонные ремни и чехлы на полках были из черной кожи.
          </div>
          <div style={{textIndent: "30px"}}>Повседневное кадетское платье, по штату 1762 года, состояло из: суконного алого сюртюка с черным полуплисовым воротником и обшлагом; комзола и лосинных штанов; шляпы с волосяными бантами без галуна; башмаков и кожаных черных штиблетов.
          </div>
          <div style={{textIndent: "30px"}}>По положению 1784 года определение формы повседневного платья было представлено директору и с этого времени кадеты носили серые суконные фраки и панталоны, и красные суконные жилеты; воротники на фраках были черные полуплисовые.
          </div>
          <div style={{textIndent: "30px"}}>Корпусные офицеры в строю и в праздничные дни носили красные артиллерийские мундиры, а в будни дежурили в серых фраках, одинаковой формы с кадетскими, и в знаках (не понял как перевести)
          </div>

        </div>
    ),
  },
  {
    id: "SmokingAlexI",
    title: (
        <div
            style={{
              WebkitTextStroke: "1.2px #000",
              fontFamily: "'Dosis', sans-serif",

            }}
        >
          Форма одежды воспитанников и офицеров Второго кадетского корпуса во время царствования Императора Александра I

        </div>
    ),
    content: (
        <div
            style={{
              padding: "10px",
              fontSize: 20,
              textAlign: "justify",
              fontFamily: "'Poppins', sans-serif",
            }}
        >
          <div style={{textIndent: "30px"}}>В кадетской форме одежды в первые три года правления Александра I не было сделано значительных изменений. Позумент (серебряный) было повелено иметь только унтер-офицерам: на обшлагах – широкий, а на воротнике – из узкого, по одной петлице с каждой стороны. Шляпы больше не обвивались позументом, но имели только серебряные петлицы; кокарды были из черной шелковой ленты с оранжевыми каймами, а султанчики из разноцветного гаруса. С 1804 года совершенно изменен покрой обмундирования: вместо прежних открытых мундиров с лацканами введены двубортные, застегнутые до верху, без лацканов, с медными пуговицами, вместо оловянных. Воротники, обшлага, нашивки на фалдах остались красные суконные, подбой – красный стаметовый. Воротники и обшлага обшивались как у унтер-офицеров, так и у кадетов, золотым позументом. Вскоре шляпы заменены киверами, сначала поярковыми, а в последствие суконными, с верхом из лакированной кожи. Спереди они имели кокарды такие же, какие были на шляпах, и парусные кардончики с султанчиками, а сверху обшивались золотым позументом: у унтер-офицеров в два ряда, а у кадетов в один. В 1806 году гренадерам даны на кивера вместо кокард гранатки, и вместо гарусных султанчиков – черные волосяные султаны. В том же году обрезаны косы, отменено пудрение волос и введена форма, которая с небольшими изменениями сохранилась до конца царствования Императора Александра I. Летом панталоны были белые, холщевые , с штиблетами; зимой, в парад – белые суконные, с накладными кожаными крагами, которые застегивались с боку медными пуговицами, а повседневные серые суконные, с пришивными кожаными крагами. Сапоги были введены короткие. Портупеи, вместо поясных, введены надеваемые через плечо, крестообразно с перевязью; на мундирах было велено иметь по два белых погона. В 1811 году даны на кивера медные гербы в виде полусолнца и белые шкеты, а позумент на киверах был отменен.
          </div>
          <div style={{textIndent: "30px"}}>Офицерам 2-го Кадетского Корпуса уже в 1801 году было указано принять форму мундиров по образцу 1-го кадетского корпуса с разницей только в том, что подбой вместо красного был темно-зеленый. В 1804 году во время изменения формы кадетского обмундирования были сделаны изменения и в офицерской форме: на воротники и обшлага дано золотое шитье, употребляемое до сих пор. С 1807 года повелено носить на мундирах гвардейские эполеты и в том же году введены сюртуки: по образцу общевоенных, но только с темно-зеленой выпушкой возле воротника и обшлагов. Сначала сюртуки носили без эполетов, а в 1810 году указано иметь на них эполеты такие же, как на мундирах. В том же, 1810 году, офицеры начали носить в строю, вместо шляп, кивера, на подобие кадетских, но с вызолоченными гербами и с серебряными этишкетами.
          </div>


        </div>
    ),
  },
  {
    id: "SmokingNikolayI",
    title: (
        <div
            style={{
              WebkitTextStroke: "1.2px #000",
              fontFamily: "'Dosis', sans-serif",
            }}
        >
          Форма одежды воспитанников и офицеров Второго кадетского корпуса во время царствования Императора Николая I

        </div>
),
content: (
    <div
        style={{
          padding: "10px",
          fontSize: 20,
          textAlign: "justify",
          fontFamily: "'Poppins', sans-serif",
        }}
    >
      <div style={{textIndent: "30px"}}>В форме кадетской одежды, вскоре после восхождения на престол Императора Николая I-го, сделаны значительные перемены. Вместо двубортных введены однобортные с красной по борту выпушкой мундиры; пуговицы, вместо гладких, c выпуклым изображением государственного герба. Белые короткие панталоны с крагами заменены длинными панталонами одинакового цвета с мундирами, с красной по бокам выпушкой и с черными суконными штиблетами. Впоследствии штиблеты отменены. На погонах вырезаны номер Корпуса (2. К.), подложенный палевым сукном. На киверах герб увеличен и вместо бывших этишкетов введены белевые шнурки, охватывающие верхнюю часть кивера; у унтер-офицеров и кадетов темляки вовсе отменены, а фельдфебелям даны серебряные. Помимо того фельдфебели, унтер-офицеры и ефрейторы отличены нашивками из узкого золотого позумента на погонах: у фельдфебелей вокруг погонов и посередине, у старших унтер-офицеров только вокруг, а у младших только по середине, и у ефрейторов поперек погонов.
          </div>
          <div style={{textIndent: "30px"}}>Тогда же изменено повседневное кадетское платье, которое состоит из: темно-зеленой куртки с красным воротником и с погонами одного цвета с мундирными, воротники без галуна, но фельдфебели, унтер-офицеры и ефрейторы имеют как на мундирах, так и на погонах позумент; панталоны зимой – серые суконные, а летом – нанковые, дикого цвета.
          </div>
          <div style={{textIndent: "30px"}}>В офицерской форме одежды сделаны изменения, соответствующие кадетской форме: мундир положен однобортный, панталоны длинные, зеленого мундирного сукна, с короткими сапогами. На эполетах вышит серебром номер Корпуса, вместо этишкетов, на киверах, введены серебряные шнуры. Помимо того, шпаги заменены полусаблями и на эполетах должны быть серебряные звездочки для различия чинов.
          </div>
          <div style={{textIndent: "30px"}}>Вместо киверов в 1842 году кадетам и офицерам даны каски с гербом и чешуей по прежнему образцу, и с гранатой вверху для размещения черного волосяного султана; каска без султана заменяла прежнюю офицерскую шляпу. Чешуя на касках носилась поднятой и застегнутой поверх козырька. Впоследствии для неранжированной роты были отменены мундиры и каски, отпускная форма положена одинаковая вместе с повседневной, состоящей из куртки, cерых панталонов и фуражки.
          </div>


        </div>
    ),
  },
  {
    id: "SmokingAlexII",
    title: (
        <div
            style={{
              WebkitTextStroke: "1.2px #000",
              fontFamily: "'Dosis', sans-serif",

            }}
        >
          Форма одежды воспитанников и офицеров второго кадесткого корпуса в царствование императора Александра II
        </div>
    ),
    content: (
        <div
            style={{
              padding: "10px",
              fontSize: 20,
              textAlign: "justify",
              fontFamily: "'Poppins', sans-serif",
            }}
        >
          <div style={{textIndent: "30px"}}>При вступлении на престол Императора Александра II форма одежды подверглась многим различным изменениям. Прежде всего отменены мундиры, вместо которых даны полукафтаны одного цвета с прежними мундирами, они тоже двубортые c пуговицами и подбоем прежнего образца и красным воротником; но воротник разрезной с закругленными верхними концами, застегивающийся только снизу на два крючка; вместе с полукафатном взамен прежних мундирных брюк положено носить шаровары. Также сделаны изменения в аммуниции: прежние белые перевязи и ремни у сумки и ранца заменены черными из лакированной кожи, а портупея у тесаков кадетов, впоследствии у полусабель офицеров, дана поясная, надеваемая поверх кафтана тоже из черной лакированной кожи с медной бляхой для застежки. Для отличия унтер-офицерских и ефрейторских званий установлены нашивки поперек погона и галун на воротниках мундиров имелся только у унтер-офицеров. Шитье на воротниках и обшлагах у офицеров установлено по измененному рисунку: уже и менее сплошное против прежнего; на офицерских сюртуках вместо эполетов носятся погоны. Цвет погонов у кадетов и офицеров, и подбоя у офицерских эполетов изменен вместо белого на синий.
          </div>
          <div style={{textIndent: "30px"}}>В отмену прежнего правила указано нетолько в небольшие морозы, но и вообще в холодное и ненастное время носить шинели в рукава и надевать наушники и рукавицы; рукавицы вместо прежних замшевых должны быть из черного сукна. В последнее время, cверх того, даны шинели нового образца, которые делаются полнее прежних, с более длинным лифом и с отложным воротником такого размера, чтобы поднятый воротник закрывал уши и его концы спереди прикрывали лицо; у офицеров имеются плащи серого сукна с погонами; каски отменены, а взамен их даны шапки того образца, суконные, c ремешком вместо чешуи и к ним гербы и султанчики уменьшенного размера; в ненастное и холодное время положено надевать поверх головного убора башлыки из верблюжьей кожи; офицерам же в строю положено носить длинные спаоги до колен.
          </div>

        </div>
    ),
  },
  {
    id: "SmokingPavelI",
    title: (
        <div
            style={{
              WebkitTextStroke: "1.2px #000",
              fontFamily: "'Dosis', sans-serif",

            }}
        >
          Форма одежды воспитанников и офицеров второго кадесткого корпуса в царствование императора Павла I
        </div>
    ),
    content: (
        <div
            style={{
              padding: "10px",
              fontSize: 20,
              textAlign: "justify",
              fontFamily: "'Poppins', sans-serif",
            }}
        >
          <div style={{textIndent: "30px"}}><b>В начале правления Императора Павла I</b> кадетские мундиры были темнозеленые с красными суконными обшлагами, лацканами и опушкой; красный стаметовый подбой; медные пуговицы; у унтер-офицеров на обшлагах был золотой позумент. Суконые палевые камзолы и штаны, зимой – черные суконные штиблеты, а летом – белые холщевые башмаки с медными пряжками; белые канифасные галстуки с медными пряжками; воротники у рубашек были широкие, из голландского полотна; шляпы с золотым позументом, кистями, бантом и султанчиком из белого гаруса, смешанного с черным и оранжевым, портупеи и лосинные перевязи. На ружьях погонные ремни и красные чехлы на полках.
          </div>
          <div style={{textIndent: "30px"}}>В начале 1800 года в форме офицеров и кадетов последовали изменения: штаб- и обер-офицерам Высочайше было повелено иметь на шляпах широкий серебряный галун и петлицы; банты из черной шелковой ленты с оранжевыми коймами и черные саржевые гластуки; кадетам же на шляпах – узкий серебряный позумент и петлицы, и такой же позумент на обшлагах мундиров; как кадетам, так и унтер-офицерам: оловянные пуговицы, галстуки из черного тонкого сукна.
          </div>

        </div>
    ),
  },
];
