export const personDescription = [
  {
    id: "Kutuzov",
    title: "Кутузов Михаил Илларионович",
    content: (
      <div style={{ padding: "10px", fontSize: 20, textAlign: "justify" }}>
        <p style={{ textIndent: "30px" }}>
          <b>ГОЛЕНИЩЕВ-КУТУЗОВ Михаил Илларионович</b>{" "}
          <i>[5(16).9.1747, С.-Петербург, – 16(28).4.1813, Бунцлау, Силезия]</i>
          , государственный и военный деятель, генерал-фельдмаршал (1812), граф
          (1811), светлейший князь Смоленский (1812).
        </p>{" "}
        <p style={{ textIndent: "30px" }}>
          Происходил из старомосковского дворянского рода. По окончании
          артиллерийско-инженерной школы в янв. 1761 произведен в
          инженер-прапорщики и оставлен при ней для обучения воспитанников
          математике. С марта 1762 состоял адъютантом петербургского и
          эстляндского губернатора. Затем в чине капитана назначен в
          Астраханский пехотный полк.
        </p>{" "}
        <p style={{ textIndent: "30px" }}>
          В 1764 – 1765 служил в войсках, находившихся в Польше. В авг. 1767
          привлечён для работы в Комиссии по составлению нового Уложения. С 1768
          вновь находился в Польше, где сражался с польскими конфедератами. В
          1770 назначен дивизионным квартирмейстером в Молдавскую армию, в
          составе которой принял участие в Русско-турецкой войне 1768–1774. Во
          время войны находился в сражениях при Рябой Могиле, Ларге и Кагуле,
          где проявил себя храбрым, энергичным и инициативным офицером. За
          отличие произведен в подполковники. В 1772 переведён во 2-ю Крымскую
          армию, где командовал гренадерским батальоном.
        </p>
        <p style={{ textIndent: "30px" }}>
          В июле 1774 в бою тяжело ранен в левый висок пулей, вышедшей у правого
          глаза. Лечился за границей. По возвращении в Россию в июне 1777
          произведен в полковники и вскоре назначен командиром Луганского
          пикинёрного полка. В июне 1782 произведен в бригадиры и через год
          назначен командиром Мариупольского легкоконного полка. За успешные
          переговоры с крымским ханом, уступившим России свои владения от Буга
          до Кубани, в нояб. 1784 произведен в ген.-майоры и возглавил им же
          сформированный Бугский егерский корпус.
        </p>{" "}
        <p style={{ textIndent: "30px" }}>
          В начале Русско-турецкой войны 1787–1791 во главе корпуса охранял
          юго-западную границу по р. Буг. Принимал участие в боях под Очаковом,
          снова ранен. С янв. 1789, командуя различными соединениями, участвовал
          в боевых действиях под Каушанами и при взятии крепостей Аккерман и
          Бендеры.
        </p>{" "}
        <p style={{ textIndent: "30px" }}>
          В дек. 1790 отличился при штурме Измаила, где командовал 6-й штурмовой
          колонной. За отличие в марте 1791 удостоен чина ген.-поручика. В июне
          1791 разгромил турецкое войско при Бабадаге. Командуя войсками левого
          фланга, отличился в Мачинском сражении 1791, в котором показал себя
          искусным мастером манёвренных действий. В окт. 1792 направлен
          чрезвычайным и полномочным послом в Константинополь, где разрешил в
          пользу России ряд важных вопросов и значительно улучшил
          взаимоотношения с Османской империей.
        </p>{" "}
        <p style={{ textIndent: "30px" }}>
          С сент. 1793 – казанский и вятский ген.-губернатор. В 1794 назначен
          главным директором Сухопутного шляхетского кадетского корпуса.
          Одновременно в февр. 1795 назначен инспектором Финляндской инспекции.
          С дек. 1797 – шеф Рязанского мушкетерского полка. В янв. – марте 1798
          успешно выполнил дипломатическую миссию в Берлине, в результате
          которой Пруссия склонилась к союзу с Россией и Англией против Франции.
        </p>
        <p style={{ textIndent: "30px" }}>
          Произведенный в 1798 в генералы от инфантерии, некоторое время
          командовал Финляндской инспекцией, вел переговоры со Швецией по
          демаркации границ. С окт. 1799 – литовский военный губернатор и шеф
          Псковского мушкетерского полка. В июне 1801 назначен военным
          губернатором С.-Петербурга, а в июле 1801 – инспектором по инфантерии
          Финляндской инспекции. В 1802, попав в опалу, испросил увольнения от
          службы и 3 года жил в своём поместье.
        </p>{" "}
        <p style={{ textIndent: "30px" }}>
          В авг. 1805 назначен главнокомандующим русскими войсками,
          направленными против Наполеона в ходе Русско-австро-французской войны.
          В результате разгрома австрийской армии в Ульмском сражении русская
          армия оказалась один на один с противником, обладавшим значительным
          превосходством в силах. Сохраняя войска, К. в окт. 1805 совершил
          марш-манёвр от Браунау к Ольмюцу и, нанеся поражение маршалам Й.
          Мюрату под Амштеттеном и Э. Мортье под Дюренштейном, вывел войска
          из-под нависшей угрозы окружения. Однако проигранное сражение под
          Аустерлицем заставило его отвести войска в Россию. Александр I,
          фактически отстранивший К. от командования войском, возложил на него
          ответственность за неудачу. В сент. 1806 назначен военным губернатором
          Киева. В марте 1808 направлен в Молдавскую армию и возглавил ее
          главный корпус (8-я и 22-я дивизии), однако из-за конфликта с
          главнокомандующим ген.-фельдмаршалом А.А. Прозоровским был назначен
          виленским губернатором. В марте 1811 возвратился в Молдавскую армию ее
          командующим. В окт. 1811 возведен в графское достоинство. Нанеся
          поражение турецкой армии под Рущуком и Слободзеей, заставил Турцию
          заключить весной 1812 выгодный для России Бухарестский мир. За это в
          июле 1812 возведен в княжеское достоинство.
        </p>{" "}
        <p style={{ textIndent: "30px" }}>
          С началом Отечественной войны 1812 последовательно занимал должности
          командующего Нарвским корпусом, Петербургским ополчением, всеми
          войсками в Петербурге, Кронштадте и Финляндии. С авг. 1812 – член
          Госсовета. Ввиду напряжённой военной обстановки и настойчивых
          требований, исходивших от армии и народа, император Александр I 8(20)
          авг. назначил его главнокомандующим действующей армией. Прибыв к
          войскам 18(30) августа, вскоре дал генеральное сражение при Бородине,
          за которое был удостоен чина ген.-фельдмаршала. На военном совете в
          Филях принял решение отвести армию на восток и оставить Москву, что
          позволило ему сохранить армию и перевести войну в новую фазу – войну
          на истощение противника. Совершив фланговый Тарутинский манёвр, вывел
          армию из-под удара, закрыл для Наполеона пути движения в южные районы
          страны и создал благоприятные условия для организации и подготовки
          контрнаступления. В дальнейшем нанес поражение армии Наполеона под
          Вязьмой и Красным, окончательно разгромив ее на р. Березина.
        </p>{" "}
        <p style={{ textIndent: "30px" }}>
          В дек. 1812 пожалован титулом светлейшего князя Смоленского. После
          изгнания французов из России участвовал в разработке дальнейших планов
          ведения войны. Скончался в начале заграничного похода русской армии в
          силезском городке Бунцлау, тело его было забальзамировано и отправлено
          в С.-Петербург, где погребено в Казанском соборе. В 1826 в память
          заслуг покойного Псковскому пехотному полку навечно было повелено
          именоваться пехотным фельдмаршала князя Кутузова-Смоленского полком.
        </p>{" "}
        <p style={{ textIndent: "30px" }}>
          Награжден орденами: российскими – Св. Андрея Первозванного и алмазными
          знаками к ордену, Св. Владимира 1-й и 2-й ст., Св. Александра
          Невского, Св. Иоанна Иерусалимского, Св. Георгия 1-й, 2-й, 3-й и 4-й
          ст.; иностранными: австрийским – Военным Марии Терезии 1-й ст.,
          голштинским – Св. Анны, прусскими – Черного Орла и Красного Орла 1-й
          ст., золотым оружием «За храбрость» с алмазами и лаврами.
        </p>
      </div>
    ),
  },
];
